{"preqs":"ADA1111 or ADA3111 if taken as part of an undergraduate course; ADA4500 if taken as part of a Masters\u0027 course","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {ADA1111} or  Must have passed an (I/W) unit in {ADA3111} or  Must have passed an (I/W) unit in {ADA4500})","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (On-campus block of classes)","Second semester 2017 (On-campus block of classes)","Term 2 2017 (On-campus block of classes)","Term 4 2017 (On-campus block of classes)"]},{"location":"Clayton","time":["First semester 2017 (Off-campus block of classes)","Second semester 2017 (Off-campus block of classes)","Term 2 2017 (Off-campus block of classes)","Term 4 2017 (Off-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Design thinking advanced","description":"This unit builds on ADA1111 or ADA3111 for students in undergraduate courses, and on ADA4500 for coursework Masters\u0027 students. The unit will extend students\u0027 individual understanding of Design Thinking approaches, supporting the development of valuable personal practices to inform new proposals relevant to students\u0027 interests and disciplines.  Students will explore skills that support design insight and innovation and will refine bespoke approaches to the resolution of project-based problems and explorations. Students will develop their ability to investigate context and to identify actionable opportunities, applying and refining Design Thinking principles to connect project potential to real-world opportunities.The unit highlights the \u0027opportunities of wickedness\u0027 in ill-defined design problems, and will focus on student development and application of communication tools that support the fruitful exploration of personal perspective.  Reflective practices focussing on the experience, engendering and application of conceptual momentum will be a key element of the unit.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"ADA4111","eftsl":0.125}