{"preqs":"12 credit points at first year level in Art History \u0026 Theory, or Theory of Art \u0026 Design, or Visual Culture, or permission from the Unit Coordinator","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {AHT%, CLS%, TAD%, VSA%}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"AHT2712","scaBand":1,"unitName":"Curating: Histories and theories","description":"This unit will offer students an introduction to the most important and influential theories of curating and provide an overview of the history of curating from the mid-18th century on. Although the unit will focus on curating insofar as it involves art objects, it will also point to both historical instances of curation that did not involve art objects (eg. Wunderkammers) and present-day instances of curating where the term has become virtually synonymous with any act of selection (music, photographs, food). The overall aim of the unit is provide students with a working vocabulary so that they can ask critical questions of the contemporary practice of curation.Lectures will largely provide a chronological history of curation, starting with early museums and collections, but with an emphasis on the rise of curating and the figure of the curator from the mid-1970s on. A number of key instances of curation (particular exhibitions and international Biennales and Triennials) will be selected for particular analysis. In this way, students will be given both an overall history of art curation and a way of thinking the term\u0027s almost infinite expansion in the present. The overall aim of the unit is to provide students with an appropriate working method for any curation they might undertake in the future and a way of thinking about issues of curation if they choose to work in a museum or write about art. In some ways, the unit is intended as a preliminary to the more practice-based unit Curating: Practice, although this is not its only possible outcome.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"AHT3712","eftsl":0.125}