{"preqs":"12 credit points at first year level in Art History \u0026 Theory, or Theory of Art \u0026 Design, or Visual Culture, or permission from the Unit Coordinator","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {AHT%, CLS%, TAD%, VSA%}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"AHT2001","scaBand":1,"unitName":"Art writing and criticism","description":"Art Writing and Criticism is a unit in the \"practical\" dimension of the study of art history. Students will explore the various registers, genres and venues in which the discussion of art is carried out today - from academic journals, magazines, newspapers to online. Students will both gain a theoretical perspective on these different approaches to the discussion of art and their various histories and themselves undertake a number of practical exercises in writing in these different styles and formats. Students will especially be directed to thinking what is the future of the discussion of art in the new age of the internet and the electronic media. What opportunities can they think of for themselves and others to put the art-historical knowledge they otherwise gain in their studies to practical use in the public arena?Throughout the unit a number of practical exercises in writing about art will be undertaken, giving students a sense of the different requirements for different kinds of writing. Above all, they will form the habit of writing about art, and understand that writing about art is a \"practice\" just as artists have a practice. To this extent, Art Writing and Criticism must be seen as allied to the new units offered in art curation (Curating: Histories and Theories and Curating: Practices) in opening up to students studying Art History certain \"practical\" or \"vocational\" outcomes for their skills and knowledges.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"AHT3001","eftsl":0.125}