{"preqs":"12 credit points at first year level in Art History \u0026 Theory, or Theory of Art \u0026 Design, or Visual Culture, or permission from the Unit Coordinator","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {AHT%, CLS%, TAD%, VSA%}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"AHT2722","scaBand":1,"unitName":"Curating: Practices","description":"Curating: Practices is intended as a complement to Curating: Histories and Theories (although the units may be taken in any order). In this unit, students are encouraged to plan and execute one or several acts of curation. Following the practice of contemporary curation, these acts of curation need not necessarily involve works of art. Students may curate photographs, their hobbies, pieces of art writing, their own objects or those of others. However, the emphasis will be on the final \"public\" (whether in reality or using such technologies as the internet) exhibition of such curation and the student\u0027s ability to explain and justify this curation. Students will work with their lecturer throughout the semester to develop this exhibition/series of exhibitions. Classes will consist of 3-hour long seminars in which the lecturer works with the students, and the students along with the lecturer will hold \"crit\" sessions in which proposed and upcoming exhibitions are discussed and workshopped. As in art-making classes, an end-of-class overall exhibition will be planned, and part of the unit will require students (along with the lecturer) to plan how such an overall exhibition of exhibitions might be conceived, planned and brought to practical realisation. It is even possible that in the medium term, this unit will become responsible for a number of end-of-year and end-of-semester exhibitions around the campus.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"AHT3722","eftsl":0.125}