{"preqs":"Twelve credit points of first-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {ACL1%, AEH1%, AMU1%, ASA1%, ATS1%, AZA1%}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS2906, ATS3906}","endDate":""}],"locationAndTime":[{"location":"Malaysia","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.545454545,"learnScore":4.482295482,"learnResponse":42,"proh":"ATS2906","scaBand":1,"unitName":"Genders, sexualities and religions in Southeast Asia","description":"This unit explores the intersections of genders, sexualities and religions within the political, social-cultural context of Southeast Asia. This focus is based on the premise that the impact of religions and by extension, ethnicities are significant to how genders and sexualities are understood and lived out in this region. Within the larger framework of Gender and Sexuality Studies, the privileging of contemporary debates, issues and concerns arising from this geographical region demonstrates realities that are situated and grounded. Within an inter-disciplinary framework, feminist and queer theories are critically applied to topics covered that include: pluralisms or fluidity of genders and sexualities in religion, narratives of becoming in the family, faith community and cyberspace, sexual citizenship in the national imaginary, construction of masculinities and femininities of those who inhabit border zones of being socially excluded/included, such as youth, migrants, sex workers and ascetics; and agency in revisiting the impasse of the universality versus cultural relativism of rights. The unit aims to enable students to reflexively engage with questions of identity, agency and praxis on the distinctiveness/\u0027Asianness\u0027 of doing genders and sexualities in this region, and the value and limits of using an intersectional analysis on genders, sexualities and religions.","enjoyResponse":42,"faculty":"Faculty of Arts","unitCode":"AMU2906","eftsl":0.125}