{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Malaysia","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Contemporary feminisms in Asia","description":"This unit as a whole explores what constitutes feminist knowledges and practices in Asia. As feminisms are historically \u0027western-centred\u0027, the unit considers the ways in which these resonate with lived realities in Asia. As such, feminist knowledges and practices of \u0027women of colour\u0027 (e.g. feminist-postcolonial thought) are privileged in this unit. Highly interdisciplinary in its concerns, the unit examines fluid and contextual characteristics of a \u0027who is a feminist\u0027; how feminisms are practised vis--vis transformations in and through the body, dress (e.g. veiling) or fashion, gender-based violence and gender justice; what constitutes feminist knowledge (i.e. standpoint epistemologies) and who owns or produces such knowledge  (e.g. those who inhabit the margins such as queers, masculinities, diaspora, cyborgs, etc.). The unit aims to enable students to reflexively engage with the relevance of feminist theorising and practice by critically applying concepts and questions of identity, agency and feminist praxis to contemporary debates, issues or concerns. Feminisms have relevance when it potentially questions assumptions or biases even prejudices, reviews existing practices, particularly those that lead to gender-based discrimination and violence, opens-up possibilities for providing solutions to a particular problem or redress to a social injustice or spaces of negotiation to a controversy or impasse.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"AMU3560","eftsl":0.125}