{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {AMU2744, ATS2744, ATS3744}","endDate":""}],"locationAndTime":[{"location":"Malaysia","time":["Summer semester B (starts January) 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"Any other Workplace Learning Internship unit","scaBand":1,"unitName":"Workplace learning internship","description":"The internship provides students with the opportunity to integrate theory with practice, and to gain first-hand experience in working in the area of specialty in which they want to pursue after graduation. The work placement is aimed at consolidating and extending what they have learnt from core units and other Degree units, through experiential learning. The unit develops their understanding of the application of academically obtained knowledge and skills in a workplace environment, and facilitates their acquisition of work-based networks for potential employment opportunities. Separate internship programs are drawn up for each student.As a capstone unit for those who intend to major in Gender Studies, this unit serves as the practicum for Gender and Sexuality Studies. The capstone experience enables these students to reflexively engage with the application of feminist and queer theories to the workplace. Work placements in non-governmental organisations in global contexts are strongly encouraged as these settings led themselves more adequately to such critical engagement of synergising the learning in the classroom and learning within the community. Feminist praxis that is aimed at realising social justice potentially finds expression through student- assessment of the relevance of a transformative education that potentially leads to exciting career prospects.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"AMU3744","eftsl":0.125}