{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3858}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Malaysia","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.75,"learnScore":4.416666667,"learnResponse":6,"proh":"ATS3858","scaBand":1,"unitName":"Writing experiments","description":"This unit approaches creative writing in terms of its status as a product of processes of experimentation (as distinct from personal expression). Students will explore a range of strategies for experimenting with forms and with themes through weekly exercises, investigations into theories from inter-disciplinary fields of study (e.g. communication, literary, film, gender/queer studies, etc.), and contextualised in varied social-political and cultural contexts. The major composition that is built on weekly exercises has a thematic focus that is student-driven and demonstrates the processes of researching, drafting and editing creative texts. The unit is oriented towards practical and critical application of advanced experimental strategies and thus emphasises the importance of research into literary, non-literary, fictional, non-fictional texts so that students can better appreciate the extent of originality of style and content of their work in relation to that of published authors. The unit is also oriented towards the production of effective and experimental writing, and the importance of reflecting on creative work through the critical techniques of exegesis.","enjoyResponse":6,"faculty":"Faculty of Arts","unitCode":"AMU3858","eftsl":0.125}