{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3127}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Malaysia","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.444444444,"learnScore":4.256410256,"learnResponse":27,"proh":"ATS3127","scaBand":1,"unitName":"Stardom: Celebrity, society and power","description":"Since the early 20th century film stars have been a central feature of cinema and have attained a prominent place within broader culture and society. They appear in magazines, on billboards, on television programmes, and now have a strong presence on the internet. The importance of stars stems from their economic function within cinema, their contributions to the meanings and affects of films, and their ideological role in defining and shaping popular conceptions of identity in societies at particular points in time. This course will offer a thorough interrogation of the star phenomenon, combining theoretical work derived from the field of \u0027star studies\u0027 with empirical analyses of specific films and stars. A host of extra-filmic materials, such as magazine articles, interviews, film reviews and promotional materials will also be analysed as students seek to identity the defining features of a number of star personas. Topics covered will include the history of stardom from the silent \u0027gods and goddesses\u0027 to modern day television stars and celebrity culture; the ideological role of stars in circulating and revealing dominant attitudes to class, gender, sexuality and race/ethnicity; and the cultural and national specificities of stardom through case studies of American, French, Indian and Southeast Asian stars. In doing so, there will be emphasis on the contribution stars make to the pleasures of cinema, while remaining attentive to the political implications of these hugely popular and highly influential representations of selfhood.","enjoyResponse":27,"faculty":"Faculty of Arts","unitCode":"AMU3127","eftsl":0.125}