{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {WTR4004}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04}","endDate":""}],"locationAndTime":[{"location":"South Africa","time":["Term 2 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Water governance and policy","description":"Water governance refers to the diverse range of political, social, economic and administrative arrangements within which water resources are managed and water needs are met by different sectors of society. In this unit, students are introduced to key concepts of water governance addressing in particular: the interaction between water governance, poverty and development; institutional and legal frameworks for formal as well as informal water provision; core features of transboundary arrangements as well as the core issues to be addressed in the design, implementation and monitoring of water governance initiatives. The special features of water governance in Southern Africa and Africa generally are specifically analysed with attention paid to successes, failures and lessons to be learnt from other contexts.  Issues of gender and social exclusion are also specifically addressed.  Specific topics covered include; Water governance: An overview Water governance, poverty, industrialization and development - conceptual issues The tasks of water governance in developing country contexts - key concepts and their critique Water governance: institutions, organizations, rights, markets, law -Southern African aspects in comparative perspective Transboundary aspects of water governance  - Southern African aspects in comparative perspective Design and implementation of water governance initiatives - general and Southern African aspects Evaluation of water governance  initiatives - general and Southern African aspects Ensuring and maintaining access - gender, social exclusion and good governance","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"APG4826","eftsl":0.125}