{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {4015}","endDate":"31/12/2017"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {CRJ5004}","endDate":"31/12/2017"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {CJM4004}","endDate":"31/12/2017"}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"CRJ5004","scaBand":1,"unitName":"Criminal behaviours and enterprises: Individuals, groups and organisations","description":"This unit examines the complexity of criminal behaviours and the range of criminological theories espoused in order to explain such diverse behaviours.  Humans are rule-making and rule-enforcing beings, but not all of us conform to these rules. Many violate the rules and are subject to sanctions and punishment. Individual, group and organisational criminal behaviours and enterprises are examined in this unit. A sophisticated analysis of criminal behaviours includes exploration of biological, psychological and social explanations of crime and the interactionist tradition including differential association theory. Crowd disorders and street gang behaviours will be examined. Organisational and institutional criminal behaviours extend from white-collar and corporate criminal activity to the dynamics of political crimes of violence, corruption and human rights violations that can be committed by the state and against the state. The unit involves study of definitional and conceptual issues, causes, methods of control and the effects of such organisational criminal behaviour. The unit examines the legal controls and responses by governments and other agencies in order to curb and prevent criminal behaviours of individuals, groups and organisations.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"APG4264","eftsl":0.25}