{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {MDM4070, MIR4170}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (On-campus block of classes)","Second semester 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"MDM4070, MIR4170","scaBand":2,"unitName":"Responding to international disasters and humanitarian crises","description":"The unit aims to promote the development of a broad and critical conceptual and practical understanding of international disasters and humanitarian crises. It will bridge the response from \"domestic\" to \"the international\" and also between \"disasters\" and \"humanitarian crises\" and provide an introduction to other international health electives.The unit will define the elements and interrelationships of the international disaster and humanitarian crises response system and examine contemporary perspectives of humanitarian principles. The unit will outline the definitions, classification and epidemiology of disasters and humanitarian crises with an emphasis on the Oceania and South East Asian regions. This background, combined with an exploration of the literature of recent disaster and humanitarian crises, will be used to interpret relevant international standards and guidelines, which have evolved in recent years to guide policy and practice for international disaster and humanitarian response. The unit will introduce the application of guidelines for assessment, planning, and monitoring to plan for appropriate health action in disasters and humanitarian crises, identify key issues relating to vulnerable groups, and the socio-political and cultural contexts. These principles will then be applied to examine the key elements in preparing for an international response as a team member, and the expectations of appropriate professional behaviour whilst on field deployment. The unit will conclude with examining the implications of these principles for both community and responder education and identifying research opportunities in the field of international disasters and humanitarian crises.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"APG5089","eftsl":0.125}