{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Term 3 2017 (On-campus block of classes)","Winter semester 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Global journalism: Hong Kong field school","description":"What does it take to get a job in journalism in Asia - and why is Hong Kong so vital to the global news industry? In this unit, students will travel to the Asian media capital to explore why this world city is the big draw for news companies from around the globe.The program begins online in June, when students delve into the organization, culture and publications of Asian and international media outlets operating in Hong Kong. To follow, students attend an intensive workshop at Monash University (Caulfield) to deepen their understanding of the diversity and interconnectivity of Hong Kong\u0027s news media, while consolidating research skills to formulate individual projects on their chosen topic.Then, over seven days in July, students travel to Hong Kong and the harbour-front news hub of Wan Chai to visit some of the world\u0027s most prestigious publishers and agencies. How is journalism practiced here, where regional political and economic developments attract global attention? What journalistic models thrive amid the sweep of technological, industrial and social changes affecting Asia and the broader news industry? Why have global companies such as CNN, Time, BBC International and Bloomberg made Hong Kong their \u0027home away from home\u0027? And how might this city offer journalists a unique window onto the global influence of China?Students will draw from scholarly and popular literature, as well their immersive field-school experience, to complete their research projects.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"APG5190","eftsl":0.25}