{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Global jihad?","description":"Numerous states, including Australia, have declared that their greatest security threat comes from groups (and individuals) that utilize a selectively literal interpretation of jihad to justify violence in the name of Islam. The unit aims to examine the contemporary phenomenon of global jihadism/neojihadism. Students will analyse in detail the various factors that have contributed to the emergence and growth of this religio-politico-paramilitary/terrorist movement:  rules of military engagement, tactics and targeting, the politicizing of religion, intellectual currents, and how various Islamist groups utilize information and communication technologies and social media to advance their causes, generate narratives and recruit. Case studies of particular groups, conflicts in specific regions and countries, and notable terrorist events, including those that have occurred in or affected Australia, offer students opportunities to develop an enhanced understanding of jihadism/neojihadism\u0027s dynamics, and those ideological, religious and other attributes that are common amongst its diverse array of actors. It also compares and contrasts jihadism/neojihadism to other forms of extremism, and evaluates how various states develop counter-narratives to jihadism/neojihadism and encourage disengagement and rehabilitation. The unit also addresses mainstream Muslim communities\u0027 experiences and reactions to states\u0027 confrontations with jihadism/neojihadism and anti-Muslim backlashes, and how Muslims develop counter-narratives to violent extremism.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"APG5094","eftsl":0.25}