{"preqs":"ARC3101 or permission, OHS1000","creditPoints":6,"rules":[{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {ARC3101}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ARC4101}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3019%, 3119%, F2001%}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ARC4101","scaBand":2,"unitName":"Integrated technologies, environments and professional studies","description":"This unit culminates the Technologies and Environments sequence with further integration of professional practices. It explores integrated building systems as they relate to architectural design, construction and project delivery. This includes study of principles of integrated design and the implications of these in relation to architectural design, pan-disciplinary collaboration and construction processes and outcomes. Students will be exposed to the multiple requirements and determinants that shape the stages of the professional project cycle. Through project-based exercises, students engage with the professional ethics and practices required for project development and the performative integration of building systems and design intent. Students will understand buildings as a site of collaboration of pan-disciplinary teams of experts and clients, whose input contributes to realisation within technical, legal and economic constraints. The unit also addresses strategies for environmental sustainability and optimisation in design, construction and delivery.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"ARC3102","eftsl":0.125}