{"preqs":"Admission to the Master of Architecture Course, OHS1000","creditPoints":6,"rules":[{"startDate":"1/10/2010","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3120}","endDate":"31/12/2015"},{"startDate":"1/10/2010","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":"31/12/2015"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3120, F6001}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Integrated project- technologies, environments and professional practices","description":"This unit explores integrated building systems as they relate to architectural design and construction. This includes study of principles of integrated design and the implications of these in relation to architectural design, pan-disciplinary collaboration and construction processes and outcomes. The building will be considered as a site of collaboration of pan-disciplinary teams of experts, whose input contributes to the integrity of the whole. Physical, visual and performative integration of building performance systems will be considered in terms of their relationship to design intent. Integral to the subject matter are the implications of tighter integration in relation to strategies for environmental sustainability and optimisation in architectural design and construction. Through project-based exercises, students also engage with the professional ethics and practices required for project development and the performative integration of building systems and design intent.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"ARC4101","eftsl":0.125}