{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04, 05, 06, 06G, 07, 07G, 40, 42, 50, 50PG, 76, 78}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Online)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Addiction science: A biopsychosocial overview","description":"This unit provides an introduction and overview to addiction as a concept and the factors that contribute to addiction. Consideration is given to the biological, psychological, developmental, sociocultural and environmental factors that may contribute to the development of addiction. It will provide in-depth consideration of theories of addiction and resulting models, and will offer critical discourse around the use of the term. Similarly, measurement issues for addiction and dependence will be reviewed and critically analysed including the policy and media uses of \u0027addiction\u0027 and related terms. The topics addressed will also include aetiological issues and developmental issues around substance use and the onset of problems. The concluding topic will be around the experiential effects of substance use and the model of \u0027drug, set and setting\u0027 with implications for the development of a biopsychosocial model. The assessments are designed to assess the student\u0027s ability to summarise and critically review the evidence and underlying conceptual models of addiction and the extension of the term beyond substance use to include process addictions such as gambling. The unit will also examine the issue of stigma and its relationship to language and professional descriptions of addictive behaviours. Students completing the module should be able to summarise the key theoretical models of addiction, issues around the utilisation of the term and related issues of stigma and have developed the necessary critical conceptualisations of addiction theory to undertake further Masters level study in this area.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"ASC5001","eftsl":0.25}