{"preqs":"ASC5004.","creditPoints":12,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {4519}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 1 (I/W) units in {ASC5004}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Co-occurring disorders in mental health and addiction","description":"This unit provides an overview of the key considerations for clinicians, policy makers, researchers and service providers working with individuals who have a co-occurring disorders (i.e. alcohol or drug disorders that exist alongside mental health or physical health disorders). It will present the latest research findings on effective identification, management and treatment of this complex challenging population. Emphasis will be on disorders that commonly co-exist alongside drug and alcohol disorders, including alcohol and anxiety/depression, tobacco/alcohol and cardiovascular disease, acquired brain injury, intravenous drug use and infectious diseases as well as misuse of licit and illicit substances among individuals with severe mental illness, such as cannabis and schizophrenia. Whilst the unit encourages critical appraisal of the major theoretical concepts, it adopts a more applied approach including an introduction to the principles of case-formulation and the development of treatment plans.Unit topics will include taxonomy and definitions of co-occurring disorders, prevalence and common co-occurring conditions, and will examine the multi-axial needs and unique challenges of working with this population. The module will look at conceptual models in relation to the aetiology of co-occurring disorders, methods of detection, screening and assessment as well as models of treatment and service delivery. The module will also examine the evidence for the effectiveness of population and service responses, as well as the role of motivational interviewing, cognitive behavioural therapy and mutual aid groups, in managing this population, including specifically-tailored psychosocial interventions. Evidence for medical management of this population will be explored, including pharmacological approaches.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"ASC5008","eftsl":0.25}