{"preqs":"Two gateway units in Literary studies, or permission from the unit coordinator.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENH2055}","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENH2055}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL1%, AEH1%, AMU1%, ASA1%, ATS1%, AZA1%} and  Must have passed an (I/W) unit in {ATS1903, ATS1904})","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {ATS1903, ATS1904}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Reading the past","description":"The unit is about how and why we read literature from the past. It addresses the \u0027foreignness\u0027 of Early Modern literature and the challenge of becoming an informed and engaged reader of that literature. The unit will explore both the aesthetic distance between Early Modern writing and the present - what does it mean, for example, to characterize a text as Baroque, or Mannerist, or Gothic, and how appropriate are such terms? - and the thematic concerns of the period itself: its anxious questions about the nature and limits of the human, for example, that were opened up by the breakdown of medieval theological certainty and the rise of science.  Such questions will be posed in terms of the political and ideological context of the time: broadly, the gradual but alarming transformation of a static feudal hierarchy into the fluid social order of capitalism, and the challenges posed by (some) women to the limiting assumptions of institutionalized patriarchy.The unit raises fundamental questions such as: What are we looking for in the texts we read? Can we, or should we, use literature to understand what authors and their contemporary readers thought about an issue: using literary texts as sociological and historical artefacts? Or should we, or do we, read an ever-widening circle of texts as an exercise in pleasure-seeking, or as a way of looking for a universal truth about the human condition, or the nature of truth or beauty?Students will be encouraged to consider these question via a series of self-guided explorations of literature from the past, relating texts they have chosen to a corpus of contemporary literature.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2485","eftsl":0.125}