{"preqs":"Twelve credit points of first-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3319}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {ACL1%, AEH1%, AMU1%, ASA1%, ATS1%, AZA1%}","endDate":""}],"locationAndTime":[{"location":"Prato","time":["Term 4 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS3319","scaBand":1,"unitName":"Cultural diversity in contemporary Europe","description":"The unit, presented over a four week period, involves a research-led case study of cultural diversity in Europe. Based at Monash University\u0027s Prato Centre, students will be introduced to the main overarching theories concerning migration and cultural diversity. Within these overarching theories, students will also encounter numerous concepts and perspectives including among others, cosmopolitanism, assimilation, integration, multiculturalism, insider-outsider relations and the notion of \u0027othering\u0027. Issues relating to race, culture, identity and citizenship will also be considered. The uniqueness of the unit and its relevance to the Prato setting is that students will use these theoretical underpinnings to frame a case study involving observational research to complete 3000 word case study concerning managing cultural diversity in Europe. Students will be encouraged to observe cultural similarities and differences, and particularly the interactions between different cultural groups. The unit aims to provide understandings of managing cultural diversity and a unique experience in undertaking observational research in a European setting. While the topic is a core focus and one of the research strengths in Sociology, it will appeal to students in a range of disciplines including those interested in international relations, law, criminology and Bachelor of Arts students in general.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2619","eftsl":0.125}