{"preqs":"Two gateway units in either Film and screen studies, Communication and media studies, Journalism or approved equivalent.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3295}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ATS1089, ATS1090} or  Must have passed 2 (I/W) units in {ATS1279, ATS1280} or  Must have passed 2 (I/W) units in {ATS1304, ATS1305})","endDate":""}],"locationAndTime":[{"location":"Prato","time":["Term 4 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS3295","scaBand":1,"unitName":"Screening contemporary Europe","description":"Europe is the birthplace of cinema, and from the silent era through to Italian neo-realism, to the new waves of the 1960s and 70s, European cinema changed the way we see and know the world. In this unit we trace the development of European cinema after the fall of the Berlin Wall and into the 21st century, asking three key questions: How have the changing boundaries and social crises in Europe in the post-Berlin Wall era impacted on cinema? What distinguishes European cinema from others in the global era? Can the cinema still be an appropriate media for reflecting cultures, identity and social change? We will study some of Europe\u0027s most influential contemporary films and documentaries. We will examine the tension between the rise of transnational European \u0027blockbuster\u0027 cinema, designed to compete with Hollywood, and traditional European art house filmmaking. We will consider the long-standing relationship between European cinema and the European tradition of film festivals. We will address issues of language, translation and subtitling. And we will also look at political and social implications of important emergent cinemas from this period, including a proliferation of immigrant films that are challenging traditional conceptions of European space and identity. Students will be introduced to films from a range of countries, including France, Belgium, Italy, Germany, Hungary and Spain.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2295","eftsl":0.125}