{"preqs":"Twelve credit points of first-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS2621, ATS3621}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {ACL1%, AEH1%, AMU1%, ASA1%, ATS1%, AZA1%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS2621, ATS3621","scaBand":1,"unitName":"Indonesia now: Culture, conflict and crisis management in the Asian century","description":"This unit outlines how the \u0027Indonesian perspective\u0027 influences the archipelago\u0027s relationship with regional and global entities, especially the Australian government, NGOs and businesses. The unit shows how an understanding of the Indonesian perspective may lead to positive outcomes in times of crises. The unit culminates in a final project, through which students manage a \u0027mock\u0027 Australian-Indonesian crisis, thusly demonstrating the critical value of cultural literacy in the Asian Century.This unit is broken into three phases. The first phase introduces the \u0027Indonesian perspective\u0027, with a focus on the archipelago\u0027s history, religions and cultures. The second phases familiarizes students with how cultural distance impacts Indonesia\u0027s relationship and communication with other regional and global powers. The third and final phase entails a focus on crisis management in the Asian Century. Students firstly encounter case studies of flashpoints and crises in the Australian-Indonesian relationship. Students are then called upon to manage a mock crisis, with the goal of providing a positive outcome through the practical application of cultural literacy.The unit is Indonesian-focused but will be relevant to students more generally concerned with Australia\u0027s role in the Asian Century, and how this role influences diplomacy, business and journalism among other fields.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2161","eftsl":0.125}