{"preqs":"Two gateway units in History, Linguistics, Literary studies or Theatre","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ATS1287, ATS1288} or  Must have passed 2 (I/W) units in {ATS1316, ATS1317, ATS1320, ATS1321} or  Must have passed 2 (I/W) units in {ATS1903, ATS1904} or  Must have passed 2 (I/W) units in {ATS1338, ATS1339})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Beowulf: An interdisciplinary approach","description":"In this unit, the Anglo-Saxon poem Beowulf serves as a textual focus that enables students to participate in the learning practices and activities of a range of academic disciplines. Over three modules, the poem is approached in turn as a historical document, a literary work, and a performance text. To facilitate these approaches, students will engage with a teaching team drawn from different Schools in the Faculty of Arts.The unit approaches Beowulf in these specific ways: The historical module outlines the background of the Anglo-Saxon culture that produced the poem, and also discusses how the poem itself has functioned as a vital source of information on the period. The module concludes with discussion on the Old English language in which the poem is written, its poetic form, and the issues surrounding its translation. The literary module considers the manuscript histories of Beowulf, focusing on the remarkable journey the poem has followed to survive into the modern age. Its place in the canon of English literature, its influence and its impact in a variety of media, are also considered as part of this module. The performance module encourages students to consider Beowulf through its status as a performance piece. To conclude the unit, students will be given the opportunity to craft a performative response to sections of the poem.Through these approaches, students not only engage with the poem from different perspective, but encounter and explore diverse practices in a range of academic disciplines.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2271","eftsl":0.125}