{"preqs":"Twelve credit points of first-year Arts units. It is highly recommended that students only take this unit after they have completed two gateway units in Anthropology or Indigenous cultures and histories.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {ACL1%, AEH1%, AMU1%, ASA1%, ATS1%, AZA1%}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {INT2050, INT3050}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3625, AZA2625, AZA3625}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)"]},{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS3625, AZA2625, AZA3625","scaBand":1,"unitName":"Mobile worlds: Borders, displacement and belonging","description":"Why do politicians and citizens seem so threatened by refugees, asylum seekers and new migrants? Is it because these forms of human mobility challenge the system of nation-states and their sense of social cohesion and security? Or is it because of increasing insecurity and inequality in a rapidly globalising world? Mobile Worlds explores socially and culturally diverse forms of migrant experience, from among those known as gypsies, nomads, vagabonds, slaves, tourists, illegal aliens, refugees, asylum seekers and other displaced peoples, settlers, formal, informal and illegal migrants, guest workers, labour and love migrants, \u0027gold collar\u0027 workers, international students, circular migrants, diasporas, transnational and transilient communities around the globe. The aim is to understand the diversity and implications of human movement, new border regimes and emerging trends that will characterise life in the 21st century.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2625","eftsl":0.125}