{"preqs":"Twelve credit points of first-year Arts units. It is recommended that students have previously completed a unit in Literary studies.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {ACL1%, AEH1%, AMU1%, ASA1%, ATS1%, AZA1%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Literature and visual culture","description":"This unit introduces students to the long history of the interface between literature and image(s), also to the theories and systems built around the nexus of literary and visual technologies. In particular, our contemporary world is saturated with visual information, and endless debates about the status of literature in the face of visual media. However, such debates are not without precedence. The Renaissance already witnessed emphatic debates on the impact of visual cultures on discourse, literature, and knowledge as a whole. Furthermore, the question of Literature and the Image is not the exclusive battleground of European languages. Indeed, Asian cultures have a similarly complex history of interaction between literature and visual forms, albeit shaped by the nature of differing writing systems. This electives incorporates this crucial global comparative element to explore the following three main areas of study. First, it addresses the History and Theory of literature and visual culture. Second, it explores the concrete forms of visual culture, such as photography and literature, film and literature, combined forms emerging from Surrealism, Avant-Garde and Pop literature, as well as comics and graphic novels. Finally, it provides a comparative perspective by addressing Asian forms of language and visuality, literature and visuality, and comics and manga.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2162","eftsl":0.125}