{"preqs":"Twelve credit points of first-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {ACL1%, AEH1%, AMU1%, ASA1%, ATS1%, AZA1%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.6,"learnScore":3.816161616,"learnResponse":26,"proh":"","scaBand":1,"unitName":"Russia and the US: Comparative politics","description":"The subject examines the domestic politics of Russia and United States. Both countries are two of the most powerful and influential countries within the Asia-Pacific region and globally. Developing knowledge of Russian and American politics and societies, students will enhance their understanding of the dynamics of governing ethnically and religiously diverse societies with many competing-and at times sharply antagonistic-interests, and countries with substantial military and economic prowess. The unit closely analyses both countries\u0027 political cultures, electoral politics, political institutions and contemporary social issues (i.e., debates over gender and minority rights), and struggles with extremism and terrorism. Notably, the subject addresses the extent to which Russia\u0027s conception of \u0027Sovereign Democracy\u0027 and the US\u0027 \u0027American Exceptionalism\u0027 influence how Russian and American citizens (and politicians) view themselves and their countries\u0027 status in the world, and if this makes them unique as powerful states, or whether their political behaviour and sense of national identity and destiny are common amongst modern nation-states. Upon completing the subject, students should have also developed a nuanced grasp of the broader field of comparative politics, and its main conceptual approaches and interpretive frameworks-to complement their knowledge of Russian and US politics.","enjoyResponse":26,"faculty":"Faculty of Arts","unitCode":"ATS2088","eftsl":0.125}