{"preqs":"Twelve credit points of first-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3934}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {ACL1%, AEH1%, AMU1%, ASA1%, ATS1%, AZA1%}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS3934","scaBand":1,"unitName":"Global indigeneity: Performance and spectacle from the eighteenth to the twenty-first century","description":"\u0027To see is to know\u0027 was the motto of Columbian world fair in 1893. Across the centuries as embodied encounters with people framed as the \u0027other\u0027 in world fairs, touring savage shows, wild west shows, and ethnographic displays set the terms of popular cross-cultural understanding. These racialized representations proved to millions of Europeans who witnessed them that the \u0027savage\u0027 was inferior and should be controlled.In the 21st century the inclusion of Indigenous performance in major spectacles such as opening ceremonies of Olympic games by people whose land has been colonised such as Australia and Canada are seen as a symbol of cultural respect.In this unit students will examine Indigenous performance in large scale spectacles from the nineteenth, twentieth and twenty-first centuries using approaches from performance studies, history and critical race theories to develop a richer understanding of the dynamics intrinsic to the embodied encounter between strangers from different cultural backgrounds and traditions across the last three centuries. Students will explore a range of topics including the fabrication of difference, the invention of the savage and reflect on what has and has not changed.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2934","eftsl":0.125}