{"preqs":"Two gateway units in either Film and screen studies, Communication and media studies, Journalism or approved equivalent.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3315}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ATS1089, ATS1090} or  Must have passed 2 (I/W) units in {ATS1279, ATS1280} or  Must have passed 2 (I/W) units in {ATS1304, ATS1305})","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS3315","scaBand":1,"unitName":"Journalism and global change in Europe","description":"The unit will explore the significance of people power to journalism through the lens of one of the biggest stories of our time: the migration crisis in Europe. By focusing on the story that has seen hundreds of thousands of migrants cross the continent in search of asylum since 2014, students will explore the theory and practice of less-conventional forms of reporting that are raising issues of advocacy, agency and accountability in journalism. Of particular interest are: peace and development journalism, civic or participatory journalism, and environmental reporting. Students will explore the rationale behind each of these news forms, the values that inform them, and their capacity to humanise and localise the victims of the fissures of geography, ethnicity and wealth. Through case studies in mainstream and alternative European and global news coverage, students will learn to approach news not as a series of discrete violent events but rather as part of complex, ongoing, global processes of social and environmental change. Further, by drawing from scholarly literature in Journalism and Media Studies, field trips and practical research techniques, students will evaluate the significance of people power to journalism while producing in-depth investigations of their own.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS2315","eftsl":0.125}