{"preqs":"One of ATS2676, ATS2681 or ATS2683 if taken as a capstone unitORATS1338 and ATS1339, and 12 credit points in Linguistics, Indonesian or Anthropology at level 2 units","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LIN2070, LIN3070}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {LIN2070}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {ATS2676, ATS2681, ATS2683} OR  (Must have passed 2 (I/W) units in {ATS1338, ATS1339} and  (Must have passed 2 (I/W) units in {ATS2665, ATS2667, ATS2668, ATS2669, ATS2671, ATS2672, ATS2673, ATS2674, ATS2676, ATS2678, ATS2679, ATS2680, ATS2681, ATS2682, ATS2683} OR  Must have passed 2 (I/W) units in {ATS2104, ATS2354, ATS2358, ATS2359, ATS2371, ATS2374, ATS2378, ATS2560, ATS2606, ATS2621, ATS2624, ATS2625, ATS2629, ATS2671, ATS2676, ATS2678, ATS2716, ATS2724, ATS2727, ATS2912} OR  Must have passed 2 (I/W) units in {ATS2113, ATS2114, ATS2606, ATS2607, ATS2621, ATS2671, ATS2941})))","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS2666","scaBand":1,"unitName":"Eastern Austronesian languages of Indonesia, East Timor and Oceania","description":"The unit introduces students to Eastern Austronesian languages and cultures of Indonesia, East Timor and Oceania, covering issues in linguistic structure (comparative linguistics, phonology, morphology, syntax), sociolinguistics, and anthropological linguistics. Students will learn about the linguistic structure of Eastern Austronesian languages as well as the history of the Austronesian language family and the dispersal of the Austronesian people by examining linguistic, archaeological, anthropological, and genetic evidence. The unit will discuss issues such as language contact (including with neighbouring languages groups of Indonesia and New Guinea), special registers, language endangerment and language socialization.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3666","eftsl":0.125}