{"preqs":"Twelve credit points of second-year Arts units. It is highly recommended that students only take this unit after they have completed two gateway units in Politics.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {SCY2100, SCY3100}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS2719, AZA2719, AZA3719}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.166666667,"learnScore":4.083333333,"learnResponse":18,"proh":"ATS2719, AZA2719, AZA3719","scaBand":1,"unitName":"Modern political thought","description":"Modern political theorists grapple with significant political and social transformations such as capitalism, bureaucratisation, rationalisation and globalization. They diagnose various \u0027pathologies\u0027 they fear might result from these transformations: alienation and injustice, disenchantment and authoritarianism, nihilism and social disintegration. They also identify political solutions to these maladies: revolutionary action, charismatic leadership, new forms of democracy and citizenship, or new types of social movements. This unit examines and assesses modern political theorists\u0027 diagnoses of and cures for modern society, focusing on how they conceptualise key political concepts such freedom, power, community and legitimacy. It will do so by examining the political theories of Marx, Durkheim, Weber, Foucault, Habermas and other contemporary critical theorists.","enjoyResponse":18,"faculty":"Faculty of Arts","unitCode":"ATS3719","eftsl":0.125}