{"preqs":"Any one of the following units: ATS3010, ATS3011, ATS3031, ATS3012, ATS3032, ATS3013, ATS3033, ATS3014, ATS3034, ATS3041, ATS1959, ATS1940 or by permission","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {CHI3560}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3048, ATS4042}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {ATS1940, ATS1959, ATS3010, ATS3011, ATS3012, ATS3013, ATS3014, ATS3031, ATS3032, ATS3033, ATS3034, ATS3041}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.083333333,"learnScore":4.14957265,"learnResponse":22,"proh":"ATS3048, ATS4042","scaBand":1,"unitName":"Chinese media analysis 2","description":"This unit is a continuation of Chinese Media Analysis 1. It is designed for students with advanced Chinese reading and writing skills to conduct a project-based study of recent developments in Chinese-language media. It introduces students to a discipline-based study of Chinese media, focusing on media representations of cultural, economic and political issues. The unit will cover Chinese-language media in mainland China and internationally. The weekly work will consist of a one-hour lecture focused on scholarly publications (in English and Chinese) about Chinese Media Studies, followed by a two-hour seminar based on in-depth discussion of the lecture material as it applies to the topics assigned for individual projects. Students will survey and analyse a wide range of news reports, commentaries and other types of publication appearing in major Chinese language media sources, online or offline, guided by the arguments, concepts and methods employed in the field of Chinese media studies. By introducing students to a wide range of scholarly materials about the Chinese media, this unit aims to strengthen their academic writing skills.","enjoyResponse":22,"faculty":"Faculty of Arts","unitCode":"ATS3042","eftsl":0.125}