{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Designing and debating research practice in contemporary Indigenous studies","description":"This is a capstone unit that will give students the opportunity to explore the relationship between theory and practice in primary research in Indigenous studies. Indigenous studies is a site of multidisciplinary learning which aims to foreground the concerns of Indigenous peoples in regards to academic research and ways in which academics can develop and undertake collaborative research projects. Students will be exposed to traditions of research in three main discipline areas: anthropology, archaeology and history, after which they will then choose a specific discipline and undertake a major research project. By selecting a discipline area students will be supervised through a major research project which they will complete throughout the semester. In addition students will be exposed to a number of researchers from across the university who engage in the practice and praxis of working with Indigenous peoples.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3958","eftsl":0.125}