{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS2124}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS2124","scaBand":1,"unitName":"Everyday life in the Soviet Union","description":"The unit will examine how Communism transformed everyday life in the Soviet Union by reshaping social structures and communal ties. How did the Bolshevik ascent to power reshape the private sphere? How did the Communist authorities try to create the New Soviet Man and Woman and forge a new, Soviet national identity? What relevance do these efforts have for understanding today\u0027s post-Cold War Eastern European politics? Through literature, films, memoir, and other primary sources, students will study and analyse the impact of politics on popular culture, work, family life, education, humour, and gender relations. Readings, lectures, and tutorial discussions will explore the degree to which individuals carved out private spaces at home, at work, and in social circles to limit the impact of politics on private life. The unit will begin with a background on Russian politics and culture before the establishment of Communist governments and will end with an examination of the USSR\u0027s collapse and its aftermath. Discussions of primary sources in tutorials will provide students with the skills to analyse similar primary sources in their written work.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3124","eftsl":0.125}