{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Specialist topic in media, film and journalism","description":"This unit comprises study of topics which vary from year to year but will be broadly defined within the disciplines of media, film and journalism. The themes and foci of this unique unit will be developed around current research projects housed in the school of MFJ. It will include media based artists-in-residence and visiting research fellows whose projects will provide students with an opportunity to develop skills in practice-led research. Students will come to appreciate that practice-led research is concerned with the nature of practice and leads to new knowledge that has operational significance for that practice and cultural policy. They will consider and debate the specific research problem at the core of the researcher\u0027s current project, exposing students to the rigorous scholarship and methodologies such as action research. They will consider the relevance of practice-led research for social and cultural theory. The results of their study may be communicated in text form such as a traditional research essay or as a creative outcome. In addition, students will be given the opportunity to reflect on their experience, and to meet with high profile researchers and media practitioners in small groups, where they are able to ask questions and share their experience.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3093","eftsl":0.125}