{"preqs":"Students who have attained a distinction average and who have completed 96 points of study with a minimum of 48 points in Arts","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 96 (I/W) credit points and  Must have passed 8 (I/W) units in {ACL%, AEH%, AMU%, ASA%, ATS%, AZA%})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {0002, 0080, 0202, 1144, 1275, 3537, 3779, 3910, 4098, A2000, A2001, A2003, A2004, A2005, A2007, B2006, B2012, B2019, B2020, B2022, B2024, B2027, C2002, D3002, D3004, D30041, D30042, E3002, L3003, L3006, L3009, S2003, S2005, S2006}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Flexible)","Second semester 2017 (Flexible)","Summer semester A (starts November) 2017 (Flexible)","Summer semester B (starts January) 2017 (Flexible)","Term 3 2017 (Flexible)","Winter semester 2017 (Flexible)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Arts internship","description":"Students are placed as interns with a host partner organisation and complete either a unique research project or work experience-based project jointly defined by the host partner organisation and the unit coordinator. The host partner organisations are from a diverse range of industries and sectors, including government departments, private industry and not-for-profit organisations. Students communicate the research or work experience in a final project in the format specified by the host partner organisation, such as a research report, consultation paper, manual or submission. The host partner organisation provides field supervision and the faculty provides academic supervision.The main component of the unit involves students undertaking a minimum of 144 hours equivalent of placement in order to complete a final project agreed upon between the host partner organisation and the faculty. The host partner organisation will appoint a field supervisor for the project although the Chief Examiner remains the principal assessor for the unit.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3129","eftsl":0.25}