{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"The camera at war: Combat photography and the visual language of conflict","description":"Through lectures, seminars, workshops, and a field trip the unit will study how war photography from across the globe has developed a grammar of its own, referencing the visual arts and the broader history of photography, which has served to powerfully shape perceptions of and responses to war from the mid-nineteenth century to the present day. It will examine how the photographic representation of conflict has been informed and inflected by a range of constraints and influences - cultural, technological, commercial, and political. It will examine specific case studies to demonstrate how particular images have framed, fixed and challenged the public\u0027s understanding of the conduct and purposes of particular conflicts.  The unit will examine the work of both professional and amateur photographers, it will consider the formal regimes of censorship, propaganda, collection and distribution whereby photographs are prepared for or withheld from public release and/or archived in museums and galleries. The unit will equip students with the skills necessary to offer a sophisticated reading of the photograph and encourage them to interrogate how, why, for whom and with what purposes visual images of conflict are framed, formed, encoded and deployed, and how over time, in different geographical and cultural contexts, these images have emerged and developed.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3114","eftsl":0.125}