{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {APG4311, APG5311, ATS4311}","endDate":""}],"locationAndTime":[{"location":"Prato","time":["Summer semester A (starts November) 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS4311, APG4311, APG5311","scaBand":1,"unitName":"Text and community in Medieval and Renaissance Italy","description":"This intensive field work course of one week\u0027s duration is taught out of the Monash Prato Centre in mid-December in the year of offering, and utilises the intellectual capital of the members of the Prato Consortium for Medieval and Renaissance Studies.  The unit is centred on \u0027core skills\u0027 for Medieval and Renaissance Studies: archive, manuscript, palaeographical and interpretive skills. Students undertaking the course are introduced to archives and manuscripts, visual culture and urban landscapes. In particular, when possible this unit will draw on the resources of the Archivio di Stato of Prato, and the \u0027Archivio Datini Online\u0027 making maximal use of the digitized documents available through this portal. Texts will be read from a variety of historiographical perspectives, and considered within the appropriate historical contexts. Participants will generally have the opportunity to engage with some of the foremost scholars in this area of study. Students therefore will be expected to attend, and critique, workshops and lectures organized to coincide with their intensive week\u0027s study. There will be a compulsory seminar for all participating in the unit in advance of departure for Italy. While this unit is designed for fourth level students, qualified third year students may enrol with permission of the unit coordinator.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3311","eftsl":0.25}