{"preqs":"Any one of the following units: ATS3010, ATS3030, ATS3011, ATS3031, ATS3012, ATS3032, ATS3013, ATS3033, ATS3041, ATS3042, ATS2015, ATS2035, ATS2016, ATS2036, ATS3015, ATS3035, ATS3016, ATS3036 or by permission.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {CHI3460, CHI3460%}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For commencement date before `01-JAN-2014` Do true Otherwise Must have passed an (I/W) unit in {ATS2015, ATS2016, ATS2035, ATS2036, ATS3010, ATS3011, ATS3012, ATS3013, ATS3015, ATS3016, ATS3030, ATS3031, ATS3032, ATS3033, ATS3035, ATS3036, ATS3041, ATS3042}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS1014, ATS1034, ATS2014, ATS2034, ATS3034, ATS4014, ATS4034}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.325581395,"learnScore":4.278409091,"learnResponse":85,"proh":"ATS1014, ATS1034, ATS2014, ATS2034, ATS3034, ATS4014, ATS4034","scaBand":1,"unitName":"Chinese Business Translation 2","description":"This unit provides students with further Chinese language training in a business and commerce context.  Having been exposed to texts in a specialised business style, students will further improve their Chinese language proficiency, and will be introduced to an increased range of language features common to Chinese business texts.  Students will continue to practise writing and translating related texts and will be required to display a greater level of sophistication and understanding in both their translation and original writing than in Chinese for Business Communication part 1.  This will further promote students\u0027 bilingual language proficiency and broaden their career opportunities.","enjoyResponse":85,"faculty":"Faculty of Arts","unitCode":"ATS3014","eftsl":0.125}