{"preqs":"Twelve credit points of second-year Arts units. It is highly recommended that students only take this unit after they have completed two gateway units in Anthropology.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS2376}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ANY3350, ANY3350%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.3125,"learnScore":4.245833333,"learnResponse":15,"proh":"ATS2376, COS2350, COS3350","scaBand":1,"unitName":"Anthropology of human rights","description":"The unit introduces students to cross-cultural notions of human rights. Anthropology places human rights in broader analyses of power, politics and social inequality. Tensions exist between anthropological notions of cultural plurality and cultural relativism and the universalism inherent in dominant human rights discourse. Yet critical anthropologists argue that anthropologists are ethically bound to defend human rights. This unit will explore the debates within anthropology over human rights. It will explore the notion of structural violence and anthropological human rights activism with ethnographic examples from a range of settings and marginalised populations.  In doing so, this unit will introduce students to key concepts and debates in the anthropology of human rights and provide fresh, rich understandings of the operation of power.","enjoyResponse":15,"faculty":"Faculty of Arts","unitCode":"ATS3376","eftsl":0.125}