{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {GLO3001}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"(Must have passed 2 units in {ATS1303, ATS1319, ATS1325, ATS1326, AZA1325, AZA1326} AND  (Must have passed 2 units in {ATS2340, ATS2353, ATS2354, ATS2376, ATS2378, ATS2382, ATS2387, ATS2394, ATS2395, ATS2417, ATS2424, ATS2439, ATS2441, ATS2462, ATS2507, ATS2515, ATS2520, ATS2521, ATS2547, ATS2549, ATS2563, ATS2578, ATS2580, ATS2586, ATS2596, ATS2607, ATS2616, ATS2621, ATS2623, ATS2624, ATS2625, ATS2626, ATS2627, ATS2628, ATS2629, ATS2630, ATS2631, ATS2632, ATS2633, ATS2634, ATS2636, ATS2637, ATS2638, ATS2639, ATS2640, ATS2641, ATS2643, ATS2648, ATS2651, ATS2688, ATS2690, ATS2691, ATS2694, ATS2698, ATS2701, ATS2703, ATS2706, ATS2708, ATS2778, ATS2872, ATS2897, ATS2908, ATS2909, ATS2920, ATS2941, ATS3089, ATS3090, ATS3124, ATS3129, ATS3130, ATS3314, ATS3354, ATS3387, ATS3392, ATS3394, ATS3441, ATS3462, ATS3522, ATS3525, ATS3580, ATS3623, ATS3626, ATS3627, ATS3630, ATS3631, ATS3632, ATS3634, ATS3636, ATS3638, ATS3639, ATS3640, ATS3688, ATS3690, ATS3697, ATS3703, ATS3708, ATS3872, ATS3897, ATS3908, ATS3920, ATS3951, ATS3952, ATS3956, AZA2378, AZA2417, AZA2439, AZA2547, AZA2549, AZA2623, AZA2625, AZA2627, AZA2629, AZA2633, AZA2640, AZA2641, AZA2643, AZA2688, AZA2703, MON2003, TAD2030} OR  Permission required))","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3537, 3910, 4403}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]},{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"Malaysia","time":["Second semester 2017 (Day)"]}],"enjoyScore":4,"learnScore":4.180555556,"learnResponse":6,"proh":"","scaBand":1,"unitName":"Global research","description":"This unit develops students\u0027 critical thinking, writing and research skills while allowing them to reflect on both their experience of Study Abroad and the themes met in their International Studies core units. Through peer-to-peer discussion and reflection students will choose a theme from one of their core INT units and devise a research project around an aspect of their Study Abroad experience. The extended project will allow students to investigate a topic in greater depth, interrogate its epistemological assumptions, substantially pursue related theoretical issues, and gain the methodological skills appropriate to the International Studies major and the aims of the BA (Global).","enjoyResponse":12,"faculty":"Faculty of Arts","unitCode":"ATS3793","eftsl":0.125}