{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {MON3005}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MON3005}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"MON3005","scaBand":1,"unitName":"Digital humanities: Expanding research paradigms","description":"The unit is an interdisciplinary unit co-taught with Warwick University under the auspices of the Monash-Warwick Alliance. The unit examines the application of digital technologies in humanities research, covering the methods used to make data accessible, the analytic techniques which are thereby enabled, and the dissemination of research results through new modes of publication.The unit will: Help students to grasp abstract and complex ideas from a range of disciplines (multidisciplinary), and to synthesize these into thoughtful intellectual responses (interdisciplinary), that lead students to insights that may lie beyond the scope of a single discipline (transdisciplinary). Help students understand the potential of applying new analytic tools to problems in various humanities disciplines. Engage students fully with \u0027active\u0027 learning. It will be faithful to the notion that participation and experiential learning foster a deeper understanding of complex material. Enhance and consolidate students\u0027 academic and research abilities, while also stimulating team-work and collaboration, thus creating a pool of transferable skills that students can acquire and practice. Make productive links between theoretical ideas and practical applications.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3305","eftsl":0.125}