{"preqs":"Twelve credit points of second-year Arts units. As this is a third-year level unit, it is highly recommended that students only take this unit after they have completed two second-year level units in Philosophy.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {PHL3880, PHL3880%}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {PHL3880, PHL3880%}","endDate":"31/12/2016"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":"31/12/2016"}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Foundations of modern philosophy: Love and other passions","description":"The unit will examine issues to do with virtue and the passions in the history of ethical thought. In the pre-modern era, the emotions or \u0027passions\u0027, such as love, desire, fear, and sadness, were seen as mental states that arose involuntarily in the soul as a result of its close connection with the body. They were commonly regarded as corrupting influences on an agent\u0027s moral choices and actions. To overcome their influence, philosophers recommended various techniques for either suppressing the passions or turning them into virtues or excellences of character. Following the Augustinian tradition, many regarded love as the key to transforming the passions. This unit explores the moral and metaphysical dimensions of this subject, with reference to both male and female philosophers of the past. Some of the thinkers who may be discussed include St Augustine, Rene Descartes, Elisabeth of Bohemia, Mary Astell, and David Hume. Some of the themes in the unit may be followed into contemporary philosophical discussions.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3884","eftsl":0.125}