{"preqs":"Twelve credit points of second-year Literary studies units, including one from either ATS2410 or ATS2485, or permission from the unit coordinator","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {CLS3530, CLS3530%}","endDate":"31/12/2016"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 1 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} and  Must have passed 1 (I/W) units in {ATS2422, ATS2485, ATS2508, ATS2517})","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {ATS2410, ATS2485} and  Must have passed an (I/W) unit in {ATS2163, ATS2164, ATS2379, ATS2409, ATS2422, ATS2427, ATS2442, ATS2443, ATS2444, ATS2492, ATS2500, ATS2508, ATS2513, ATS2516, ATS2517, ATS2519, ATS2732, ATS2898, ATS2914, ATS2915})","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {CLS3530, CLS3530%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Literature and modernism","description":"Does language create our world, or does it merely describe it? If it is the former, then what are the stakes for literature? Working with a range of novelists, poets, and theorists, this course will explore literature that engages with these questions of representation in the most innovative and exciting ways. Modernism has long been a term used to describe a radical international and experimental movement in the arts dating roughly form 1890 to 1940. More recently, however, modernism has undergone a reassessment and is now increasingly seen as an ongoing aesthetic response to various social, moral, technological, and political transformations. This unit will examine some of the major figures of avant-garde and \u0027High\u0027 modernism but it will also be attentive to examples of regional, \u0027middlebrow\u0027 and popular modernist literature\u0027s, as well as to modernism\u0027s afterlife in postmodern and contemporary literature. We will reflect on some of the most influential concepts in the early part of the twentieth century in relation to cultural and material upheavals, including urbanization, scientific and technological advances, conflicts about sexuality, and the women\u0027s movement. Our focus will be on the literary works from both within and outside of the English-speaking world that stand at the heart of definitions and debates about modernism. Foreign-language texts will be studied in English translation.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3421","eftsl":0.125}