{"preqs":"Twelve credit points of second-year Arts units. It is highly recommended that students only take this unit after they have completed two gateway units in Anthropology, Indigenous cultures and histories, International studies or Spanish and Latin American studies.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {INT2150}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {INT3150}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS2634","scaBand":1,"unitName":"Indigenous peoples globally","description":"This unit introduces students to basic issues connected with indigeneity such as the first peoples concept; historical engagements with colonial or settler populations; the importance of distinctiveness to indigenous identities; and the importance and vulnerability of heritage in indigenous groups.This unit extends these understandings by exploring the emergence of indigeneity as a global political movement. It examines the emergence of a global political discourse of indigeneity, as well as the implications of this emergence for domestic political regimes. By referring to African, Australian and American examples, it explores how indigenous groups have secured better outcomes by advocating for their causes in global institutions and networks in which an indigenous rights framework has taken shape. It explores the media forms and celebrity advocacy (such as the project of the rock star Sting in the Amazon) that made indigeneity a global concept; the problems occurring when indigeneity is valued as a political resource by groups; and the stress accompanying indigenous discourses which appear to replicate primordial movements. The unit contains a three-week module on indigenous languages in Australia.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3634","eftsl":0.125}