{"preqs":"Twelve credit points of second-year Arts units. As this is a third-year level unit, it is highly recommended that students only take this unit after they have completed two second-year level units in Journalism or Journalism practice.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.136363636,"learnScore":4.26043771,"learnResponse":32,"proh":"","scaBand":1,"unitName":"Digital production","description":"The unit explores production and design practices in digital journalism, including content management systems used in newsrooms, management and design through the latest software programs. The unit examines the effective use of interactive features for multimedia news production, including polls, maps, soundslides and infographics. Students will learn how to produce visually appealing data through a range of software programs, including Adobe products. They will create web pages that feature rich multimedia content. The successful web pages will be showcased on Monash\u0027s journalism website, Mojo, or published on other news websites. Students will develop a special project through individual consultation with the lecturer to produce a high standard of multimedia journalism. They will apply production skills to breaking news scenarios, including natural disasters, police news, political developments or sporting events. Please be aware that access to certain technology/equipment will be required for this unit. Contact the unit coordinator for details.","enjoyResponse":32,"faculty":"Faculty of Arts","unitCode":"ATS3062","eftsl":0.125}