{"preqs":"Twelve credit points of second-year Arts units.","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {AUS3002}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS2387}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS2387, ATS2388, ATS3388, ATS2389, ATS3389, ATS2390, ATS3390","scaBand":1,"unitName":"Beyond Gallipoli: Australians in the Great War","description":"This Unit begins with a study tour of Istanbul and the Gallipoli Peninsula, walking the gullies and the ridges and reconstructing the Anzac campaign of 1915. We then move to Prato (near Florence) for a week of seminars/workshops and excursions to commemorative sites in Florence and Bologna. After Prato, we will fly to Brussels for the Western Front component, exploring the major Australian battles and museums in Flanders and on the Somme. The program concludes in Paris. A series of onsite lectures and workshops will introduce students to the nature and experience of war on the Gallipoli peninsula and the Western Front. Topics will include the making of the Anzac Legend, war and the experience of overseas travel, the Homeric tradition and the changing nature of battle, pilgrimage, cultural tourism, the making of commemorative landscapes, the demise of the Ottoman Empire and the making of a new Europe. While based on the Gallipoli Peninsula, students will research a battle in depth and present their findings on the battlefield or related site of memory.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"ATS3387","eftsl":0.25}