{"preqs":"Twelve credit points of second-year Arts units. It is highly recommended that students only take this unit after they have completed two cornerstone units in Politics or International relations.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2208, ATS2296, ATS2297, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {ACL2%, AEH2%, AMU2%, ASA2%, ATS2%, AZA2%} or  Must have passed an (I/W) unit in {ACL2005, ACL299%, AEH299%, AMU299%, ASA2331, ASA299%, ATS2344, ATS2386, ATS2387, ATS2394, ATS2612, ATS2713, ATS2957, ATS299%, AZA2423, AZA299%, MON2003})","endDate":"31/12/2016"}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.625,"learnScore":4.601251483,"learnResponse":63,"proh":"","scaBand":1,"unitName":"European integration and security","description":"War and security have been crucial motors of international relations, not least in Europe, the birthplace of the Westphalian state system.  The European Union is commonly seen to have been an antidote to war, ushering in an era of Kantian peace; a view powerfully endorsed by the awarding of the Nobel Prize to the EU in 2012.  Despite the strength of this view, recent research suggests it is possible to look at the relationship between peace and European unity differently.  In fact, European unity has been propelled by war since 1945: not just at the founding moment at the end of the Second World War (NATO, EEC, WEU), but by anti-colonial nationalists pushing European powers towards pro-active European policies, and in EU responses to the conflicts in the former Yugoslavia (OSCE, CFSP), Iraq, Libya and challenges posed by refugee movements and global terrorism. An unintended consequence of the logic of deeper integration has been the consolidation of a European identity amongst some elites, whilst political and popular support for the EU has weakened.  This last development poses serious questions about the future shape the state system in what remains a major player in regimes of global governance.","enjoyResponse":63,"faculty":"Faculty of Arts","unitCode":"ATS3974","eftsl":0.125}