{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any 4 (I/W) co-req units in {AZA4420, AZA4430, AZA4440, AZA4445}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {09, 09-1, 09-4}","endDate":""}],"locationAndTime":[{"location":"South Africa","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Psychological testing and assessment","description":"The unit aims to expand students\u0027 conceptual understanding of the principles and methods of psychological assessment. This includes the notions of reliability and validity and contemporary methods used to evaluate psychometric properties of instruments. Instruments for assessing abilities and personality in various contexts, e.g., clinical, counselling, neuropsychological, educational and organizational will be reviewed and core practical skills in implementing these instruments and interpreting results will be acquired.Psychological testing and assessment in a multicultural and multilingual societal context will be a core theme which will be addressed with reference to the global and the South African context. Themes of cultural sensitivity, fairness and bias will form an integral part of the academic discourse. Competencies in interpreting and reporting psychological assessment results and report writing skills will be developed through practical assignments and case studies. An integrated approach to assessment, incorporating psychometric and qualitative measures and techniques will fall into the focus of the seminars and lectures.Ethical principles, procedures and considerations in the implementation of psychological assessment and use of results will be analysed and debated against the backdrop of the historical heritage and contemporary advancements in the ethical regulations of the psychology profession in South Africa and other developing and developed countries.","enjoyResponse":0,"faculty":"Faculty of Arts","unitCode":"AZA4480","eftsl":0.125}