{"preqs":"Students must have completed 72 credit points.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {09, 09-4, 10, 41, 50}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 72 (I/W) credit points","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {BEX3150}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Summer semester A (starts November) 2017 (On-campus block of classes)","Winter semester 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Sustainability practice and organisations","description":"Organisations across all sectors (corporate, public sector, not-for-profit) are increasingly needing to consider the environmental, social and ethical impacts of their business. Opportunities to positively impact an organisation\u0027s sustainability journey reside at every level of an organisation, and often require multi-disciplinary, collaborative approaches to problem solve and innovate.This unit provides students with the opportunity to demonstrate a broad knowledge of global sustainable development challenges and understand the role organisations play in contributing to solutions. Students will demonstrate an understanding of organisational drivers and collaboratively apply technical and practical skills and approaches to drive organisational change towards sustainability. Students will develop and demonstrate their career-readiness through the application to real world challenges knowledge and skills such as; auditing environmental and social impact, stakeholder engagement, negotiation and ethical decision-making, behaviour change, communicating the business case, cross cultural awareness and teamwork.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"BEX3150","eftsl":0.125}