{"preqs":"Students must have completed at least 96 Monash credit points (60 ECTS) of study prior to enrolling in this unit.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 96 (I/W) credit points","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {0023, 0170, 0179, 0312, 0314, 0315, 0542, 0550, 0553, 0556, 1185, 1319, 1333, 1334, 1337, 1469, 2015, 3154, 3806, 3819, 3830, 4097, 4098, 4407, 4417, 4419, 4425, 4426, 4428, 4430, 4635, 4641, 4645, B2000, B2001, B20031, B20032, B20033, B20041, B20042, B20043, B2006, B2008, B20091, B20092, B20093, B20121, B20122, B20123, B20131, B20132, B20133, B20141, B20142, B20143, B20151, B20152, B20153, B2016, B20162, B20163, B2017, B20181, B20182, B20183, B2019, B2020, B2021, B2022, B2023, B20241, B20242, B20243, B2025, D3003, D30031, D30032, D30071, D30072, E3003, E3005, F20041, F20042, F20071, L3005}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {BEX3722}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Engaging with international business","description":"This unit requires students to examine a broad range of social, cultural, legal and political issues that can impact on the strategy and operations of businesses operating in a global business environment. Through the use of readings, case studies, and an analysis of current events students are confronted with some specific challenges of doing business in a global context. This unit focuses on developing skills, addressing various global issues and how they affect business, as well as aspects of global citizenship, cultural sensitivity and effective teamwork.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"BEX3722","eftsl":0.125}