{"preqs":"Students to complete two units as follows: ECF1100 and ETF1100 or ECC1000 and ETC1000  or ETB1100 and ECB1101  or ECW1101 and ETW1000 or ETW1102 or ECP1100 and ETP1100","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {AFF2631, BFB2140, BFC2140, BFF2140, BFF2631, BFG2631, BFP2140, BFP2631, BFW2631}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 1 (I/W) units in {ECB1101, ECC1000, ECF1100, ECP1100, ECW1101} and  Must have passed 1 (I/W) units in {ETB1100, ETC1000, ETF1100, ETP1100, ETW1000, ETW1102} with grades other than {STANDARD-DEF, STANDARD-NS})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {AAF1140, AAF2140, AAF214E, AF114, AF214, AF2143, AF2144, AF214E, AF214SP, AF214U, AFC1140, AFC2140, BFC2140}","endDate":""}],"locationAndTime":[{"location":"Malaysia","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]}],"enjoyScore":3.948717949,"learnScore":3.578285655,"learnResponse":147,"proh":"AFF2631, BFF2631, BFG2631, BFP2631, BFW2631, AFF2140, BFB2140, BFC2140, BFF2140, BFP2140.","scaBand":3,"unitName":"Corporate finance 1","description":"The aim of the unit is to introduce students to the theory and application of why and how value enhancing corporate financial decisions are made and implemented. With the emphasis on publicly listed companies, topics covered include; the corporate objective of management; investment evaluation models; valuation of equity and debt instruments; sources and types of funding; issues in risk and return; portfolio theory; asset pricing models; issues in capital structure and dividend policy; and the efficiency of capital markets. The unit is designed to ensure students gain the necessary skill set for making value-changing financial decisions to maximise firm value.","enjoyResponse":85,"faculty":"Faculty of Business and Economics","unitCode":"BFW2140","eftsl":0.125}