{"preqs":"BIO1011 and either BIO1022 or BIO1042; or BMS1011 and BMS1021","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {BIO2022%, BOT2011, ZOO2011}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {BMS1011, BMS1021} or  (Must have passed an (I/W) unit in {BIO1011} and  Must have passed an (I/W) unit in {BIO1022, BIO1042}))","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {BIO2022%, BOT2011, ZOO2011}","endDate":"31/12/2016"},{"startDate":"1/11/2000","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {BIO1011} and Must have passed an (I/W) unit in {BIO1022, BIO1042})","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {BIO1011} and  Must have passed an (I/W) unit in {BIO1022, BIO1042})","endDate":"31/12/2016"},{"startDate":"1/11/2000","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {BIO2022%, BOT2011, ZOO2011}","endDate":"31/12/2014"}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.0625,"learnScore":4.135982052,"learnResponse":103,"proh":"","scaBand":2,"unitName":"Evolutionary ecology","description":"This unit introduces students to the patterns and processes of evolution by natural selection. It investigates what species are, how to recognise them, how they are described and classified, and the range of circumstances and mechanisms under which they form in nature. Armed with this background, we investigate the evolution of the key biological phenomena of relevance to ecology, notably life-history evolution. The unit goes on to explore the genetic basis of evolution by natural selection and adaptation of organisms to their environments. This entails an appreciation of the control and inheritance of traits that have major influences in the lives of organisms, and fundamental evolutionary principles and approaches (Hardy-Weinberg equilibrium, fitness, adaptive genetic variation, heritability of complex traits and their response to natural selection). Students will understand how different kinds of genetic variation are (and are not) associated with fitness of individual organisms and viability of populations. We then explore approaches to investigating population biology of organisms (such as estimating dispersal and gene flow in real landscapes) in a coherent progression encompassing small and large ecological scales. These concepts are illustrated by exploration of exciting examples encompassing pure and applied science, including urban ecology, invasion and conservation biology, global change ecology, with associated practical work. We examine fitness in natural populations and the special issues of small populations, particularly inbreeding depression, loss of genetic variation, limits to adaptation to new environmental pressures, and the relationship between genetic variation and extinction risk of populations and species. We investigate how genetic variation in organisms is associated with ecosystem function, ecological community structure and protection against environmental change. The unit ends with an assessment of how evolutionary principles can be applied to try and assist biota to adapt sufficiently rapidly to survive rapidly changing environments with multiple stressors.","enjoyResponse":65,"faculty":"Faculty of Science","unitCode":"BIO2022","eftsl":0.125}