{"preqs":"BMA1011.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {BMA1902, BMA1912}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {BMA1011}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {M2002, M20021, M20022, M20023, M20024}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.825581395,"learnScore":4.514814815,"learnResponse":14,"proh":"BMA1902, BMA1912","scaBand":2,"unitName":"Foundations of anatomy and physiology for health practice 2","description":"This unit is the second of the two units designed to familiarise health science students with the anatomical structures and physiological functions of the systems of the human body that underpin the regulatory mechanisms for homeostatic control. Students will be introduced to the structure and function of the cardiovascular, circulatory and respiratory systems together with their vital role in maintaining homeostasis. The key features of the lymphatic system and the properties of blood will be discussed. The unit will continue with a look at the importance of the endocrine system and its role in integrating various functions to control homeostasis. Students will be introduced to the key anatomical and physiological features of the urinary and digestive systems and the importance of maintaining pH and fluid balance within the body. Finally, students will be introduced to the reproductive systems, pregnancy and development. Throughout the unit, clinical connections will be made with the systems addressed so that students will understand the relevance of the topics included in the unit to the health and human science disciplines.","enjoyResponse":116,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"BMA1012","eftsl":0.125}