{"preqs":"A student must have passed a minimum of 96 credit points of units deemed satisfactory and relevant in content and depth by the Nutrition and Dietetic Department Selection Officer in conjunction with the Unit Coordinator.","creditPoints":12,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {BND3101}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3404, 4530}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 96 (I/W) credit points from units owned by {50053649}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Introduction to dietetic practice","description":"This unit uses chronic disease as the foundation and basis for dietetic students to develop their core dietetic practice assessment skills whilst learning and applying core knowledge of chronic disease related to nutrition and dietetic practice. There is an emphasis and focus on person centred care and simulation provides a key platform for learning in this unit. A formative and summative Objective Structured Clinical Examination (OSCE) sits within this unit to assess students readiness for placement. Students are introduced to the healthcare system and a range of health care settings via a one day/week placement for part of the semester. Food service competencies (Operating Systems and Menu standards) are introduced and integrated practical experiences in the healthcare environment supports learning across this domain.The key themes explored in this unit are Theme 1: Personal Development and Professional Practice, Theme 3: Fundamentals of Health and Disease, Theme 4: Food from Science to Systems coupled with partial integration of content and application from Theme 2: Determinants and Influences on Population Health and Nutrition.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"BND3102","eftsl":0.25}