{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {BTX3110}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {09-4, 10, 41, 50}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {BTC2190, BTF3201, BTG3201, BTW3201}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)"]},{"location":"City (Melbourne)","time":["Trimester A 2017 (Day)","Trimester B 2017 (Day)","Trimester C 2017 (Day)"]}],"enjoyScore":4.452777778,"learnScore":4.341269841,"learnResponse":11,"proh":"BTF3201, BTG3201, BTW3201, BTC2190","scaBand":3,"unitName":"International trade law","description":"International trade and commerce is increasingly central to business operations in Australia and around the world. This unit provides a comprehensive introduction to the legal framework governing international trade and commerce, with a particular focus on trade in goods. The unit begins by introducing the key principles of law that govern trade relations between nation states and addresses broader policy questions such as how these international laws have impacted the ability of nation states, such as Australia, to regulate trade for the purposes of protecting animal welfare and the environment and food and product safety.The unit also introduces the fundamental contracts, documents and processes involved in international sales transactions. These include the international contract of sale, contracts of air and sea carriage, marine insurance and international payments. The unit focuses on the framework of laws, principles and other instruments within which business professionals operate when concluding and performing these contracts. The principal rights and obligations of the parties and the available remedies are analysed for the purpose of ensuring that traders are aware of and able to avoid the legal risks inherent in international commerce.","enjoyResponse":48,"faculty":"Faculty of Business and Economics","unitCode":"BTX3110","eftsl":0.125}