{"preqs":"CDS1001, CDS1002, OHS1000 or IDN1001, IDN1002, OHS1000","creditPoints":12,"rules":[{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {CDS1001, CDS1002} or  Must have passed an (I/W) unit in {IDN1001, IDN1002})","endDate":""},{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3123%, F2002%}","endDate":""},{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]},{"location":"Prato","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.243243243,"learnScore":4.263888889,"learnResponse":13,"proh":"VCO2003, VCO2004, VCO2409, MMD2303, MMD2304, MMD2306","scaBand":1,"unitName":"Communication Design Studio 2B","description":"Communication Design Studio 2B will expose students to a broad range of creative communication processes from print to digital media, and will be able to identify the appropriate context(s) to which they would be applied independently and in conjunction with each other.Students will explore a range of media elements including typography, image, layout, three-dimensional form, interaction design, spatial environments and visualisation as core components to their communication design solutions. Projects across both print and digital media platforms will develop skills in information design, way-finding, interactivity, user experience (experiential design), typography, image construction and manipulation, production methods, collaborative activity, and the planning and management of design outcomes.Students will be encouraged to approach all projects with an open attitude to experimentation and critical enquiry. Studies in this unit will help students develop an understanding of the vital space communication designers occupy in developing and contributing to the language of contemporary visual culture, alongside the social responsibilities inherently associated with this.","enjoyResponse":63,"faculty":"Faculty of Art, Design and Architecture","unitCode":"CDS2002","eftsl":0.25}