{"preqs":"Completion of 48 credit points in any degree offered by the Faculty of Art Design \u0026 Architecture or with permission from Unit Coordinator, OHS1000","creditPoints":6,"rules":[{"startDate":"1/06/2013","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 48 (I/W) credit points from units owned by {50000562, 50000766, 50000767} OR  Must have passed 48 (I/W) credit points from units owned by {50000562} OR  Must have passed 48 (I/W) credit points from units owned by {50000766} OR  Must have passed 48 (I/W) credit points from units owned by {50000767})","endDate":""},{"startDate":"1/06/2013","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Creative coding","description":"Code is the building block of all digital software and content. Once the domain of computer programmers, code is now being used by artists, designers and architects to translate their ideas into new forms of creative expression and communication.This unit will enable students to apply the basic concepts and principles of coding, from concept to implementation, to create these unique forms of expression.Through a process of practical studio exercises and workshops students will explore how code and software development can enable innovative ways of translating concepts into unique visual and auditory form.  Students will be exposed to key terminology and processes of coding and encouraged to explore these processes to create dynamic and unique interactive digital content. An in-depth study of both the historical and contemporary leaders in art, design and architecture who use these processes to generate important cultural artefacts will contextualise the significance of creative coding in these fields.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"CDS2521","eftsl":0.125}