{"preqs":"CDS2001 and successful completion of at least 84 credit points in the Bachelor of Communication Design, OHS1000","creditPoints":12,"rules":[{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {CDS2001} and  Must have passed 84 (I/W) credit points)","endDate":""},{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3123%, E3006%, F20021, F2004%, F2005%}","endDate":""},{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.826086957,"learnScore":4.166666667,"learnResponse":7,"proh":"VCO3005, MMD3305, MMD3307, VCO3006, MMD3306, MMD3308","scaBand":1,"unitName":"Communication Design Studio 3B","description":"Communication Design Studio 3B will advance to a high level the practical, technical and conceptual skills developed in preceding studios. Having been exposed to a broad range of creative communication processes in the prerequisite units, students will be required to identify an area of specialisation in which to participate in CDS3002. Students may choose to continue the same area as that selected in CDS3001 to hone their specialist skills, or opt for a different area in order to broaden their expertise. Specialisation areas will be identified upon enrolment into the unit and may include (but will not be limited to) publication design, typography, image, brand, animation, sound and motion, interactivity and others areas that develop as the communication design field continues to broaden.Within their area of specialisation students will explore the breadth of communication possibilities through a carefully composed program of studio-based projects relevant to their chosen area. These projects, though different in each specialisation, will be comparable in assessment tasks and learning outcomes. Within each studio, students will develop their skills in both the technology and conceptual thinking required of their specialisation to high level of competency.Students will be encouraged to approach this unit with the utmost care in their selection of specialisation. General exposure to the areas of specialisation will have occurred throughout the preceding units, but counselling from the unit chief examiner and course coordinator will be made available to assist students\u0027 selection of their particular area of study.The projects undertaken in CDS3002 will contribute towards a body of work intended to demonstrate the student\u0027s refined level of competence within the communication design field, and assist them to either progress into further study or gain appropriate employment in the communication design arena.","enjoyResponse":47,"faculty":"Faculty of Art, Design and Architecture","unitCode":"CDS3002","eftsl":0.25}