{"preqs":"","creditPoints":6,"rules":[{"startDate":"21/08/2013","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE IN {0085, 0124, 0125, 1014, 1205, 1209, 3255, 3879, 4527, 4618, 4638} Do true Otherwise Any co-req unit set {CIVILENG01, CIVILENG02, ENG-CIVIL, ENG-ENV, ENG-MINING, ENVIRENG01, INFRA-TECH, MININGEN01}","endDate":"31/12/2016"},{"startDate":"21/08/2013","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {CIV2204, CIV2208}","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE IN {0085, 0124, 0125, 1014, 1205, 1209, 3255, 3879, 4527, 4618, 4638} Do true Otherwise Any co-req unit set {CIVILENG01, CIVILENG02, ENG-CIVIL, ENG-ENV, ENG-MINING, ENVIRENG01, INFRA-TECH, MININGEN01}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"Malaysia","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Mechanics of solids","description":"Solid mechanics is concerned with the stressing, deformation and failure of solid materials. This unit conveys some of this fundamental knowledge related to the analysis and design of engineering structures. It builds on aspects taught in the level 1 unit ENG1001. Topics covered include; bending moment diagrams of determinate and indeterminate beam/frame systems, the calculation of normal stresses due to combined bi-axial bending and axial forces (including those resulting from thermal loading); partial and fully plastic section moment capacities; torsion, shear stress and shear flow in beams; and the calculation of deflections in simple determinate beams. The theory of elasticity is then introduced covering; stress and strain at a point, the transformation of stresses and strains and the calculation of principal stresses and strains; the constitutive relationship between elastic stress-strain behaviour; Mohr\u0027s circle; and failure criterion with specific reference to pressure vessels.","enjoyResponse":0,"faculty":"Faculty of Engineering","unitCode":"CIV2206","eftsl":0.125}