{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2006","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE IN {0085, 0124, 0125, 1014, 1205, 1209, 2758, 3255, 3879, 4527, 4638} Do true Otherwise Any co-req unit set {CIVILENG01, CIVILENG02, ENG-CIVIL, ENG-ENV, ENVIRENG01}","endDate":""},{"startDate":"1/01/2006","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {CIV2281}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]},{"location":"Malaysia","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.838932806,"learnScore":3.995307468,"learnResponse":65,"proh":"","scaBand":2,"unitName":"Transport and traffic engineering","description":"This unit introduces students to the field of transport and traffic engineering. The fundamental parameters used to describe deterministic traffic flow behaviour are introduced along with a simple traffic flow model. Stochastic traffic flow behaviour is described via random distributions. Fundamental queuing theory of traffic is briefly introduced. The procedures used to analyse the capacity and level of service are explored for both unsignalised and signalised intersections. The principle of traffic signal operation at isolated intersections is presented. Traffic surveys are discussed and students are introduced to contemporary road safety issues as well. Public transport is considered at the route level concerning the determination of fleet size and factors affecting operational capacity and reliability. Non-motorized transport including cyclists and pedestrians is also considered. In addition, the unit addresses Intelligent Transportation Systems (ITS). Consideration will also be given to the role of communications in the practice of transport and traffic engineers. To enhance students\u0027 understanding of the unit content from practical points of view, some experts will be invited to give lectures on their relevant work. Throughout the whole unit, the focus is primarily on surface transport systems and applications of advanced technologies therein.","enjoyResponse":112,"faculty":"Faculty of Engineering","unitCode":"CIV2282","eftsl":0.125}