{"preqs":"One of EAE1011, EAE1022, ESC1011, ESC1022 or ENG1002","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {ESC2111}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EAE2522}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have enrolled in an (I/W) unit in {EAE1011, EAE1022, ENG1002, ESC1011, ESC1022}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ESC2111","scaBand":2,"unitName":"Sediments and basins","description":"Geologists study our Earth by digging through millions (and even billions) of years into the \u0027deep time\u0027 past.  Older interpretations have been integrated with bold, new insights into a grand scenario of a dynamic planet \u0027on the move\u0027.   Continents break apart and reassemble; ocean floors open up and deepen into grand basins; volcanoes blow their tops; and even huge mountains systems rise up from originally quiet seas, a seemingly perpetual pageant of dynamic geologic processes. By studying and surveying global basins and their diverse infill of sediments and associated fossils, we can piece together the grand geologic puzzle through the ages.  Fossil remains assist greatly in reconstructing ancient global continental connections, environments and climate, punctuated by global catastrophes to arrive at a picture of the evolution of life through time.  This \u0027big picture science\u0027 is accomplished by diverse disciplines, including tectonics, sedimentology, stratigraphy, paleontology, geophysics, and field work, the latter of which is a significant skills set for the geologist.   Ultimately, we endeavour to reconstruct our great earth jigsaw through the ages and in the modern age use the rock record of basins for global energy needs (i.e., water, oil, gas, and coal). In doing so, we enrich humanity by peering into unfamiliar and previously unknown ancient environments around the globe and by supplying important resources.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"EAE2522","eftsl":0.125}