{"preqs":"ENG1091 or ENG1005","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE IN {0085, 0124, 0125, 1015, 1376, 1377, 2241, 2350, 3251, 3255, 3273, 3879, 4527, 4638, 4651} Do true Otherwise Any co-req unit set {ECSYSENG01, ECSYSENG02, ENG-ECS}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Must have passed 1 units in {ENG1005, ENG1091}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP","ruleString":"Incompatible with achievement in {ENG2092}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]},{"location":"Malaysia","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ENG2092","scaBand":2,"unitName":"Probability models in engineering","description":"This unit will introduce fundamental concepts of probability theory applied to engineering problems in a manner that combines intuition and mathematical precision. The treatment of probability includes elementary set operations, sample spaces and probability laws, conditional probability, independence, and notions of combinatorics. A discussion of discrete and continuous random variables, common distributions, functions, and expectations forms an important part of this unit. Transform methods, limit theorems, convergences, and bounding techniques are also covered. Special consideration is given to the law of large numbers and the central limit theorem. Markov chain, transition probabilities and steady state distribution will be discussed.Application examples from engineering, science, and statistics will be provided: The Gaussian distribution in source and channel coding, the exponential, Chi-square, and Gamma distributions in wireless communications and Bayesian statistics, the Rayleigh distribution in wireless communications, the Cauchy distribution in detection theory, the Poisson and Erlang distributions in traffic engineering, queuing theory and networking, the Gaussian, Laplacian and generalized Gaussian distributions in image processing, the Weibull distribution in high voltage engineering and electrical insulation, Markov chain in queuing theory, and first-order Markov process in predictive speech/image compression.","enjoyResponse":0,"faculty":"Faculty of Engineering","unitCode":"ECE2191","eftsl":0.125}