{"preqs":"Successful completion of at least 12 credit points of education units","creditPoints":6,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 12 (I/W) credit points from units owned by {50000564}","endDate":"31/12/2014"},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {EDF2056}","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 12 (I/W) credit points from units owned by {50000564}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.862068966,"learnScore":3.954415954,"learnResponse":59,"proh":"","scaBand":1,"unitName":"Becoming a specialist teacher","description":"This unit examines the concept and process of becoming a specialist teacher. It focuses on the identity, knowledge, practices and professional learning of a teacher with expertise grounded in a particular disciplinary tradition. Using different frameworks to explore the nature of disciplinary knowledge, the unit enables students to think critically and creatively about the relationship between their developing disciplinary knowledge and their emerging work as specialist teachers. Students examine how the curriculum organises and represents knowledge in ways that are both specialised and interdisciplinary. They explore how teachers help students develop knowledge, capabilities and skills both within and beyond subject specialism boundaries in ways that meet the needs of a diverse range of students in an ever-changing world. Students develop broad knowledge and understanding of legislative requirements and teaching strategies that support participation and learning of students with disabilities. The unit provides a range of conceptual and practical ideas and resources from which students can build further understandings and capacities in their ongoing professional learning as specialist teachers.","enjoyResponse":59,"faculty":"Faculty of Education","unitCode":"EDF2008","eftsl":0.125}