{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF2321}","endDate":""},{"startDate":"1/01/2013","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF2321}","endDate":"31/12/2015"},{"startDate":"1/01/2013","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF3210}","endDate":"31/12/2015"}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]},{"location":"Peninsula","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.787037037,"learnScore":3.672971781,"learnResponse":24,"proh":"","scaBand":1,"unitName":"Inclusive education: Teaching diverse learners","description":"This unit develops students\u0027 understanding of how they can respond to increasing diversity in classrooms based on a range of characteristics and factors including students\u0027 physical, social and intellectual characteristics, as well as linguistic, cultural, language, religious and socio-economic factors, students with English as an additional language and differentiate their teaching to meet the needs of student with a range of ability needs including gifted, talented and special needs. Students learn why and how inclusive classroom communities can be created. Students are supported to develop an inclusive disposition to student differences. They develop  knowledge and understanding of repertoire of inclusive strategies for differentiating teaching in order to meet the specific learning needs of students across the full range of abilities and to ensure they can maximise  the learning outcomes and full participation of all students. They also develop and demonstrate broad knowledge and understanding of legislative requirements and teaching strategies that support participation and learning of students with disability.","enjoyResponse":71,"faculty":"Faculty of Education","unitCode":"EDF3211","eftsl":0.125}