{"preqs":"Course commenced prior to 2014:Must have passed 3 units in EDF1303, EDF1304, EDF2003, EDF2004, EDF2005, EDF3002Course commenced in or after 2014:EDF2005 and EDF2007","creditPoints":6,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For commencement date before `01-JAN-2014` Do Must have passed 3 (I/W) units in {EDF1301, EDF1302, EDF1303, EDF1304, EDF2001, EDF2002, EDF2003, EDF2004, EDF2005, EDF3002} Otherwise Must have passed 2 (I/W) units in {EDF2005, EDF2007}","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For commencement date before `01-JAN-2014` Do Must have passed 3 (I/W) units in {EDF1301, EDF1302, EDF1303, EDF1304, EDF2001, EDF2002, EDF2003, EDF2004, EDF2005, EDF3002} Otherwise Must have passed 2 (I/W) units in {EDF2005, EDF2007}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"Peninsula","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Schooling, education and equity: Local and global perspectives","description":"This unit inquires into the challenges of achieving equity in schooling and education in diverse social and cultural contexts. It critically engages with a combination of sociological theory, contemporary policy documents and accounts of innovative practice in schools and communities to explore the ways in which curriculum and teaching and learning strategies can be ethically responsive to centralised government policy and local and community needs. International policy developments and trends in multicultural education are examined, as well as local, state and national responses. Cultural, linguistic, religious, socioeconomic, intellectual and physical differences among all students are studied in relation to creating equitable and inclusive learning environments. The unit builds understanding of the histories, cultures and identities of Aboriginal and Torres Strait Islander people and explores how this understanding in educators can productively contribute to experiences of schooling for all young Australians.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF3009","eftsl":0.125}