{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4899}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Online)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Teaching specialism in secondary education A","description":"This unit enables students to develop the required knowledge, skills and capacities to teach their specialism (method) in secondary schools. It develops students\u0027 understanding of a range of curricula and pedagogical practices in the teaching and learning of their specialist field. It encourages students to explore relevant research literature, engage with traditional and contemporary ideas, and focus on the specific challenges, complexities, debates and ideas associated with teaching and student learning in their specialism. Through this unit, students develop skills in a number of areas including lesson and unit planning, developing learning outcomes for students, differentiating the curriculum and individual planning for diverse learner needs, selection and preparation of appropriate teaching resources and assessment strategies and selection of appropriate content and teaching procedures for their specialist field. This unit models working in collaborative teams, exploring different perspectives, engaging with research literature and critical reflection on practice as essential parts of professional learning and as integral to the professional work of a teacher. Students engage in constructive conversations with other students in this unit to explore a range of perspectives and compare the complexities of teaching and learning in their specialism with other specialisms.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5183","eftsl":0.125}