{"preqs":"A minor sequence in English (literature or literary studies); orA minor sequence in writing, English language studies or linguistics together with a two-unit sequence in English (literature or literary studies)","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4857}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"English education in the secondary years A","description":"This unit enables pre-service education students to build a strong foundation for their career-long professional learning as teachers of English, literature, literacy and related subjects in secondary school (Years 7 to 12). Students work collaboratively and independently to develop their skills and knowledge in planning and implementing curriculum materials in the area of English language. They learn how teachers plan for and undertake educational projects and research as part of their professional work. Students also learn to appreciate how language, in its various modes and uses, including those involving information and communication technologies (ICT), mediates the learning of all young people across a range of curriculum areas and in their outside-school lives. Through an examination of a range of national and international education policies and the Australian Curriculum: English, students are familiarised with current developments in the theory and practice of English literacy education. The unit informs and facilitates students\u0027 active contributions to contemporary dialogue within the English teaching profession, drawing both on the rich traditions and exciting innovations in English education in Australia and internationally.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5135","eftsl":0.125}