{"preqs":"EDF5143","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4866}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5143}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.673076923,"learnScore":4.355311355,"learnResponse":10,"proh":"","scaBand":1,"unitName":"History education in the secondary years B","description":"This unit builds on EDF5143 (History education in the secondary years A) and continues to develop pre-service teachers\u0027 understandings and skills with regard to the teaching and learning of history as either a stand-alone discipline or an identifiable and rigorous component of integrated programs in Australian or overseas schools or wider educational settings. Successful completion of this unit enables students to demonstrate advanced knowledge, skills and capabilities in history education. The unit continues to be practice-based, research-informed and resource-rich. It embraces diverse histories, perspectives, pedagogies and technologies, and prepares pre-service teachers to tailor history education experiences to meet their students\u0027 different learning, career, leisure and life needs. It explores advanced teaching, learning and assessment strategies with emphases on \u0027viewing\u0027, \u0027listening to\u0027 and \u0027visiting\u0027 primary sources of the past. It engages with relevant professions and communities, especially leading history education resource providers at state/territory, national and international levels. It encourages effective inclusion of Aboriginal and Torres Strait Islander histories and cultures, Asia and Australia\u0027s engagement with Asia, and sustainability imperatives, and identifies connections between religious studies and history education. It develops the suite of skills associated with unit planning and delivery at all secondary year levels, and examines the requirements of various history curricula in Australia. It concludes by offering strategies for securing employment as history/humanities school teachers or educators in non-school history education settings that advocate and work for high quality history education experiences and respond effectively to curriculum priorities or history education developments as they arise.","enjoyResponse":19,"faculty":"Faculty of Education","unitCode":"EDF5144","eftsl":0.125}