{"preqs":"EDF5131","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5131}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4854}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.888888889,"learnScore":4.74702381,"learnResponse":11,"proh":"","scaBand":1,"unitName":"Economics education in the secondary years B","description":"This unit enables pre-service education students to further develop and extend the learning undertaken in EDF5131 (Economics education in the secondary years A). Students continue to build a strong foundation for their career-long professional learning as teachers of economics, consumer and financial literacies, enterprise and business related education in secondary schools. Students further their understanding of key theoretical and pedagogical perspectives and issues in the teaching of economics and related curriculum. They acquire knowledge and understanding of the nature and purpose of assessment, designing assessments that are purposeful and relevant to the teaching and learning economics program and the learning needs of students. Through an examination of a range of curricula drawn from state, national and international contexts students are further familiarised with current developments in the theory, research and practice of economics education. Students work independently, collaboratively and interdependently to develop their capabilities in planning and implementing appropriate curriculum and pedagogy. They undertake research into the design of a comprehensive teaching and learning plan suitable for teaching compulsory economics content. The unit reinforces a view of learning about teaching as an ongoing, collaborative process that is developed through critical reflection on experience.","enjoyResponse":11,"faculty":"Faculty of Education","unitCode":"EDF5132","eftsl":0.125}