{"preqs":"EDF5165","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4882}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5165}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.65,"learnScore":4.708333333,"learnResponse":5,"proh":"","scaBand":1,"unitName":"Music education in the secondary years 1B","description":"This unit builds on the key ideas and methods in teaching and learning music introduced in EDF5165 (Music education in the secondary years 1A). Further, this unit supports all music teaching and learning including that offered by instrumental specialist teachers. It provides students with opportunities to develop their subject matter knowledge and skills relevant to teaching in secondary schools. This unit focuses primarily on senior secondary school music. Students are encouraged to further refine their attitudes and approaches to music education through critical reflection, research, analysis and evaluation as part of their professional work. In turn, students further develop the required research skills considered necessary for contemporary educators. This is particularly pertinent for class music educators, many of whom are already experienced instrumental teachers and music professionals.The unit employs a pedagogical approach that connects theoretical and experiential learning, understanding these embedded practices to be interrelated and interdependent. As part of this cycle of learning, students are expected to engage in planning, presenting and evaluating teaching sequences through critical reflection, research and analysis of pedagogical reasoning. Furthermore, the unit reinforces a view of learning about teaching as an ongoing, collaborative process.","enjoyResponse":9,"faculty":"Faculty of Education","unitCode":"EDF5166","eftsl":0.125}