{"preqs":"EDF5167","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5167}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {EDF5166}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4884}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":5,"learnScore":4.916666667,"learnResponse":2,"proh":"","scaBand":1,"unitName":"Music education in the secondary years 2B","description":"This unit further develops the understandings of some major teaching and learning methods and ideas useful in contemporary music education. It expands the knowledge and understandings developed in EDF5167 (Music education in the secondary years 2A). In particular, the unit explores the knowledge and skills inherent within major music methodologies such as Kodaly, Dalcroze and Orff, and the application of these new understandings to the secondary music classroom. Students are encouraged to share their past experiences in these methodologies and, in doing so, build a better understanding and basis for future practice as educators. The practical aspects of school music programs are explored through a research-based piece which evaluates a school instrumental program, underpinned by data gathered while on practicum. The unit employs a pedagogical approach that connects theoretical and experiential learning, understanding these embedded practices to be interrelated and interdependent. This experiential learning is furthered by the students\u0027 previous or current involvement in a musical production. The skills, knowledge and capacities the students learn through their involvement in a musical production are applied to the real school musical experience when they lead their own students in the development of a school musical.","enjoyResponse":3,"faculty":"Faculty of Education","unitCode":"EDF5168","eftsl":0.125}