{"preqs":"EDF5183","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4900}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5183}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Online)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Teaching specialism in secondary education B","description":"This unit extends students\u0027 understanding of varied methods and practices in their specialist field, with an emphasis on the later years of secondary school. Students continue to research contemporary and innovative ideas and research literature and explore the complexities, challenges, debates and issues associated with teaching and learning within their specialism. They consolidate knowledge and skills in a number of areas including lesson and unit planning, differentiating the curriculum and planning for diverse learner needs, selection and preparation of appropriate teaching resources and assessment strategies and selection of appropriate content and teaching procedures for their specialist field. The focus of the unit is on developing pedagogy relevant to learners in the secondary years and to the Australian Curriculum, but also draws on examples from education systems outside of the Australian context. This includes how to develop pedagogy in school systems where mainstream resources are not available so that students are prepared to teach across the world in varied settings. Students work collaboratively in professional learning teams, share their perspectives on what it means to teach and learn within their specialism, and monitor their own learning. This is viewed as an essential part of learning to teach and as integral to their professional work as a teacher.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5184","eftsl":0.125}