{"preqs":"A minor sequence in history","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4865}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"History education in the secondary years A","description":"This unit introduces pre-service teachers to the teaching and learning of history as either a stand-alone discipline or an identifiable and rigorous component of an integrated program in either Australian or overseas schools or wider educational settings. Successful completion of this unit enables students to demonstrate advanced knowledge, skills and capabilities in history education. The unit is practice-based, research-informed and resource-rich. It embraces diverse histories, perspectives, pedagogies and technologies and prepares pre-service teachers to tailor history education experiences to meet their students\u0027 different learning, career, leisure and life needs.The unit explores: pre-service teachers\u0027 personal philosophies and latest research on why to teach and learn about the past, multiple definitions of \u0027historical literacy\u0027, and Australian Curriculum cross-curriculum priorities (especially Aboriginal and Torres Strait Islander histories and cultures, and Asia and Australia\u0027s engagement with Asia) and general capabilities. It explores Australian Curriculum: History and its implementation and evolution; civics and citizenship education and values education imperatives, strategies for engaging and purposeful lesson-planning and delivery, \u0027teaching by the textbook and the website\u0027, teacher-directed as well as student-centred questioning, English language proficiency including assisting students for whom English is another language, preparations for school placement, and introductions to inquiry methodology, Gardner\u0027s \u0027multiple intelligences\u0027, Bloom\u0027s \u0027taxonomy\u0027 and de Bono\u0027s \u0027six thinking hats\u0027.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5143","eftsl":0.125}