{"preqs":"36 credit points (with at least 12 points at each of levels 2 and 3) in music and:(1.) which includes practical music; or(2.) together with AMEB Grade VI or Year 12 practical music; or(3.) which includes practical music specialising in one or more musical instruments","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4881}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Music education in the secondary years 1A","description":"This unit introduces students to the teaching and learning methods and major ideas useful in contemporary music education, particularly those that are essential for class music teachers. Further, this unit supports all music teaching and learning including that offered by instrumental specialist teachers. It provides students with opportunities to develop their subject matter knowledge and skills relevant to teaching in secondary schools and also considers primary school music education from the viewpoint of the specialist music educator. Students are encouraged to refine their attitudes to music education through critical reflection and evaluation of both their past and current experiences. This introduces students to the research skills considered necessary for their professional work. This is particularly pertinent for class music educators, many of whom are already experienced instrumental teachers and music professionals.The unit employs a pedagogical approach that connects theoretical and experiential learning, understanding these embedded practices to be interrelated and interdependent. As part of this cycle of learning, students are expected to engage in planning, presenting and evaluating teaching sequences through critical reflection. Furthermore, it reinforces a view of learning about teaching as an ongoing, collaborative process. This unit focuses primarily on lower and middle secondary school music.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5165","eftsl":0.125}