{"preqs":"","creditPoints":6,"rules":[],"locationAndTime":[{"location":"Berwick","time":["First semester 2017 (Day)"]},{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"Peninsula","time":["First semester 2017 (Day)","First semester 2017 (Online)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Numeracy for learners and teachers","description":"In this unit students learn about the relationship between numeracy and mathematics as it applies to both learners and teachers. Being numerate is an expected outcome of schooling; everyone, as an informed citizen, needs to deal with the numeracy demands within everyday life, work and education contexts. The implications of this for learners and teachers are examined. Students explore the numeracy demands embedded across the school curriculum in a range of relevant contexts at all school levels, as well as within disciplines. To be numerate, individuals need to draw upon a wide range of mathematical knowledge, skills and concepts. Students encounter these mathematical concepts and engage with the various dimensions of numeracy: measurement, mathematical literacy (dealing with basic number skills), statistical literacy, financial literacy, and spatial/geometrical literacy. Relevant curricular examples that encompass these dimensions of numeracy are encountered and students reflect on pertinent teaching approaches to engage students in such tasks. Students also consider the school as the workplace of teachers, and explore the breadth of numeracy demands on teachers and the confidence, knowledge and skills needed to deal with them, including the use of digital tools. Examples include the interpretation of student achievement and other statistical data to guide pedagogical practices and improve learning outcomes, and financial aspects of school management. Students have opportunities to recognise and build on their own mathematical competencies.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5017","eftsl":0.125}