{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF6005, EDF6006, EDF6007}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Flexible)"]},{"location":"City (Melbourne)","time":["Term 4 2017 (Off-campus block of classes)"]}],"enjoyScore":4.125,"learnScore":3.958333333,"learnResponse":7,"proh":"EDF6005EDF6006EDF6007","scaBand":1,"unitName":"Using and evaluating research evidence","description":"This unit focuses on the challenges and opportunities of using and evaluating research evidence in professional practice. Calls for evidence-based policy and practice have become increasingly widespread across many areas of public policy. Within education, there is increasing emphasis on the need for research evidence to be used in the improvement of educational practice and the development of educational policy. But what is research evidence and where can it be accessed? How can different kinds of research evidence be evaluated critically and applied to practice and policy? What skills and processes are involved in using research evidence to solve problems, make decisions and lead change? And what is behind the growth of evidence-based agendas within and beyond education? Through exploration of each of the above questions, students develop their skills in identifying, distinguishing and appraising different kinds of research evidence. Drawing on different models and approaches to research use, they gain experience analysing, using and communicating research evidence in relation to a specific concern of relevance to their professional or educational contexts. This unit enables students to develop their understandings of evidence-based policy and practice, to gain first-hand experience of identifying, evaluating, using and communicating research evidence, and to become more confident and skilled users of research.","enjoyResponse":14,"faculty":"Faculty of Education","unitCode":"EDF5693","eftsl":0.25}