{"preqs":"36 credit points (with at least 12 points at each of levels 2 and 3) in relevant area(s) of visual arts (e.g. photography, sculpture, drawing, ceramics, multimedia) which includes at least one quarter of a year of practical art content.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4897}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {EDF5179}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Visual art and design education in the secondary years 2A","description":"This unit provides pre-service art teachers with a heightened understanding of the connections between the knowledge disciplines and practices which inform visual art curriculum. Working collaboratively and independently, students build skills around the development of art historical and art critical knowledge, such as research, lesson planning and unit preparation. The unit also enables students to learn about museum activities, the use of information and communication technology (ICT) in these spaces and the design of museum experiences for secondary school art and design students. Students explore approaches to the exhibition space and to the function of museums, in order to utilise these sites as supplements to the art classroom. Drawing on national and international literature, students engage in their own research to develop  foundational knowledge in art historiography and pedagogical strategies relevant to art history and art criticism that lead students back to studio practice.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5181","eftsl":0.125}