{"preqs":"EDF5157","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4874}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5157}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {EDF5156}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.5,"learnScore":3.75,"learnResponse":4,"proh":"","scaBand":1,"unitName":"Languages education B","description":"This unit builds on EDF5157 (Languages education A). It extends students\u0027 knowledge, understandings and skills in Foundation to Year 12 (F-12) languages education. Students draw on research literature across primary and secondary school contexts to develop an understanding of learning strategies in order to build effective practices to inform their teaching in second language learning. The unit critically examines a range of contemporary curriculum and pedagogical innovations in languages education, including the use of information and communication technology (ICT), multiliteracies, critical inquiry and action research projects. Through further examination of a range of national and international languages policies students investigate and evaluate theoretical and practical links of second language literacies and school contexts in order to better appreciate the importance of how languages contribute to this educative process. Working collaboratively and independently, students consolidate their content knowledge, develop pedagogical knowledge and skills enabling them to provide solutions to complex educational challenges in F-12 classrooms.","enjoyResponse":4,"faculty":"Faculty of Education","unitCode":"EDF5158","eftsl":0.125}