{"preqs":"EDF5135","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4858}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5135}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.107142857,"learnScore":4.172619048,"learnResponse":10,"proh":"","scaBand":1,"unitName":"English education in the secondary years B","description":"This unit builds on EDF5135 (English education in the secondary years A) by extending pre-service students\u0027 knowledge, skills and capacities. Students continue to build a strong foundation for their career-long professional learning as teachers of English language, literature, literacy and related subjects in secondary school (Years 7 to 12). Students work collaboratively and independently to plan and implement appropriate curriculum in the area of English language. They also learn how teachers plan for and undertake educational projects and research as part of their professional work. They develop a finely honed appreciation of how language, in its various modes and uses, including information and communication technologies (ICT), mediates the learning of all young people in school and in their outside-school lives. Through an examination of a range of national and international education policies and the Australian Curriculum: English, students are familiarised with current developments in the theory and practice of English literacy education, with a particular focus on senior English curriculums. The unit informs and facilitates students\u0027 active contributions to contemporary dialogue within the English teaching profession, drawing both on rich traditions and exciting innovations in English education in Australia and internationally.","enjoyResponse":19,"faculty":"Faculty of Education","unitCode":"EDF5136","eftsl":0.125}