{"preqs":"A minor sequence in physics (includes electronics)","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4889}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Physics education in the secondary years A","description":"This unit prepares pre-service teachers to teach physics in secondary schools and colleges both as a specialist subject in senior years (Years 11 and 12) and within the junior science curriculum (Years 7 to 10). A central focus of the unit is for pre-service teachers to develop and apply critical thinking and reflection. This enables them to build a deep understanding of the importance of developing and implementing an effective pedagogy for teaching physics that can be adapted and applied in diverse educational settings. The unit also builds an advanced knowledge of problematic physics content through an examination of the national and international physics education research literature and the application of evidence-based teaching approaches that successfully facilitate student learning. Pre-service teachers are assisted to trial and critique a wide variety of purposeful and effective teaching strategies including the implementation of information and communication technology (ICT) skills and techniques considered essential for establishing a productive, diverse and sustainable secondary classroom.In addition, pre-service teachers are introduced to local and national curricula (junior to senior years) and developments in global physics education so that they are confident about aligning and evaluating their teaching to successfully meet the demands of the curriculum. Throughout the unit, students are encouraged to work collaboratively while being challenged to consider the key issues and dilemmas impacting contemporary physics education in a variety of contexts and how these might be addressed and influence their professional classroom practice.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5173","eftsl":0.125}