{"preqs":"Major sequence (48 credit points) in outdoor education which includes environmental studies and outdoor recreational activities. A current first aid certificate (Emergency First Aid Level 2) is required.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4885}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Outdoor education in the secondary years A","description":"This unit prepares pre-service students to teach school outdoor education from Years 7 to 12. Drawing on a range of Australian and international research, the unit introduces students to the historical, philosophical, experiential and environmental foundations of outdoor education and explores how these shape professional practice and student learning. Working collaboratively and independently, students develop competencies and skills in professional knowledge and professional practice. They reflect critically upon their experiences of learning, leading and teaching in outdoor education, and apply their understandings, knowledge and skills in planning for teaching and learning in a range of contexts and settings, including where possible the use of information and communication technologies (ICT). The unit enables students to pursue a critical research agenda in outdoor education, enabling them to become critically reflective and informed professionals. They also learn how teachers plan for and undertake educational projects and research as part of their ongoing professional development.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5169","eftsl":0.125}