{"preqs":"EDF5127","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5127}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4848}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.125,"learnScore":4.083333333,"learnResponse":9,"proh":"","scaBand":1,"unitName":"Chemistry education in the secondary years B","description":"This unit builds on EDF5127 (Chemistry education in the secondary years A) in preparing students to teach chemistry in secondary schools and colleges both as a specialist unit in senior years (Years 11 and 12) and within the junior science curriculum (Years 7 to 10). Pre-service teachers continue to build an understanding of the importance of developing and applying an effective pedagogy for teaching chemistry through the use of critical reflection. The application of evidence-based teaching approaches that better facilitate student conceptual understanding of chemistry content learning is a focus of the evaluation of curriculum design and implementation. Students trial a wide variety of effective teaching strategies including the use of information and communication technology (ICT) skills and techniques essential for establishing a productive and engaging secondary science classroom.The unit highlights the importance of setting personal and professional goals, engaging with relevant research and actively accessing professional learning programs that contribute to the ongoing improvement of one\u0027s professional classroom practice. The principles of and methods for assessing and monitoring student learning in chemistry are explored further. The relationship between science, technology and society, the cultural context for chemistry, the nature of chemistry as a discipline, the values that underpin chemistry and the relevance of chemistry to students\u0027 lives are recurrent themes explored through readings, class group work, discussion forums and assignments.","enjoyResponse":9,"faculty":"Faculty of Education","unitCode":"EDF5128","eftsl":0.125}