{"preqs":"A major and minor sequence (total of 72 credit points) of study in physical education which should include discipline study in human movement (e.g. anatomy, physiology, exercise physiology, biomechanics, growth and motor development, skill acquisition and psycho-social aspects of physical activity), health and nutrition and study in the skill activity areas of fundamental motor skills, ball handling, dance, games, fitness education, athletics, aquatics and sport education.A current first aid certificate (Emergency First Aid Level 2) and current AustSwim Teacher of Swimming and Water Safety certificate are required.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4887}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Physical education in the secondary years A","description":"This unit prepares students to teach school physical education from Years 7 to 12. It provides students with the historical, philosophical and experiential foundations of physical education and how these have shaped and continue to shape contemporary perspectives, paradigms of practice and diverse student needs and how they learn in physical and movement culture. They learn how teachers plan for and undertake educational projects and research as part of their professional work. A focus for this unit is on students developing competencies and skills in professional knowledge underpinned by local and international curriculum and how this is enacted in professional practice. Students are provided with opportunities, in class and/or via related professional experience (teaching practicums), to consolidate their content knowledge, develop subject matter and pedagogical content knowledge and skills relevant to teaching in secondary schools.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5171","eftsl":0.125}