{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {D4005}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Flexible)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Digital foundations of STEM education","description":"This unit builds student capacity in the purposeful and creative use of digital technologies as part of STEM (science, technology, engineering and mathematics) education. Students critically evaluate both practice and research in the use of digital technologies in STEM curriculum. Through practice, students investigate and design appropriate strategies for the effective integration of digital technologies to support student engagement and learning. Throughout the unit opportunities are made available to students to develop an understanding of how digital technologies can support STEM education. At the same time students are exposed to contemporary research and debates regarding the role of digital technologies in STEM, STEM education and education more broadly, including significant issues such as access, equity, content representation, ethics and risk. Theory, research and practice are brought together as students are encouraged to practise a critical approach while designing the integration of digital technologies in their STEM education programs. Such an approach includes new and emerging approaches to engaging students in STEM education through digital technologies and practices such as \u0027making\u0027, coding programming, game-based learning, data visualisation and flipped classrooms. In-class activities may include engaging in STEM debates related to pre- and post-class materials as well as practical hands-on applications of digital technologies such as the programming of personal data collection devices or the creation of stop-animation. Pre- and post-class activities may include reading of academic texts, watching \u0027flipped\u0027 class materials such as videos, quizzes, and individual and collaborative creation of digital artefacts. Students engage in hands-on application of digital technologies in relation to STEM education. While the unit requires students to learn how to use digital technologies, it has been designed for all students regardless of their familiarity with digital technologies.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5303","eftsl":0.125}