{"preqs":"A minor sequence in linguistics or a second language (i.e. not the teacher\u0027s first language)","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4855}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"English as an additional language (EAL) education in the secondary years A","description":"This unit prepares pre-service student teachers for the teaching of English as an additional language (EAL) to the full range of non-English speaking background students, including recently arrived students with limited English language skills, international students and others in a range of EAL contexts. Drawing on a range of research, it investigates the nature of English and the theory and principles of second language pedagogy, along with many other factors that have an impact on EAL teaching and learning. Particular attention is paid to the sociocultural contexts of learning and the need for sensitivity to linguistic and cultural diversity in schools. With reference to current curriculum documents, policy and assessment protocols, pre-service teachers learn to apply appropriate research methodology to the assessment of EAL learner needs, devise appropriate lessons to meet those needs and to select and adapt materials to work effectively to maximise the educational opportunities of all EAL learners. Links are made to the professional experience units in the course, both in terms of preparing students to undertake their practicum (including lesson planning and activities that incorporate the use of information and communication technology) and in guiding students\u0027 critical reflection on their practice during and after that practicum.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5133","eftsl":0.125}