{"preqs":"EDF5173","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4890}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5173}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.875,"learnScore":4.597222222,"learnResponse":5,"proh":"","scaBand":1,"unitName":"Physics education in the secondary years B","description":"This unit builds on EDF5173 (Physics education in secondary years A). It prepares pre-service teachers to teach physics in secondary schools and colleges both as a specialist unit in senior years (Years 11 and 12) and within the junior science curriculum (Years 7 to 10). A central focus of the unit is to continue to assist pre-service teachers to develop their capacity and confidence to effectively communicate their advanced physics knowledge using a diverse range of appropriate teaching strategies and laboratory work, while encouraging purposeful and critical thinking in their students. The unit also builds the pre-service teacher\u0027s confidence to design a variety of authentic assessment and monitoring procedures aimed at evaluating the ability of their students to achieve the intended learning objectives as outlined in the relevant physics curricula. An important component of this unit is an increased focus on the need for pre-service physics teachers to think critically about planning the development of their own professional practice and the extent to which this addresses the diverse social, cultural and economic needs of their students. Pre-service teachers also undertake research into the design of a comprehensive unit of work suitable for teaching senior physics content, and critically reflect on their own professional practice and its importance for effecting and motivating continuous improvement. The unit highlights the importance of setting personal and professional goals and identifies physics professional associations and learning communities that contribute to enriching and supporting physics teachers in improving student learning in physics.","enjoyResponse":5,"faculty":"Faculty of Education","unitCode":"EDF5174","eftsl":0.125}