{"preqs":"36 credit points (with at least 12 points at each of levels 2 and 3) in relevant area(s) of visual arts (e.g. photography, sculpture, drawing, ceramics, multimedia) which includes at least one quarter of a year of practical art content.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4895}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Visual art and design education in the secondary years 1A","description":"This unit enables pre-service teachers to develop skills in lesson planning for diverse student learners and to confidently approach their initial pre-service classroom experiences in visual art and design. Working collaboratively and independently, students build understanding and knowledge of the ways in which visual art and design pedagogy can be considered in practical terms and the corresponding nature of professional identity for the specialist art and design teacher. The assessment tasks provide opportunities for students to engage at a theoretical and practical level with critical curriculum models (from Australia and overseas) and to apply their knowledge of this theory in their developing art and design pedagogy, including information and communication technology (ICT) practices. The emphasis is on exploring classroom practice and curriculum design, offering students opportunities to understand and identify with the professional responsibilities specific to learning and teaching in the disciplines that inform visual art and design curriculum practice.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5179","eftsl":0.125}