{"preqs":"36 credit points (with at least 12 points at each of levels 2 and 3) of study in a language, which requires as a prerequisite successful completion of Year 12 studies in the language. Native speakers of the language must seek a statement of equivalence from an Australian university to verify that their knowledge and competence in the language meets the standard of a post Year 12 study in the language (refer to course adviser for more information).","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {EDF5155}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4873}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Languages education A","description":"This unit involves pre-service education students in the close examination of current, local and international research on first and second language theories linked to Foundation to Year 12 principles of classroom pedagogy. Students reflect on the research, policies and practices for effective teaching of languages within the perspective of the F-12 continuum. Students explore flexible and informed approaches to languages education in early years, junior, middle and senior years classrooms, advancing their capacities to select appropriate strategies for different learners\u0027 linguistic and communicative needs. Planning and sequencing lessons for a variety of contexts are linked to research, and literature of second languages education explores intercultural contexts as they are realised through interaction with languages education. Drawing on literature and research studies, students review, analyse, consolidate and synthesise their knowledge and skills as they work towards advancing their capacities in this field.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5157","eftsl":0.125}