{"preqs":"A minor sequence in general science and a minor sequence in one of biology, chemistry, earth science (geology), environmental science or physics together with a two-unit sequence in another of these areas of study.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4859}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"General science education in the secondary years A","description":"This unit introduces students to the language, methods and major ideas useful in contemporary science teaching and focuses on content, pedagogy and the interrelationships between them, laying a strong foundation for career-long professional learning. Students develop their subject matter knowledge and skills from critically engaging with national and international research literature relevant to teaching in secondary schools and they refine their attitudes through reflecting on their past and current experiences. The unit draws on concepts from constructivist theories of learning, pedagogical content knowledge and critical reflection enabling pre-service teachers to apply evidence-based teaching approaches that successfully facilitate student learning. Pre-service teachers are assisted to trial and critique a wide variety of purposeful and effective teaching strategies including the implementation of information and communication technology (ICT) skills and techniques considered essential for establishing a productive, diverse and sustainable secondary classroom. The unit emphasises a view of learning about teaching as an ongoing, collaborative process that is developed through engaging with theory, research and critical reflection on experience.","enjoyResponse":0,"faculty":"Faculty of Education","unitCode":"EDF5137","eftsl":0.125}