{"preqs":"EDF5133","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {EDF4856}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {EDF5133}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {1737, 4201, D6001%} Do true Otherwise Must have passed 48 credit points at levels {1, 2, 3} from units owned by {50000564}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.142857143,"learnScore":4.155555556,"learnResponse":13,"proh":"","scaBand":1,"unitName":"English as an additional language (EAL) education in the secondary years B","description":"This unit builds on the contextual and pedagogical knowledge about EAL teaching developed in EDF5133 (English as an additional language (EAL) education in the secondary years A). Working collaboratively and independently, students link theory and practice in order to deepen their capacity to teach EAL in a range of settings, including intensive new arrival programs, EAL support programs in the mainstream, EAL programs targeting international students and team-teaching (where ESL teaching is taught in cooperation with a mainstream subject teacher). The unit links in with knowledge and skills gained during professional experience units in the course. One aspect of this linking involves examination of a variety of EAL practices and frameworks in secondary settings, including the Australian and Victorian curriculum. Students lean how to assess EAL learner needs, how to devise appropriate strategies and materials, including units of work to meet those needs, and how to work effectively as part of a whole-school program to maximise the educational opportunities of all EAL learners.","enjoyResponse":13,"faculty":"Faculty of Education","unitCode":"EDF5134","eftsl":0.125}