{"preqs":"A Distinction average (70%) across Masters core units is required","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENS5930%}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {ENS5900, ENS5901, ENS5902, ENS5910, ENS5920}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)","Second semester 2017 (Day)","Summer semester A (starts November) 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"This unit cannot be undertaken with other advanced practice units including ENS5900, ENS5901, ENS5902, ENS5910 and ENS5920 except by special approval from the specialisation coordinator.  Preparatory students should complete Part B before taking the unit.","scaBand":2,"unitName":"Sustainability internship","description":"ENS5930 (12 points) is the unit for students who wish to undertake a professional internship during a semester of the advanced practice year of the Master of Environment and Sustainability. Students undertake a project defined by a host organisation domestically or internationally with the approval of the unit and specialisation coordinator. The placement may be an affiliated arrangement where a consultancy or research project is carried out in association with the organisation and physical location at the organisation is not required. Host organisations may be from a diverse range of industries and sectors, including government departments, private industry and not-for-profit organisations. Students communicate the project findings to the host organisation in the format specified by the host organisation, such as a consultation paper, report, commentary, manual, submission or speech. The host organisation provides field supervision, and the Faculty of Arts provides academic supervision. The unit includes some scheduled activities alongside the project work to enhance and develop professional skills. Students from any specialisation can undertake this unit if they fulfil the academic requirements and gain approval from the appropriate coordinators.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ENS5930","eftsl":0.25}