{"preqs":"Credit average (60%) across Master core units, along with permission from the unit coordinator","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENS5910%}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"(Must have passed 2 units in {ENS5910, ENS5920} with grade of at least {STANDARD.D} and  Permission required)","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {ENS5900, ENS5910, ENS5920, ENS5930}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"The unit cannot be undertaken with other advanced practice units including ENS5900, ENS5901, ENS5902, ENS5920, and ENS5930 except by special approval from the specialisation coordinator. Preparatory students should complete Part B before taking the unit.","scaBand":2,"unitName":"Interdisciplinary project for sustainable development solutions","description":"ENS5910 (12 points) is the unit for students who wish to develop their professional competencies for working effectively in an applied interdisciplinary context. In this unit, teams composed of 3-5 students from different disciplines will work in association with a partner organisation from government, private industry or not-for-profit to identify, analyse and address \u0027real-world\u0027 complex, sustainability challenges.In their mixed-disciplinary teams, students will focus on a sustainability governance, policy or management topic that has been identified as a \u0027wicked problem\u0027 by a partner organisation associated with Monash Sustainable Development Institute (MSDI).With guidance from an MSDI supervisor and the partner organisation, the team will diagnose and analyse different perspectives, values at stake and politics of the project and will present a well-argued, plainly communicated and easily accessible analysis of the wicked problem. Within the team the students will negotiate and integrate their knowledge to develop a context specific and relevant solution to the identified sustainability challenge. The team will deliver a proposed solution implementation strategy to the partner organisation that includes mechanisms to create and enable the desired change.Students will communicate the project findings in the format specified by the academic supervisor and/or partner organisation. Part of the teams\u0027 interdisciplinary project outcomes will be a project report that is to be shared with the partner organisation. The unit includes some scheduled activities alongside the project work to enhance and develop professional skills. Students from any specialisation can undertake this unit if they fulfil the academic requirements and gain approval from their specialisation and unit coordinator.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ENS5910","eftsl":0.25}