{"preqs":"This is a specialist core unit for the Environmental Security specialisation. Non-cognate students in this specialisation must complete preparatory studies (Part B) prior to undertaking this specialist unit. Students undertaking this unit as an elective within other specialisations must consult with the unit coordinator about assumed foundational knowledge and preparatory material. Approval from the unit co-ordinator is required.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Permission required","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENS5310%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Securing biodiversity and ecosystems","description":"This unit examines the ways in which multiple forms of global change interact to drive the loss of biodiversity and ecosystem services. Solutions for securing biodiversity and ecosystem services and ensuring the protection and sustainable use of renewable resources are discussed.The unit uses relevant policies and management approaches by which biodiversity and ecosystems are governed, to evaluate the scientific evidence base underpinning these, and to identify gaps and future solutions. Example topics covered include integrated land-use planning, area- and species-based conservation strategies, biosecurity, and the development of sustainable harvest systems.Students will develop their understanding of the concepts and the skills needed for translating and integrating scientific evidence into decision-making for the protection of biodiversity and ecosystems. To enhance this understanding students will collaborate with peers and experts to develop their capacity to use biological knowledge and evidence in professional planning, management and conservation.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ENS5310","eftsl":0.125}