{"preqs":"An average grade of 75% across Master core units (ENS5010, ENS5020) and approval from the School/Department where the research will be undertaken.","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {ENS5900, ENS5910, ENS5920, ENS5930}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENS5901}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {ENS5902}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"(Must have passed 2 units in {ENS5910, ENS5920} with grade of at least {STANDARD.D} and  Permission required)","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]},{"location":"Clayton","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ENS5900, ENS5910, ENS5920, ENS5930 except by special approval from the specialization coordinator.","scaBand":2,"unitName":"Research project in environment and sustainability part A","description":"ENS5901 (12 credit points), in combination with ENS5902, enables students to undertake research over two semesters during the advanced practice component of the course. ENS5901 provides an opportunity for students to pursue a major academically-oriented piece of research in their chosen discipline. This advanced and authentic experience will develop transferable research skills for professional practice across sectors and provides a pathway to a PhD. Over the course of ENS5901 and ENS5902, students are assessed based on a research thesis (90%) and a conceptual development/reflection task (10%). The format and requirements of the research thesis will vary according to the requirements of the specialisation. In addition to independent research, the unit includes some scheduled activities to enhance and develop transferable research skills in study design, analysis and academic writing. Students from any specialisation can undertake the unit if they fulfil the academic requirements and gain approval from an appropriate supervisor. ENS5901 with ENS5902 provide the same experience as ENS5900, but enable students to undertake research over two semesters.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ENS5901","eftsl":0.25}