{"preqs":"This is a specialist core unit for the Environmental Security specialisation. Non-cognate students in this specialisation must complete preparatory studies (Part B) prior to undertaking this specialist unit. Students undertaking this unit as an elective within other specialisations must consult with the unit coordinator about assumed foundational knowledge and preparatory material. Approval from the unit co-ordinator is required.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENS5320%}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Permission required","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (On-campus block of classes)","Second semester 2017 (Day)","Second semester 2017 (Evening)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Climate change, energy and human security","description":"This unit provides a fundamental understanding of the science, policy and regulatory frameworks relating to the nexus between climate change, renewable and non-renewable energy resources. The physical science, climate models, projections and impacts are discussed along with national and international climate change policy and regulatory aspects.The unit will develop skills and understandings to translate the best contemporary climate change science into appropriate decision-making to preserve the physical, biological and economic systems upon which human security depends. Students will also gain understanding of climate change scenario development, vulnerability assessment and mitigation and adaptation responses at organisational, community and national levels.The unit will involve site visits to both renewable (solar arrays and wind farms) and non-renewable energy generation facilities. To facilitate these understandings visits will also be made, for example, to local government authorities in Victoria dealing with climate change vulnerabilities and assessments. The critical links between climate change, climate change impacts and human security are emphasised throughout the unit.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ENS5320","eftsl":0.125}