{"preqs":"This is a specialist core unit for the Environmental Security specialisation. Non-cognate students in this specialisation must complete preparatory studies (Part B) prior to undertaking this specialist unit. Students undertaking this unit as an elective within other specialisations must consult with the unit coordinator about assumed foundational knowledge and preparatory material. Approval from the unit co-ordinator is required.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Permission required","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENS5330%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)","Second semester 2017 (Evening)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Water security and environmental pollution","description":"This unit will give students the knowledge and perspectives to manage water resources for human consumption, recreation and ecological values. The unit will commence by covering the basics of the hydrological cycle necessary to understand the factors controlling groundwater and surface water availability.Fundamentals of water quality and pollutants and their behaviour including, metals, organic contaminants, nutrients and algal blooms, pathogens and acidification (within the context of acid sulfate soils, mine drainage and ocean acidification) will also be addressed. Application of this knowledge will then be undertaken with case studies of contaminated systems, their assessment and remediation approaches.Finally the unit will cover the policy approaches used to manage water resources around the world including local and international examples of the development of water quality guidelines and frameworks. Current approaches used to balance the needs of ecological values and human water needs, will also be discussed with global and local examples.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ENS5330","eftsl":0.125}