{"preqs":"This is a specialist core unit for the Leadership for Sustainable Development specialisation and an elective unit within the other specialisations. There are no prerequisite units, but non-cognate students must complete Part B studies prior to undertaking Part C specialist studies.","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ENS5530%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)","Second semester 2017 (Evening)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Leading change for sustainable development","description":"Building the capacity for effective leadership for sustainable development, at an individual, team and organisational scale, is one critical factor in addressing contemporary sustainability challenges.This unit frames \u0027leadership\u0027 as a process of influence that delivers a shared vision, aligns resources towards that vision and generates commitment to collective success.  It recognises the importance of individual and group-based leadership to successful sustainable development outcomes, and focuses on those aspects of leadership that can be consciously developed, such as critical leadership skills and choosing appropriate strategies to match the context. The unit differs from traditional MBA-style leadership training in that it selects the theoretical frameworks/models, leadership roles, case studies and skill sets from the vast leadership literature that are most relevant to practitioners who seek to advance sustainable development.Starting with the concept of self-leadership, students will learn strategies and skills to develop their own leadership abilities as well as understand principles and practices for exerting influence and effecting change to support sustainable development.Students will also develop an individual leadership development plan, drawing on the concept of \u0027self-leadership\u0027, the principles and methods of leadership development and the types of knowledge, skills and networks typically needed for sustainable development leadership. This plan will set out developmental objectives and specific actions to improve leadership performance and capacity.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ENS5530","eftsl":0.125}