{"preqs":"ATS2780 or 18 points of Geography, Climate and physical environments or Atmospheric science or permission of the unit co-ordinator","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ATS3887, ESC3887, GES3370}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 3 (I/W) units in {ATM2020, ATM2030, ATM3040, ATM3050, ATS1301, ATS1310, ATS2545, ATS2547, ATS2774, ATS2776, ATS2779, ATS2780, ATS3259, ATS3283, ATS3558, ATS3787, ATS3788, ATS3791, ATS3902} or  Must have passed an (I/W) unit in {ATS2780})","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {APG4887, ATM3370, ATS3887}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"APG4887, ATM3370, ATS3887","scaBand":2,"unitName":"Designing urban futures: Urban climate, water and adaptation","description":"Urbanisation has profound influences on cities that causes local changes in climate including increased temperature (the Urban Heat Island). Additional impacts include reduced moisture, modified urban waterways, and reduced vegetation. Moreover,urbanisation is linked to hazards such as poor air quality and heat related illnesses. These matters are of particular concern in the context of climate change. This unit will provide an understanding of the relevant physical processes and impacts, along with the associated technological, and socio-political contexts and examine potential solutions by undertaking a sustainable cities approach including the concept of a water sensitive city as an approach to heat mitigation and climate change adaptation. Emphasis is placed on practical, theoretical, observational, analytical and modeling skills developed through lectures, practical\u0027s and project work.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ESC3887","eftsl":0.125}