{"preqs":"ATS2780 or 24 points in Geography, climate and physical environments or permission from unit coordinator","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {ATS2780} or  Must have passed 4 (I/W) units in {ATS1301, ATS1310, ATS2545, ATS2774, ATS2779, ATS2780, ATS3558, ATS3787, ATS3788, ATS3791, ATS3887} or  Must have passed 4 (I/W) units in {ATS1309, ATS1310, ATS2547, ATS2774, ATS2779, ATS2780, ATS3259, ATS3283, ATS3787, ATS3791, ATS3902} or  Must have passed 4 (I/W) units in {EAE1011, EAE1022, ESC1011, ESC1022, ESC2111, ESC2122, ESC3162, ESC3180, ESC3200, ESC3201, ESC3232, ESC3311, ESC3332, ESC3340, ESC3421, ESC3900})","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ATS3791, GES3550%, GES3555}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ATS3791}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"ATS3791","scaBand":2,"unitName":"Environmental change: Past to future","description":"This unit introduces a range of methods used to reconstruct past environments at different temporal scales over the past several hundred to thousands of years. These reconstructions provide baseline data to understand and infer the human contribution to several key environmental concerns, including climate change, biomass burning, biodiversity and vegetation dynamics, water availability and quality, and the management and restoration of natural, Indigenous and historical landscapes. Emphasis is placed on hands-on, technical experience to provide fundamental understanding of environmental issues of current relevance to Australia. The unit involves a required 2-3 day field excursion that may be held in O-week or early in the semester (the unit coordinator will advise students of specific dates in January or February).","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"ESC3791","eftsl":0.125}