{"preqs":"ETF5900","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {ETF5900}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with course version in {3822, B6001} with course status in {ENROLLED, INACTIVE, INTERMIT}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {ETF5922}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04, 05, 06, 07, 11, 12, 20, 21, 41, 42, 50, 55, 56, 65}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Summer semester B (starts January) 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"Students enrolled in the 3822 Master of Applied Econometrics or B6001 Master of Applied Economics and Econometrics.","scaBand":3,"unitName":"Data Visualisation and Analytics","description":"Business analytics can unlock the hidden insights in data to give businesses a competitive advantage. Many businesses have masses of data about customers and operations and need skilled analysts to uncover insights and make informed predictions.This unit uses data visualisation to explore and analyse data sets of all sizes, and it introduces some business analytic models for interpretation and prediction.It will introduce an appropriate software environment for data visualisation, and analytics, and cover visualisation and analysis techniques for categorical and numerical variables. Visualisation methods to be covered include some of Box-and-whisker plots, Mosaics, Rotatable 3D scatter plots, Heat maps, Motion charts, and cluster and association charts. Models to be covered include linear regression models, classification and regression trees and random forests. Methods for evaluating model performance will also be discussed. Examples from marketing, finance, economics and related disciplines will be included.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"ETF5922","eftsl":0.125}