{"preqs":"Completion of 24 points at level 1.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 24 (I/W) credit points from units owned by {50000566, 50000782, 50000783, 50000784, 50000793, 50000794, 50000802, 50137385, 50168343, 50168344}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {BUS3502, ETC2490, FIT2006}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]},{"location":"South Africa","time":["Second semester 2017 (Day)"]}],"enjoyScore":4,"learnScore":4.188888889,"learnResponse":11,"proh":"ETC2490, BUS3502, FIT2006","scaBand":2,"unitName":"Business information systems and processes","description":"Globalisation and increasing customer demands are challenges facing companies today. To remain competitive and effective in their offerings, companies cannot afford to harbour inefficiencies in their operations. A business process oriented approach is key to the success of modern organisations. A well-designed process will improve efficiency and deliver greater productivity. At the same time, business processes must be designed to ensure that they are effective and meet customer requirements. The internal processes of a business organisation are described with an emphasis on how they work together to achieve the goals of the organisation. A range of process modelling tools is presented in the unit.Upon completion of this unit students should be able to: describe business processes in organisations, their structure and they fit into the overall organisation objectives; recommend a process modelling tool for modelling and analysing business processes with the aim of increasing efficiencies and effectiveness for businesses; analyse factors for managing in-house development or software outsourcing; discuss ethical issues related to the management and use of business information systems.","enjoyResponse":11,"faculty":"Faculty of Information Technology","unitCode":"FIT2090","eftsl":0.125}