{"preqs":"One of MAT1841, MAT2003, ENG1091, MTH1030, MTH1035 or equivalent, plus any introductory programming unit (e.g. FIT1045, FIT1048, FIT1051, FIT1040, FIT1002, ECE2071, TRC2400, or equivalent)","creditPoints":6,"rules":[{"startDate":"1/01/2011","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {08, 09, 09-1, 09-4, 10, 13, 20, 21, 22, 30, 41, 50, 55, 65, 75, 77}","endDate":""},{"startDate":"1/01/2011","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 1 (I/W) units in {ENG1091, MAT1841, MAT2003, MTH1030, MTH1035} and  Must have passed 1 (I/W) units in {ECE2071, FIT1002, FIT1040, FIT1041, FIT1045, FIT1048, TRC2400} with grades other than {STANDARD-DEF, STANDARD-NS})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.4375,"learnScore":4.337962963,"learnResponse":23,"proh":"","scaBand":2,"unitName":"Computational science","description":"This unit provides an overview of computational science and an introduction to its central methods. It covers the role of computational tools and methods in 21st century science, emphasising modelling and simulation. It introduces a variety of models, providing contrasting studies on: continuous versus discrete models; analytical versus numerical models; deterministic versus stochastic models; and static versus dynamic models. Other topics include: Monte-Carlo methods; epistemology of simulations; visualisation; high-dimensional data analysis; optimisation; limitations of numerical methods; high-performance computing and data-intensive research.A general overview is provided for each main topic, followed by a detailed technical exploration of one or a few methods selected from the area. These are applied in tutorials and laboratories which also acquaint students with standard scientific computing software (e.g., Mathematica, Matlab, Maple, Sage). Applications are drawn from disciplines including Physics, Biology, Bioinformatics, Chemistry, Social Science.","enjoyResponse":23,"faculty":"Faculty of Information Technology","unitCode":"FIT3139","eftsl":0.125}