{"preqs":"(FIT2069, FIT2070 and one of FIT3141, ECE2041 or ECE3141) or (FIT1005/FIT2008 and FIT2022) or (FIT2100 and FIT3165)","creditPoints":6,"rules":[{"startDate":"1/01/2012","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"((Must have passed 2 (I/W) units in {FIT2069, FIT2070} AND  Must have passed 1 (I/W) units in {ECE2041, ECE3141, FIT3141}) OR  Must have passed 2 (I/W) units in {FIT1005, FIT2022} or  Must have passed 2 (I/W) units in {FIT2008, FIT2022} or  Must have passed 2 (I/W) units in {FIT2100, FIT3165} with grades other than {STANDARD-DEF, STANDARD-NS})","endDate":""},{"startDate":"1/01/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {08, 09, 09-1, 09-4, 10, 13, 20, 21, 22, 30, 41, 50, 55, 65, 75, 77}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.083333333,"learnScore":3.663425926,"learnResponse":17,"proh":"","scaBand":2,"unitName":"Distributed computing","description":"Modern computer systems rely increasingly on distributed computing mechanisms, implemented often as clusters, web services, grids and clouds. Distributed computing systems can provide seamless (or web-like) access to a variety of networked resources, e.g. processing cores, large data stores and information repositories, expensive instruments, high-speed links, sensor networks, and multimedia services for a wide range of applications. This unit provides foundation knowledge and understanding of the basic mechanisms required to implement distributed computing systems, especially clouds, grids, web services and clusters. Topics covered include: Introduction to parallel and distributed computing mechanisms, concurrency and synchronisation, monitors, deadlocks, concurrent program analysis, computational and service-oriented grids, clusters and clouds. Distributed applications, and their performance and reliability in relation to processor and network performance constraints.","enjoyResponse":17,"faculty":"Faculty of Information Technology","unitCode":"FIT3142","eftsl":0.125}