{"preqs":"Foundation knowledge in computer science or business information systems or information technology and systems fundamentals.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {1608, 1895, 2398, 2399, 2400, 2401, 2402, 2406, 2876, 3309, 3316, 3318, 3324, 3325, 3327, 3328, 3335, 3336, 3341, 3342, 3343, 3348, 3349, 4308}","endDate":""},{"startDate":"9/10/2007","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {BUS5000, CSE4650, CSE4910, FIT5125, FIT5143, FIT5185, FIT5190, GCO4010, IMS4036, IMS5036, ITW4001}","endDate":"31/12/2015"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {BUS5000, CSE4650, CSE4910, FIT2083, FIT2084, FIT5125, FIT5143, FIT5185, FIT5190, GCO4010, IMS4036, IMS5036, ITW4001}","endDate":""},{"startDate":"9/10/2007","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {1608, 1895, 2398, 2399, 2400, 2401, 2402, 2406, 2876, 3309, 3316, 3318, 3324, 3325, 3327, 3328, 3335, 3336, 3341, 3342, 3343, 3348, 3349, 4308}","endDate":"31/12/2015"}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]},{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"South Africa","time":["First semester 2017 (Day)"]}],"enjoyScore":3.5,"learnScore":3.833333333,"learnResponse":2,"proh":"ITW4001, IMS5036, IMS4036, BUS5000, CSE4910, GCO4010, CSE4650, FIT2083*, FIT2084 FIT5125, FIT5143, FIT5185, FIT5190* BCS Honours students who have completed FIT2083 are exempt from completing FIT4005 as part of their Honours study but must select an alternative unit with the approval of their course director. However, FIT4005 remains the preferred research methods unit option for BCS Honours students.","scaBand":2,"unitName":"Research methods in information technology","description":"This unit exposes students to research across the range of IT disciplines, preparing them to conduct research in their home discipline. It provides broad coverage of the issues, concepts, methods and techniques associated with Computer Science, Software Engineering, Information Systems and Information Management. It introduces students to major research philosophies and paradigms, the principles of research design, research ethics, and research methods and techniques of data collection and analysis appropriate to IT research generally and to their sub-discipline specifically. It covers oral and written communication skills.Skills developed and knowledge acquired from this unit will prepare students to conduct and communicate their own research, as well as to be knowledgeable and critical interpreters of others\u0027 research.","enjoyResponse":2,"faculty":"Faculty of Information Technology","unitCode":"FIT4005","eftsl":0.125}