{"preqs":"Students must be enrolled in an FIT Masters degree or Research degree and have successfully completed 24 points of level five non-foundation units and achieved an overall average of at least 75% across all non-foundation units. Foundation units are (FIT9123 or FIT5123), (FIT9130 or FIT5130), (FIT9131 or FIT5131), (FIT9132 or FIT5132), (FIT9134 or FIT5134) and (FIT9135 or FIT5135).Foundation knowledge in computer science or business information systems or information technology and systems fundamentals.","creditPoints":6,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Permission required","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {FIT4005, FIT5143, FIT5185, FIT5190}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {01, 02, 03, 04, 05, 12, 50PG, 61, 76, 78}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)","First semester 2017 (Online)","Second semester 2017 (Day)","Second semester 2017 (Online)","Winter semester 2017 (Flexible)"]},{"location":"Malaysia","time":["First semester 2017 (Evening)","Second semester 2017 (Evening)"]}],"enjoyScore":4.125,"learnScore":4.263888889,"learnResponse":5,"proh":"FIT4005, FIT5143, FIT5185, FIT5190","scaBand":2,"unitName":"IT research methods","description":"The aim of this unit is to prepare Masters students in the Faculty of Information Technology to conduct research across the range of IT disciplines, including computer science, software engineering, information systems and information management.It introduces students to major research philosophies and paradigms, the principles of research design, research ethics, research methods and techniques of data collection and analysis appropriate to IT research and their disciplines, and IT research in research and industry settings.Skills developed and knowledge acquired from this unit will prepare students to conduct and communicate their own research, as well as to be knowledgeable and critical interpreters of others\u0027 research.","enjoyResponse":5,"faculty":"Faculty of Information Technology","unitCode":"FIT5125","eftsl":0.125}