{"preqs":"FNA3111","creditPoints":12,"rules":[{"startDate":"29/07/2011","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {FNA3111} and  Must have enrolled in an (I/W) unit in {OHS1000})","endDate":""},{"startDate":"29/07/2011","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {CER3116, GLS3216, JWL3316, PRM3416, PTG3516, SCU3616}","endDate":""},{"startDate":"29/07/2011","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {2119, F20031}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.285714286,"learnScore":4.073611111,"learnResponse":13,"proh":"Any FNA, VIS or VPR level 3 unit","scaBand":1,"unitName":"Contemporary Practices 6","description":"This unit is the last and culminating unit in the Contemporary Practices sequence. In this unit emphasis is placed on independent investigation, and the development of the creative and expressive potential inherent in students\u0027 work. Imagination combined with advanced conceptualisation and innovation in material manipulation should be manifest at this stage of students\u0027 practice. Students develop individual programs in conjunction with the lecturers that reflect their personal direction and evolving art practice. The program focuses on clear articulation of concepts. Lecturers facilitate students\u0027 own exploration, primarily through personal tuition where detailed analysis and discussion of students\u0027 work takes place. Whilst providing a stimulating and supportive environment this unit provides a bridge between students\u0027 experience in the supervised studio and a fully-fledged independent professional practice in the broader arts arena. The work produced culminates in an end of year exhibition of a professional standard, preparing students for entry into the professional world as fine artists in the discipline of choice, or the pursuit of further studies at a higher level.","enjoyResponse":13,"faculty":"Faculty of Art, Design and Architecture","unitCode":"FNA3112","eftsl":0.25}