{"preqs":"GEN2041 or BMS2042 or MCB2011 or MOL2011","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {BMS2042, GEN2041, MCB2011, MOL2011}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {BMS2%, BTH2%, GEN2%, MOL2%}","endDate":"31/12/2014"}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"Malaysia","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.961538462,"learnScore":4.336279461,"learnResponse":25,"proh":"","scaBand":2,"unitName":"Genomics and its applications","description":"Recent technological advances in DNA analysis now allow the rapid and relatively cheap sequencing of entire genomes of individual organisms. These developments have the potential to revolutionize how we identify genes that control both simple and complex traits. Bioinformatic analysis of genomic data will also be highly influential in shaping our view of how organisms adapt to changes in their environment and how over a longer time-scale, traits such as body size and pattern and physiological and behavioral responses can evolve, leading to the rich diversity of life forms seen today. This unit will explore the use of whole-genome techniques to examine gene regulation, identify the genes controlling both simple and complex traits, determine how individuals and populations adapt to selective pressure and piece together the evolutionary changes that have given rise to complex multicellular life. Such information will increasingly be important in the 21st century for sustainable development of human civilization in concert with a healthy planetary environment. Students will acquire relevant laboratory and computer-based skills including genetic database analysis and bioinformatics, forward genetic approaches and mapping and identification of genes controlling complex quantitative traits.","enjoyResponse":24,"faculty":"Faculty of Science","unitCode":"GEN3040","eftsl":0.125}