{"preqs":"IMM2011* or BMS2052* Note that only IMM2011 taken from 2012 onwards can be counted as a prerequisite unit - any previous versions have overlapping content and are prohibitions.","creditPoints":6,"rules":[{"startDate":"1/01/2012","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {IMM2011.[1-2]}","endDate":""},{"startDate":"1/01/2012","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {BMS2052, IMM2011.3}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.327586207,"learnScore":4.207847708,"learnResponse":58,"proh":"IMM2011 if taken prior to 2012","scaBand":3,"unitName":"Immunology in health and disease","description":"The immune system has a central role in many aspects of health and disease in both humans and animals. While the immune system is critical for protecting us from pathogens, it also has an important role in cancer surveillance and is the reason why tissue transplantation is difficult to achieve. Many debilitating conditions such as allergy and autoimmune diseases including type 1 diabetes and multiple sclerosis are caused by the immune system. This unit progresses from IMM2011 which focused on the development and structure of the immune system and immune response to now examine the broad role of the immune system in a range of disease and health states. By selecting a range of real life examples, we can not only examine the nature of how the immune system is active but also broaden our understanding of social and ethical implications and the role that medical research has towards improving outcomes. This unit will give students the opportunity to learn how immunology is important in many aspects of our society while developing and reinforcing a range of academic skills through defined teaching and assessment tasks.","enjoyResponse":66,"faculty":"Faculty of Science","unitCode":"IMM2022","eftsl":0.125}