{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111For students who commenced their LLB course prior to 2015:LAW1100 OR LAW1101 and LAW1102 or LAW1104","creditPoints":6,"rules":[{"startDate":"10/05/2012","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {LAW1102, LAW1104} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"10/05/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise For COURSE_CODE IN {L3%} Do Any 2 co-req units in {LAW3111, LAW3112} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.083333333,"learnScore":4.166666667,"learnResponse":4,"proh":"None","scaBand":3,"unitName":"Public policy, regulation and the law","description":"This Unit explores the interrelationship between public policy, regulation and the law.  The Unit begins by introducing students to the policy cycle - the process by which issues (or problems) are identified and prioritised for action by government, and the action to be taken to address the issue (solve the problem) is agreed. In doing so, the Unit will expose students to some of the challenges facing governments and regulators when deciding whether and how to address a particular issue. The Unit also will introduce students to the breadth of tools available to governments to achieve their policy ends. In doing so, the Unit will explore how the concept of \u0027regulation\u0027 has expanded beyond the traditional legal concept of regulation as rules promulgated by a sovereign state, to include all the tools used by governments and other actors to alter or control the behaviour of people and other entities. The Unit will then explore some the theories, concepts and constructs that explain regulatory practice in a modern liberal capitalist society, before moving on to consider what may constitute \u0027good\u0027 regulation and regulatory practice. Finally, the Unit will explore how the law intersects with, supports and shapes public policy and the regulatory endeavour. Rather than focus on one substantive area of regulation, several case studies will be used to illustrate and highlight the general themes of the Unit. Moreover, the Unit will include aspects of politics, economics, public administration and public policy in its consideration of the issues, further developing students\u0027 skills in understanding and applying the law in its societal context.","enjoyResponse":13,"faculty":"Faculty of Law","unitCode":"LAW4537","eftsl":0.125}