{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2111; LAW2112For students who commenced their LLB course prior to 2015:LAW1100 OR LAW1101 and LAW1102 or LAW1104;LAW2100 or LAW2101 and LAW2102;LAW2200 or LAW2201 and LAW2202;LAW3300 or LAW3301 and LAW3302Further, one of the following is required:+ participation in a prior placement at FLAP as a part of a Monash family law unit, or+ a minimum of 12 weeks volunteering on a one day a week basis at FLAP, or+ completion of Professional Practice LAW5216 or LAW4328.Please see http://www.law.monash.edu.au/cle.html for an application form and more information.","creditPoints":12,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW5218}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1100, LAW1102, LAW1104, LAW4328, LAW5216} or  Must have passed 7 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112, LAW4328})","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise For COURSE_CODE IN {L3%} Do Any 2 co-req units in {LAW3111, LAW3112} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Summer semester A (starts November) 2017 to First semester 2018 (Day)","Trimester 2 2017 (Day)","Trimester 3 2017 (Day)"]}],"enjoyScore":5,"learnScore":3.875453885,"learnResponse":109,"proh":"","scaBand":3,"unitName":"Family law assistance program: Professional practice","description":"Students undertake a practical placement in a specialist family law program based at a community legal centre which endeavours to meet the legal needs of its community. Under supervision by qualified solicitors, students provide legal advice to clients, undertake ongoing casework, brief Counsel, and in appropriate cases, represent clients in Court and attend Court to instruct Counsel in hearings. Students also attend the duty lawyer service at the Dandenong Family Court each Monday to assist and advise unrepresented litigants. Students acquire a diverse range of practical legal skills including: the capacity to undertake legal research and apply legal research to factual scenarios; the ability to synthesise professional, technical and ethical knowledge acquired in the law degree and apply it in a practical legal context; skills in critical thinking and legal judgment; the capacity to independently devise legal solutions for complex legal problems; and the capacity to identify and respond to ethical, moral and professional dilemmas in legal practice. Students also develop an appreciation of social justice issues and have a heightened awareness of the operation of the justice system, law reform and policy issues.  The skills learnt in this unit will be useful for students who wish to practice law (especially family law), along with students interested in policy, government and social justice career pathways.","enjoyResponse":4,"faculty":"Faculty of Law","unitCode":"LAW4330","eftsl":0.25}