{"preqs":"(a) For students who commenced their LLB course prior to 2015:+ LAW1101 Introduction to legal reasoning+ LAW1104 Research and writing(b) For students enrolled in the LLB (Honours) course from 2015:+ LAW1111 Foundations of law+ LAW1112 Public law and statutory interpretation+ LAW1113 Torts+ LAW1114 Criminal law 1+ LAW2101 Contract A+ LAW2102 Contract B+ LAW2111 Constitutional law+ LAW2112 Property A(c) For other students:Equivalent introductory units from another university","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any passed co-req (I/W) unit in {LAW3111, LAW3112}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"(Must be enrolled in course owned by {50000567} and Any 2 co-req units in {LAW3111, LAW3112})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1101, LAW1104} OR  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Private investment law","description":"This unit discusses the nature and operation of private investment law in Australia. It examines how Australia\u0027s legal and taxation systems deal with venture capital and private equity investment. It also examines how the venture capital and private equity industries operate in Australia and in various jurisdictions around the world and how private investments funds are structured. It focuses on the taxation treatment that applies to such investment and discusses relevant capital raising and other regulatory matters, including crowd source funding. It also examines international aspects of private investment law and compares Australia\u0027s regulatory and tax rules to those of selected foreign jurisdictions. A range of government tax and other incentives that encourage investors to commit capital to innovative start-up companies are also analysed, along with some incentives that reward these high-growth companies undertake innovative activities such as research and development (R\u0026D). Australia\u0027s superannuation system is also considered, with a particular focus on its relationship and interaction with private investment law.The following topics will be covered in the unit: An introduction to the operation and nature of private investment law and how the tax system deals with private investments; The role of start-up companies and venture capital investment in a country\u0027s innovation system; Stages of venture capital and private equity investment (i.e., seed, start-up, early expansion, growth, mezzanine, distressed buyouts, etc); Making and exiting investments in start-up and early stage companies (including IPOs, trade sales, management buyouts, leveraged buyouts and share buybacks); The structure and operation of venture capital, private equity, fund of funds and other collective investment vehicles and their treatment under the taxation law; Capital raising issues confronting high-growth start-ups, including crowd funding issues; The role of Australia\u0027s employee share scheme regime in supporting innovative start-ups; Government programs aimed at encouraging venture capital and private equity investment in Australia, including the Pooled Development Funds, Venture Capital Limited Partnership, Early Stage Venture Capital Limited Partnership and Innovation Investment Fund programs; Australia\u0027s R\u0026D Tax Incentive program and R\u0026D and commercialisation grant programs; International programs aimed at stimulating venture capital and private equity investment, and a comparison of these programs with those operating in Australia; and The operation of Australia\u0027s superannuation system and its relationship with venture capital and private equity investment.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4671","eftsl":0.125}