{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW4532E}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Climate change and international law","description":"Climate change has been described as the defining legal and policy challenge of the 21st century. This unit provides an introduction to the international legal response to this challenge. It examines critically the emergence of climate change as a public policy problem, the relationship between climate science and climate policy, and the negotiation, content and implementation of international legal instruments related to climate change. It will not consider national, sub national or non-governmental approaches to climate change. Topics to be addressed include: the causes and impacts of, and trends in, global climate change; the problem of scientific uncertainty and its implications for international climate change law; the main options for and obstacles to mitigation of and adaptation to climate change, and the relationship between mitigation and adaptation; the international politics of climate change, including the differing positions, interests and priorities of developed and developing states and the special challenges facing particularly vulnerable states and communities; the negotiation, content and implementation of the United Nations Framework Convention on Climate Change and the Kyoto Protocol, including Joint Implementation, the Clean Development Mechanism, international emissions trading, financial assistance and technology transfer; key issues and developments in the negotiation and implementation of a post-Kyoto international climate change agreement; the role and meaning of the concepts of state sovereignty, common concern of humankind, sustainable development, common but differentiated responsibilities, intra- and inter-generational equity, the precautionary principle, and climate justice in the international climate change legal regime; key issues, options, proposals and rules surrounding the incorporation of land use and forestry into the international climate change regime, including Reduced Emissions from Deforestation and forest Degradation (REDD); compliance, enforcement and dispute settlement in the international climate change regime; interactions between the international climate change regime and international regimes related to ozone depletion, biodiversity, law of the sea, human rights, and international trade; and options and prospects for a transition to a carbon-free or low-carbon future.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4532","eftsl":0.125}