{"preqs":"LAW1102 and LAW1104This unit is subject to a quota.  Further information is available from the Law Faculty.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW1104}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Mooting and advocacy competition","description":"Admission to this unit is by competitive application. The unit will be capped depending on the number of competitions offered from year to year. Criteria for selection will include course progression, marks in completed units, experience or skill in mooting, debating or other advocacy (assessed through an oral advocacy exercise).Students will be allocated to teams for various external mooting competitions in which they will represent Monash University. These will vary from year to year, but may include:Michael Kirby Contract MootShine Torts MootGibbs Constitutional Law MootAdministrative Appeals Tribunal MootNational Women\u0027s MootCastan Centre Human Rights MootNational Environmental MootNational Family Law MootOxford Intellectual Property MootWorld Human Rights MootInternational Humanitarian Law MootSeminars are provided on advocacy techniques, research techniques and the drafting of court documents. Students will then work as a team on the problem relevant to their assigned competition, including researching the problem, preparing written submissions and formulating oral arguments. Attendance at scheduled sessions is compulsory.Where permitted by the rules of the respective competitions, students will be invited to critique the practice performances of their peers in other competitions. Regular practice moots will also be held for each team, overseen by academics and external guest judges with expertise in the relevant field.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4805","eftsl":0.125}