{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111; LAW3112 and LAW4122For students who commenced their LLB course prior to 2015: LAW1100 OR LAW1101; LAW1102 or LAW1104; LAW4122","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1102, LAW1104, LAW4122} or  Must have passed 8 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112, LAW3112, LAW4122})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Summer semester A (starts November) 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Jessup moot competition","description":"The Phillip C. Jessup International Law Moot Court Competition is conducted each year and runs over the summer semester. Five students will be invited to participate and will be selected each year from those students who have successfully completed the Jessup Moot Seminar unit. The team of five students will work closely in a team to prepare detailed and lengthy written submissions and represent fictional States in a topical hypothetical case before the International Court of Justice. Written memorials are submitted in mid-January each year. The team will then moot against teams from other Australian Universities. The Australian Regional Rounds are usually held in Canberra in the first week of February. The two finalist teams from the Australian Regional Rounds then travel to Washington DC to compete in the International Rounds against teams from around the world.Students participating in the Jessup International Law Moot Court Competition will, inter alia: acquire and develop proficiency in oral advocacy, legal research and legal writing skills in the highly demanding, yet exciting global context of public international law develop and broaden their knowledge and expertise in public law and international dispute resolution before the International Court of Justice experience the concept of through preparation of a particular case on public international law and the opportunity to match their preparation with that of equally prepared students in a national and possibly international competition setting.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4806","eftsl":0.125}