{"preqs":"For students who commenced their LLB course prior to 2015:LAW1101 Introduction to legal reasoning and LAW1104 Research and writingFor students enrolled in the LLB (Honours) course from 2015:LAW1111 Foundations of law, LAW1112 Public law and statutory interpretation, LAW1113 Torts, LAW1114 Criminal law 1, LAW2101 Contract A, LAW2102 Contract B, LAW2111 Constitutional law and LAW2112 Property AFor other students:Equivalent introductory units from another university","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1101, LAW1104} OR  Must have passed 8 (I/W) units in {LAW1111, LAW1112, LAW1113, LAW1114, LAW2101, LAW2102, LAW2111, LAW2112})","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"European and international monetary law","description":"This unit will introduce students to European and International Monetary Law. It is divided into three substantive sections: interdisciplinary introduction to money and currencies; international monetary law; and European monetary law.In the first section, we will explain and discuss the interdisciplinary fundamentals of money and currencies, including the historical background, economic theories and the role of monetary law. The second section will introduce international monetary law, focusing on the work and functions of the International Monetary Fund (IMF), which has played a major role in addressing global financial and sovereign debt crises over the past decades. This section will also introduce and explain the underlying fundamental problems resulting from cross border payment and capital flows, including: convertibility, exchange-rate systems, free movement of capital and international liquidity. The third section will focus on European monetary law, covering the monetary integration process in Europe, and a thorough examination of the constitution and structure of the European Monetary Union (EMU). The unit will conclude with an analysis and critical assessment of the much-debated recent developments within the EMU set in motion by the European sovereign debt crisis, including the implications for countries such as Greece and Germany.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4673","eftsl":0.125}