{"preqs":"LAW1100 OR LAW1101 and LAW1102 or LAW1104; LAW3200 or LAW3201","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE NOT IN {3357} Do (Must have passed an (I/W) unit in {LAW1100, LAW1102, LAW1104} AND  (Must have passed an (I/W) unit in {LAW3200, LAW3201} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})) Otherwise true","endDate":""},{"startDate":"16/08/2000","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE NOT IN {3357} Do (Must have passed an (I/W) unit in {LAW1100, LAW1102, LAW1104} AND  Must have passed an (I/W) unit in {LAW3200, LAW3201}) Otherwise true","endDate":"31/12/2014"},{"startDate":"16/08/2000","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":"31/12/2014"}],"locationAndTime":[{"location":"Malaysia","time":["Term 3 2017 (Day)"]}],"enjoyScore":4.3,"learnScore":3.74269636,"learnResponse":113,"proh":"","scaBand":3,"unitName":"Comparative constitutions and rights","description":"The unit will cover a series of topics arising in the comparative study of constitutional systems, mostly in the western-liberal tradition. Comparative constitutional law is a rapidly expanding and maturing field, embedded in a context of global spread of democratic models in the last half-century and the expansion of international human rights. The variety of constitutional models prevailing today will be examined and critiqued (among them the French system), including the structure of government (how countries are governed and political power is organised) and frameworks of human rights protection (how constitutions in democratic countries contribute to the effective protection of human rights).Special attention will be devoted to issues such as: Constitutional stability and change in democratic regimes: aims, means, consequences of constitutional stability; constitutional customs, even contra legem; breach or disputable use of constitutional rules; means, usefulness and dangers of constitutional reviews; the \"constitutional clean slate\" (the choice of a democratically elected Constituent Assembly to produce an entirely new text). Constitutions and religions: the place of religion in constitutional texts; the weight of religion in constitutional development as well as in constitutional and statutory interpretation. Constitutions and minorities: reconciling majority and minority rights Constitutions as a social/political project: Constitutions as guidelines for future public policy and development of human rights.","enjoyResponse":8,"faculty":"Faculty of Law","unitCode":"LAW4165","eftsl":0.125}