{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111For students who commenced their LLB course prior to 2015:Pre-requisites: LAW1101 Introduction to legal reasoning and LAW1104 Research and Writing","creditPoints":6,"rules":[{"startDate":"10/05/2012","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {LAW1102, LAW1104} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"10/05/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"None","scaBand":3,"unitName":"Introduction to transitional justice","description":"The term \u0027transitional justice\u0027 refers to the various judicial and non-judicial measures that may be implemented in order to redress a legacy of human rights abuse. Such measures include criminal prosecutions, truth commissions, reparations and different forms of institutional reform. This unit will begin by providing an overview of transitional justice; it will consider the meaning of the term \"transitional justice\" and provide a framework through which the concept may be understood. The unit will then engage in a more detailed discussion of the actual transitional justice mechanisms before moving on to consider a number of case studies in order to ground students\u0027 understanding of the subject matter in concrete examples. In addition to exploring the transitional justice programs implemented in different countries, the unit will also engage in a comparative analysis of the various case studies and will examine a number of cross-cutting themes, such as gender and transitional justice.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4242","eftsl":0.125}