{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW4539E}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Modern constitutionalism: A comparative perspective","description":"In the beginning of the 21st century, it seems that the age of parliamentary democracy had passed and that the concept of constitutional democracy had swept the world. Yet, closer study reveals that the picture is not uniform. First, substantively different versions of the constitutional model may be identified. Second, it is already possible to see the first signs of a shift to a stage of synthesis in which a new constitutional model is being generated which integrates the principle of the supremacy of the legislature with that of the supremacy of the judiciary.This course will concentrate on presenting various constitutional models and examining their advantages and disadvantages. The course will be divided into three parts. In the first part we shall describe the \u0027traditional constitutional model\u0027 and its underlying rationale. In addition, we shall distinguish between various versions of this model and illustrate them by describing and comparing the constitutional mechanism in a number of countries (United States, Germany, France and Italy). In the second part, we shall examine several arguments against the traditional constitutional model and various proposals made to resolve those argument. In the third part, we shall describe the \u0027synthesized model\u0027, explain its rationale and illustrate it by describing the constitutional mechanism in a number of countries which have apparently adopted it (Canada, New Zealand and Great Britain).","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4539","eftsl":0.125}