{"preqs":"LAW1101 and LAW1104 (or equivalent from another institution)","creditPoints":6,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW1104}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Current issues in statutory interpretation","description":"The first half of the unit will consist of an in-depth consideration of the main theories of statutory interpretation:  intentionalism, textualism and purposivism.  With regard to intentionalism, the focus will not only be on the standard arguments for and against intentionalism, but also on the deeper theoretical commitments of intentionalism.  For example, intentionalism presupposes that there is a defensible notion of legislative intent.  Students will consider not only classic (aggregative) theories of legislative intent, and the criticisms of those theories, but also contemporary (largely non-aggregative) theories.  Students will also consider the current scepticism among judges on the High Court of Australia towards the concept of legislative intent.  Similarly, with regard to textualism, consideration will be given not only to the standard arguments for and against textualism, but also to different versions of textualism based on different accounts of the meaning of a legal text.  Consideration will also be given to Andrei Marmor\u0027s recent argument that, while textualism provides an accurate account of the meaning of statutory texts, few appellate court cases involving statutory interpretation turn on a correct understanding of the meaning of the relevant statutory text.The second half of the unit will turn from theory to practice, with an in-depth consideration of the High Court of Australia\u0027s current approach to statutory interpretation and some criticisms of that approach.  Students will consider the role that constitutional principles governing the distinction between judicial and legislative power affect the way in which judges interpret statutes, the general approach that judges take to statutory interpretation and the account of the linguistic content of statutes implicitly accepted by the High Court.  Consideration will also be given to the role that the principle of legality plays in the interpretation of statutes, and cases where the legal effect of a statute may differ from its linguistic content (where, for example, that linguistic content is ambiguous or where there is a need for equitable interpretation).  Critical attention will focus on the High Court\u0027s understanding of the difference between legislative and judicial power, and its understanding of the relationship between the linguistic content of a statute and the legal effect of that statute.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4247","eftsl":0.125}