{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111; LAW3401; LAW4169 and LAW3112For students who commenced their LLB course prior to 2015:LAW1100 OR LAW1101; LAW1102 or LAW1104; LAW3401; LAW4169 and LAW3112","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 4 (I/W) units in {LAW2101, LAW2112, LAW3111, LAW3112, LAW3401, LAW4169, LAW4171} or  Must have passed 8 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112, LAW3111, LAW3112})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {LAW5142}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"none","scaBand":3,"unitName":"Corporate insolvency","description":"This unit is essentially concerned with an exploration of the legal consequences of a corporation becoming insolvent. This includes an understanding of the formal process and consequences of liquidation; an analysis of the impact of liquidation on a corporation\u0027s property rights; consideration of the property that is available to creditors and the treatment of claims in a liquidation; an examination of the alternatives to liquidation, particularly the formal alternatives offered under the Corporations Act 2001 (Cth); and a consideration of the impact of an \u0027overseas\u0027 element in both liquidation and its alternatives.Topics covered include: an assessment of the nature, objectives and features of corporate insolvency law an outline of the proceedings that lead to liquidation an examination of the meaning of \u0027insolvency\u0027 and its associated problems of proof the impact of liquidation on a corporation\u0027s contractual and property rights, including the operation of the law to determine which property is made available to unsecured creditors in the event of liquidation. This requires an examination of the meaning of \u0027property\u0027 in this context and the scheme of the legislation in determining which property is to be made available to creditors. Of particular interest here are the \u0027clawback\u0027 provisions which allow recover of property disposed of prior to liquidation the claims which are recognised in the event of liquidation, the principle of distribution and the position of secured creditors the process of deregistration of an insolvent corporation the alternatives to liquidation, particularly the formal alternatives available under the Corporations Act the implications of an \u0027overseas element\u0027 in a liquidation and its alternatives are examined, including the operation of the Cross Border Insolvency Act 2008 (Cth).","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4333","eftsl":0.125}