{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW4534E}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Law and biology","description":"Rules aim to create order in our society. They provide structure so people know how to behave and what to expect from others. Rules are devised by people. Biologically, people are creatures that live in groups and need groups. Rules are needed to maintain group stability. Law, therefore, is in essence a biological phenomenon that can, and indeed should, be studied in the light of biological theories. In addition, because modern biology cannot be comprehended without evolutionary processes, evolutionary biology is one of the perspectives that can increase our understanding of the principles of law. To be sure, we should be careful in applying biological mechanisms to legal subjects, yet we may more fully grasp the nature of law by bringing the two disciplines together.It is currently also difficult to use evolutionary biology to determine which legal incentives should be used to regulate behaviour, not least because we do not exactly know to what end we should regulate behaviour. However, these caveats do not imply that law cannot be seen as a kind of extended phenotype that can be studied by biologists.  With the right genes, an organism can build a shelter, thereby improving not only its survival chances but also the replication chances of its genes. It is reasonable to assume that people have the right genes to build a law system that maximises their survival chances.However, will this confuse the is with the ought? In philosophy, it is taboo to derive norms from facts. In the context of law and biology, however, this seems odd as connecting these disciplines is very much about linking the ought and the is. Where biology can give us credible foundations for law, there necessarily has to be a connection between is and ought. Moreover, we should ask ourselves whether there even is a substantial difference between the two notions. Could we not regard the ought as a particular type of is?From this point of view, morals and rules are a product of our brain, as are all interpretations of facts. The brain in its turn is also a product of genes and environment.When law is studied from a biological perspective, then questions should be asked about the rationality of law. How can a judge take a strictly rational decision when our thinking is closely linked with emotion and feelings? Can the gap between legal professionals and ordinary citizens be partly explained because jurists do not ask themselves whether lawfulness includes a sense of justice?In this course we will study biological and psychological backgrounds of the law. This may not always be easy, because several of our certainties may prove to be illusory or ill-founded. Asking questions about the biological foundations of law involves questioning our own identity. In that sense, science is ruthless;  dogmas must and will be questioned.Can biology and psychology give all the answers? Certainly not. Nevertheless, it is important to think implications over. As Mill said: Maybe the opinion is true, or maybe is contains a portion of truth an even there is no truth in it at all, then it still sharpens our own conviction.In this course we will explore some biological and psychological facts and we will ask ourselves questions like: Can biology usefully contribute to moral argument? Can it contribute to an understanding of the proper role and functioning of legal norms?The lecturer published articles in which he states that the ought can be derived from the biological is. Nevertheless, he explicitly challenges his students to falsify this statement. In this way students can explore the issues and form their own views.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4534","eftsl":0.125}