{"preqs":"LAW1101 and LAW1104 or other equivalent introduction to law courses offered at another University.","creditPoints":6,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW1104}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Environmental activism, ecoterrorism and the law","description":"This subject is designed to provide both a comprehensive and critical introduction to global ecoterrorism.  The subject introduces students to the broad political challenges raised by the global environmental crisis both in the developed and developing world. The general historical evolution of international environmental law and policy will also be analysed.  Attention will be given to the major environmental, economic and political tensions that have both shaped and constrained the evolution of \u0027ecoterrorist\u0027 groups.The subject will in particular focus on the key individuals and major \u0027ecoterrorist\u0027 groups that have grown up as disillusion with the pace of environmental change within global society has increased. The subject will critically analyse the key groups often categorised as ecoterrorist including Earth First!, the Earth Liberation Front, the Animal Liberation Front and the Sea Shepherd Conservation Society.  It will focus on their founders, historical development, key philosophical beliefs and practices.  Students will be encouraged to draw on theoretical debates to identify the ways in which modern ecoterrorism has tested and/or reinforced the traditional assumptions, ideologies, arguments and institutions of international environmental law and policy.Students will be challenged to develop and refine their ability to analyse critically the different ways in which environmental problems and risks are perceived, framed and managed by differently situated actors within an ecoterrorist context.  The subject  cover the international and domestic legal responses to ecoterrorism. The subject also contextualises the major legal developments by examining the key state and nonstate actors and institutions involved in the negotiation, settlement and enforcement of law relating to ecoterrorist activities.  Finally, the evolving nature of international ecoterrorism law and policy, including problems and prospects for the future, will be critically examined.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4249","eftsl":0.125}