{"preqs":"For students who commenced their LLB course prior to 2015:LAW1101 Introduction to legal reasoningLAW1104 Research and writingFor students enrolled in the LLB (Honours) course from 2015:LAW1111 Foundations of lawLAW1112 Public law and statutory interpretationLAW1113 TortsLAW1114 Criminal law 1LAW2101 Contract ALAW2102 Contract BLAW2111 Constitutional lawLAW2112 Property AFor other students:Equivalent introductory units from another university","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise For COURSE_CODE IN {L3%} Do Any 2 co-req units in {LAW3111, LAW3112} Otherwise true","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {LAW1100, LAW1102, LAW1104} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"None","scaBand":3,"unitName":"The global lawyer","description":"The Global Lawyer focuses on international and transnational practice. It takes students beyond the traditional Australian and common law concentration. Students will be introduced to legal systems from other countries, explore strategies for international research, and develop skills necessary to practice in different cultures and systems, and to interact with clients and lawyers from other jurisdictions.This unit aims to introduce students to the increasingly important implications of practicing global law, and understanding the impact of digital technologies in legal practice, and in the lawyer\u0027s own professional identity, including the impact of social media. It seeks to make students aware of the opportunities in international practice as the role of traditional lawyering is broadened, as well as the responsibilities of being a global, digital lawyer.Students will start by exploring the origin of transnational practice, highlighting the importance of today\u0027s lawyer engaging in global practice. Students will then be introduced to the ethical concerns and responsibilities involved in being an international lawyer, before moving onto an overview of the domestic legal systems of important players in the international legal arena. A discussion of the impact of global legal practice on minorities within the legal community will encourage students to think of the larger socio-economic implications of cross-border practice. International management and firm operation will be dealt with as students are challenged with the problem of how to maintain local identity while providing international service.Students who have engaged in global lawyering experiences as a part of Monash\u0027s extensive global internship opportunities will be encouraged to give short presentations on their experiences.Students will critically engage with Richard Susskind\u0027s technological vision of legal practice, and explore the role of digital tools in the practice of law. Issues such as the changing use of digital technology, modern understandings of privacy and control over information, copyright and ownership of data, and issues of data retention, data security, legal informatics and legal professional ethics will be considered.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4250","eftsl":0.125}