{"preqs":"LAW1101LAW1104","creditPoints":6,"rules":[{"startDate":"10/05/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"None","scaBand":3,"unitName":"Lawyers, literature and cinema","description":"The representation of Law and lawyers within popular culture is one of the most important, but underappreciated, dimensions of the legal profession, of practice, and of the practical negotiation of legal ethics. The \u0027social status\u0027 of the lawyer within the wider culture is one of the dominant factors governing the student\u0027s decision to enter (or not to enter) law school. Furthermore, the dissemination of judicial procedure and dispute resolution through popular culture and the mass media is one of the primary means of both enforcing and challenging the legitimacy of Law and its practitioners within the broader community.Within the diverse representations of Law offered by popular culture both literature and cinema are of special significance. Literature, both \u0027elitist\u0027 (Kafka; Camus) and \u0027popular\u0027 (Thurow; Grisham) is one of the primary mediums for the critical examination of legal reasoning and the nature and ethics of practice within the wider culture, often revealing subversive and confronting truths normally suppressed by conventional legal education and training. Cinema, along with television, is one of the leading arenas for the formulation of the social consensus concerning the nature of Law and lawyers, often artistically re-staging the processes of legal reasoning and dispute resolution so as to both critique and affirm the legitimacy of legal culture.This unit will examine all of these issues through a critical analysis and discussion of a number of the seminal \u0027texts\u0027 within both the literature and cinema of Law.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4538","eftsl":0.125}