{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111For students who commenced their LLB course prior to 2015: LAW1100 OR LAW1101 and LAW1102 or LAW1104; LAW3400 or LAW3401 and LAW3402","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1100, LAW1102, LAW1104, LAW3400, LAW3402} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW5128}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Succession law","description":"This unit deals with the administration and distribution of property of deceased persons not effectively disposed of by a will. It covers: testamentary capacity and intention; the formal element for making, altering and revoking a will; the professional duties of lawyers in the drafting and execution of wills and the management of deceased estates; persons eligible to be appointed executors; types of grants of representation; methods of proving a will; the vesting of assets in an executor or administrator; the classification of gifts by will and the doctrines affecting such gifts; the powers and duties of executors and administrators; and the distribution of net assets to beneficiaries or next of kin. It is designed to impart the fundamental areas of legal knowledge and principles and the contexts within which legal issues arise.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4311","eftsl":0.125}