{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111For students who commenced their LLB course prior to 2015:   LAW1100 OR LAW1101 and LAW1102 or LAW1104","creditPoints":6,"rules":[{"startDate":"10/05/2012","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {LAW1102, LAW1104} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"10/05/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE IN {L3%} Do Any 2 co-req units in {LAW3111, LAW3112} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"Nil","scaBand":3,"unitName":"Tax policy","description":"The primary function of taxation - to raise revenue to finance the operation of the state - gives rise to many issues which lie at the heart of the relationship between the citizen and the state and speaks to the nature of our economic, social and political system. Key issues include: The role of taxation in a market economy; Who should bear the burden of taxation? What should be taxed - income, consumption, wealth/resources? The role of taxation in achieving outcomes beyond revenue raising including the role of taxation in the redistribution of resources, and the use of tax expenditures to achieve various social, economic and political outcomes; The link between the tax and transfer system or, more specifically, the link between taxation and the modern welfare state; The political influence of individuals and groups in shaping tax policy and legal outcomes.The subject introduces students to the various disciplines relevant to shaping and understanding taxation including economics, politics and law. It equips students with skills of policy analysis to enhance their understanding of tax law and policy in contemporary Australia.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4243","eftsl":0.125}