{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later: LAW1111;LAW1114; LAW2101; LAW1112; LAW1113; LAW2102; LAW2111; LAW2112; LAW3112.For students who commenced their LLB course prior to 2015: LAW1100 OR LAW1101 and LAW1102 or LAW1104; LAW2100 or LAW2101 and LAW2102; LAW3112","creditPoints":6,"rules":[{"startDate":"1/11/2000","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {LAW1100, LAW1102, LAW1104, LAW2100, LAW2102}","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1100, LAW1102, LAW1104, LAW2100, LAW2102} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/11/2000","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":"31/12/2014"}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Australian banking law","description":"The banking and finance sectors in Australia play an essential role in society. This industry continues to evolve and adapt to technological disruption, product innovation, and the increasing globalization of financial markets. It is also facing increasing scrutiny from policy makers, regulators and consumers following a series of crises and scandals. This course will review and consider key areas of Australian banking law and regulation. It will also discuss some of the areas of ongoing policy reform.Core topics will include:an outline of the banking system and its regulation and associated legal frameworkthe banker-customer relation, and duties and obligations of the partiestypes of bank transactions and the actions available in relation to themnegotiable instruments and their purposes and useselectronic bankingconsumer protectionsecured and unsecured lending.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4104","eftsl":0.125}