{"preqs":"For students who commenced their LLB course prior to 2015:LAW1101 Introduction to legal reasoning and LAW1104 Research and writing.For students enrolled in the LLB (Honours) course from 2015:LAW1111 Foundations of law, LAW1112 Public law and statutory interpretation, LAW1113 Torts, LAW1114 Criminal law 1, LAW2101 Contract A, LAW2102 Contract B, LAW2111 Constitutional law and LAW2112 Property A.For other students:Equivalent introductory units from another university.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1101, LAW1104} OR  Must have passed 8 (I/W) units in {LAW1111, LAW1112, LAW1113, LAW1114, LAW2101, LAW2102, LAW2111, LAW2112})","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International and comparative insolvency law","description":"This unit will cover the basics of bankruptcy/insolvency law and the general rights of creditors and debtors in various Western nations, i.e. from an international perspective.  The unit will focus on the core aspects of commercial bankruptcy/insolvency statutes in these countries.It begins with a review of the key insolvency concepts and provisions set forth by the United Nations Commission on International Trade Law (\"UNCITRAL\") with primary emphasis on Part Two of the UNCITRAL Guide On Insolvency Law,  entitled \"core provisions for an effective and efficient insolvency law\", including and highlighting its suggested provisions for reorganizations.  It will then address the insolvency statutes of the United States, the U.S. Bankruptcy Code, with particular emphasis on chapter 11 reorganizations.  Then the bankruptcy and insolvency laws of various European countries including, but not limited to, Germany, France, Italy, Spain and the Czech Republic, again with emphasis on their reorganization provisions, as applicable. Then the course will cover the terms, if any, of the various nations statutes on cross border bankruptcies and the UNCITRAL recommended provisions, together with the resulting problems where there are no or conflicting  statutes  in some countries.  Finally, the course will compare the various statutory provisions in these nations together with their adoption, or not, of the UNCITRAL recommended terms and the effect thereof.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4675","eftsl":0.125}