{"preqs":"For students who commenced their LLB course prior to 2015:LAW1101 Introduction to legal reasoningLAW1104 Research and writingLAW4341: Copyright \u0026 DesignsFor students enrolled in the LLB (Honours) course from 2015:LAW1111 Foundations of lawLAW1112 Public law and statutory interpretationLAW1113 TortsLAW1114 Criminal law 1LAW2101 Contract ALAW2102 Contract BLAW2111 Constitutional lawLAW2112 Property ALAW4341: Copyright \u0026 DesignsFor other students:Equivalent introductory units from another university","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1100, LAW1102, LAW1104, LAW4341} or  Must have passed 7 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112, LAW4341})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"LAW7489: Current Issues in Copyright (LLM)","scaBand":3,"unitName":"Advanced copyright: Global law and policy","description":"Students in this unit are required to have completed Copyright \u0026 Designs as a pre-requisite in order to give them the foundations necessary to tackling the complex legal, theoretical, political and pragmatic considerations that influence global copyright law. The unit will commence with an introductory lecture drilling into the philosophy and theoretical justifications for copyright. The remainder of the classes will take the form of seminars, with each focusing on a specific copyright issue of global or national significance. Readings will present the often diametrically opposed views of the various stakeholders, and guest speakers will provide additional richness of viewpoint.The curriculum will change as new issues emerge, but topics may include: Large-scale copyright infringement. Why do people engage in copyright infringement? What is the real impact of infringement on rightholders? What are some of the possible regulatory and non-regulatory responses to the challenge posed by digital distribution technologies? Graduated Response. What is the case for requiring ISPs to act as copyright police over their users? When should they be held liable for their users\u0027 infringements? How effective are the schemes in operation to date? What are the Australian proposals for reform and who do they benefit? Copyright exceptions. How do Australia\u0027s exceptions stack up internationally? What should we be trying to achieve with them, and are we succeeding in doing so? Questions might include - should we introduce a remix/mashup/transformative work exception for creators? Should we have a broadcast timeshifting exception, and if so, what should it look like? What\u0027s the case for and against the adoption of \u0027fair use\u0027? Orphan works. What is the orphan works problem? What causes it? How might the law be reformed to better promote the dissemination of knowledge? What are the international obstacles to reform? Regulation of online copyright infringement. Examine international agreements such as ACTA and the TPP, and domestic bills like SOPA/PIPA and consider a. the problems they were attempting to fix, b. the reasons why they failed, and c. other potential reforms that might achieve those aims. Recognising and rewarding authors. How good is copyright at making sure authors get paid? What are the particular challenges faced by authors and how are they evolving? Are there alternative ways of allocating rights and responsibilities that would achieve better outcomes for authors? Does the existing moral rights regime adequately protect creators\u0027 non-economic interests in their works? Anti-circumvention. Why do we have anti-circumvention laws, and what are their implications for the future? Are they appropriately tailored to the challenges posed by digital distribution? Should they permit activities such as the \"jailbreaking\" of consumer electronics devices? Protection of factual compilations and computer-generated works. What exactly is the current law in Australia, Europe and the US? What are the options for reform? How should the copyright law protect compilations of facts and computer-generated works, if at all? Rethinking copyright. If we were able to draft a copyright law from scratch, from the ground up, what might it look like? Which of these reforms would be permitted under our existing and proposed international obligations?","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4251","eftsl":0.125}