{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111For students who commenced their LLB course prior to 2015: LAW1100 OR LAW1101 and LAW1102 or LAW1104","creditPoints":6,"rules":[{"startDate":"30/06/2003","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any passed co-req (I/W) unit in {LAW4122}","endDate":"31/12/2015"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {LAW1100, LAW1102, LAW1104} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"30/06/2003","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW1100, LAW1102, LAW1104}","endDate":"31/12/2015"},{"startDate":"30/06/2003","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":"31/12/2015"}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International law of the sea I: Marine resource management","description":"This course provides a general introduction to the public international law of the sea with a focus on questions of maritime resource management. This includes living resources (principally fisheries) and non-living resources (such as oil and gas). The course will explore these issues in a manner which is historically informed and which focusses on topical case studies such as whaling in the Antarctic, the emergence of deep-sea mining technology or the the controversy between Australia and Timor Leste over the management of the oil and gas in the Timor Gap.Key topics covered will include: the negotiation of the UN Convention on the Law of the Sea (UNCLOS); the law of maritime boundaries and territorial demarcation; the legal regimes of the exclusive economic zone (EEZ) and continental shelf; living marine resource management including fisheries management and straddling stocks; non-living marine resource management (including oil and gas, off-shore drilling and marine spatial planning) and the law of artificial islands and installations; environmental protection (land-source pollution); the International Seabed Authority and the regime of deep seabed exploration and mining; and international dispute settlement and the International Tribunal for the Law of the Sea (ITLOS).As a major coastal State, the law of the sea touches on vital questions of Australia\u0027s national interests and resource security - many of which we will explore over the semester. This course may be undertaken completely independently of International Law of the Sea II, though the two are complementary.When possible, the course will be taught semi-intensively over nine weeks.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4180","eftsl":0.125}