{"preqs":"LAW4122","creditPoints":6,"rules":[{"startDate":"1/09/2009","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW4122}","endDate":""},{"startDate":"1/09/2009","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International law seminar: International public order","description":"International public order is both the practical and the normative foundation of public international law. International law does not operate within a vacuum, nor does it consist of the pro forma application of abstract principles and universals detached from real world conditions. Rather, international public order is best understood as the practical regulation of a global society of state and sub-state actors, subordinate to the trans-national rule of law. International law, therefore, is inseparable from the wider issues of global governance, the mechanisms, institutions and principles that enable the global society to operate as an integrated political and legal system.Taking this unit, students will not only acquire a sophisticated understanding of the concepts of international public order and the trans-national rule of law, but also how the integrity of the international system is inseparable from the practical operation of global governance. Understanding will be achieved through the detailed examination of a particular area of concern within international public order and how formal legal resolutions of disputes must necessarily be framed within terms of global governance and the trans-national rule of law.The topics to be studied include: the international legal process (the concept and sources of international law); international law as the judicial basis of global governance; and practical problems in international law and world order (conflict prevention; socio-political justice; international economic law; and international environmental law).","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4133","eftsl":0.125}