{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111; LAW4331For students who commenced their LLB course prior to 2015: LAW1100 OR LAW1101 and LAW1102 or LAW1104; LAW2101; LAW2102; LAW2201; LAW2202; LAW3101; LAW3301","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 5 (I/W) units in {LAW1102, LAW1104, LAW2102, LAW2202, LAW3101, LAW3301, LAW4331} or  Must have passed 7 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2101, LAW2111, LAW2112, LAW4331})","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"For COURSE_CODE IN {L3001, L3002, L3003, L3004, L3005, L3006, L3007, L3008} Do Any 2 (I/W) co-req units in {LAW3111, LAW3112} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Winter semester 2017 (Day)"]}],"enjoyScore":4.833333333,"learnScore":4.519017094,"learnResponse":23,"proh":"","scaBand":3,"unitName":"Sport and the law","description":"This Unit explores the intersection of sport and law and in so doing:  equips students to apply the body of knowledge known as \"sports law\"; and  consolidates, reinforces and extends students\u0027 knowledge and understanding of core legal subjects central to the practice of law.The Unit begins by examining the place of sport in our society, and how changes in society, and how society perceives sport (and sport perceives itself), has influenced the development and application of the law to sport.  In doing so, the Unit will examine sport in its various guises, local, national and international; professional and amateur; contact and non-contact; and explore sports\u0027 social, cultural, economic and political importance.  Next, the Unit explores the extent to which sport\u0027s \u0027\"specificity\" (its unique social and cultural standing and need for \"competitive balance\") has seen legislatures and courts modify the application to it of traditional legal concepts. Areas to be examined include the application of criminal law to on-field violence; tort and OHS law to sports related injuries; contract and employment law to sports persons\u0027 employment contracts and collective bargaining agreements; competition, equal opportunity and anti-discrimination law to the rules and practices by which sporting competitions are organised and conducted; and privacy, intellectual property, discrimination and other laws to protect a sports person\u0027s name, image, likeness and other attributes of their identity or person. The Unit then explores the development of unique legal rules and institutions tailored to sports persons and sporting activities, and the extent to which they are amenable to state regulatory and judicial systems.  These include sport specific self-regulating governance and dispute resolution systems; anti-drug codes; and rules concerning gambling and match-fixing. The Unit\u0027s focus is on domestic Australian law, but with an eye to how emerging commercial arrangements and legal doctrines in the US and EU could influence the law in Australia.  Finally, the Unit concludes by considering the extent to which this body of knowledge evidences a specific corpus of jurisprudence recognisable as \"sports law\", and what we can learn from it about the development of the law more generally.","enjoyResponse":24,"faculty":"Faculty of Law","unitCode":"LAW4340","eftsl":0.125}