{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102;  LAW2111For students who commenced their LLB course prior to 2015: LAW1100 OR LAW1101 and LAW1102 or LAW1104; LAW3200 OR LAW3201","creditPoints":6,"rules":[{"startDate":"1/11/2000","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {LAW3200, LAW3201} AND Must have passed an (I/W) unit in {LAW1100, LAW1102, LAW1104})","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1102, LAW1104, LAW2111, LAW3200, LAW3201} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"1/11/2000","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":"31/12/2014"}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.75,"learnScore":4.572390572,"learnResponse":19,"proh":"","scaBand":3,"unitName":"Advanced constitutional law","description":"This unit focuses on issues in Australian constitutional law that are not covered in depth in either Principles of Public Law and Statutory Interpretation (LAW1112), or Constitutional Law (LAW 3201). Issues will be selected for examination depending on their current theoretical or practical importance. Examples include methods of constitutional interpretation (including tensions between the framers\u0027 original intentions and contemporary values); the nature of implications drawn from the Constitution; express constitutional rights (trial by jury and freedom of religion); compulsory acquisition of property; the separation of powers as source of implied rights; the \"races power\"; the defence power both in war and peace; parliamentary privilege; and the process of constitutional amendment. Other issues that acquire public prominence from time to time, such as proposals for constitutional amendment, may also be examined. Comparisons with the constitutional law of other jurisdictions will be considered where appropriate.","enjoyResponse":6,"faculty":"Faculty of Law","unitCode":"LAW4112","eftsl":0.125}