{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111For students who commenced their LLB course prior to 2015: LAW1100 OR LAW1101 and LAW1102 or LAW1104","creditPoints":6,"rules":[{"startDate":"1/11/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""},{"startDate":"1/11/2000","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW1100, LAW1102, LAW1104}","endDate":"31/10/2014"},{"startDate":"1/11/2000","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":"31/10/2014"},{"startDate":"1/11/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {LAW1100, LAW1102, LAW1104} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Summer semester B (starts January) 2017 (Day)","Trimester 1 2017 (Day)","Trimester 2 2017 (Day)","Winter semester 2017 (Day)"]}],"enjoyScore":4.931818182,"learnScore":4.170833333,"learnResponse":19,"proh":"LAW7251","scaBand":3,"unitName":"Negotiation and conflict resolution","description":"Drawing on ideas first developed at the Harvard Negotiation Project and on work from a variety of research perspectives, this unit examines the theory and practice of negotiation and aims to improve students\u0027 effectiveness as negotiators.  Adopting an intensive blended learning approach that incorporates lectures, readings, simulations, exercises and discussion, students will: analyse different negotiating styles; practice utilising a principled negotiation framework; learn how to collaborate, create and claim more value; influence and communicate more effectively; better manage emotions; deal with difficult tactics; and reflect on issues of ethics and deception.  In addition, students will explore a spectrum of other ADR processes (including mediation as a form of facilitated principled negotiation) and consider related issues of suitability, choice and the role of the lawyer.Finally, students will also be eligible to receive advanced standing for the negotiation and dispute resolution component of the College of Law PLT Program.","enjoyResponse":25,"faculty":"Faculty of Law","unitCode":"LAW4160","eftsl":0.125}