{"preqs":"For students who commenced their LLB (Hons) prior to 2015:LAW1101; LAW1104For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111","creditPoints":6,"rules":[{"startDate":"13/10/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"13/10/2016","status":"ACTIVE","ruleSummary":"INCOMP","ruleString":"Incompatible with {LAW5392}","endDate":""},{"startDate":"13/10/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1101, LAW1104} OR  Must have passed 8 (I/W) units in {LAW1111, LAW1112, LAW1113, LAW1114, LAW2101, LAW2102, LAW2111, LAW2112})","endDate":""}],"locationAndTime":[{"location":"Prato","time":["Term 2 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"LAW5392 - Globalisation and international economic law","scaBand":3,"unitName":"Global economic law","description":"The rapidly increasing rate of globalisation of economic activity over the past few decades has dramatically altered the nature and dimensions of global economic transactions and engagement. It has also challenged the capacities of national governments to regulate economic activity within their domestic domains.The post-World War II trading rules (including GATT), along with the lower cost of international transport and the advent of the internet have facilitated the rapid growth of global economic activity, and the growth of international corporate behemoths. This has brought about substantial economic benefits to many, and assisted with lifting millions of people out of poverty. However, this has come at the expense of lowered competition through the growth of global monopolists (or near monopolists), the exploitation of labour and the environment, and increased tax and regulatory evasion, as national governments struggle to regulate cross-border activities. These trends are placing strains on domestic consensus about the benefits of economic globalisation, which is evident in the rise of nationalistic movements in various countries, including those in developed countries.This unit engages students in critical discussion and evaluations about the nature and form of these developments, the key global arrangements and institutions involved, the costs and benefits of these developments, and ways in which reforms could be undertaken.Students will actively engage in analysis and debate about: global trading arrangements and institutions (GATT, WTO and free trade agreements); global financing arrangements and institutions (IMF, Bank of International Settlements, and the resolution of international investment disputes settlements - the ICSID); the possibilities for global regulation of the exploitation of labour and the environment and access to medicines; and global policy making institutions and organisations, including the G20, OECD, UNCTAD, UNCITRAL, Davos and NGOs.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4681","eftsl":0.125}