{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112 and LAW2111For students who commenced their LLB course prior to 2015:  LAW1100 OR LAW1101 and LAW1102 or LAW1104; LAW2100 OR 2101 AND 2102","creditPoints":6,"rules":[{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW1100, LAW1104}","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1102, LAW1104, LAW2102} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise (true and Must be enrolled in course type {10})","endDate":"31/12/2014"}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":4.708333333,"learnScore":4.166666667,"learnResponse":3,"proh":"None","scaBand":3,"unitName":"Construction law (dispute resolution)","description":"This unit focuses on the avoidance, management and resolution of construction disputes. It critically analyses the causes of conflicts and disputes, and the role that the construction contract plays. Students explore various dispute avoidance processes (DAPs) that can prevent conflicts from escalating into disputes, and examine various \u0027real time\u0027 dispute resolution methods that can be used during the course of a construction project to manage and resolve disputes. Students also explore the processes that are available for resolving disputes that remain outstanding after a project has been completed, including ADR, arbitration and litigation. Students will engage in comparative analysis of construction dispute resolution processes used in other jurisdictions. Students will analyse traditional and alternative ways of resolving construction disputes and learn to research and write on construction dispute resolution issues.","enjoyResponse":20,"faculty":"Faculty of Law","unitCode":"LAW4244","eftsl":0.125}