{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW4515E}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International criminology","description":"Part I, \u0027Understanding Criminology\u0027, presents an overview of criminology - now made more exciting via integrated coverage of terrorism and related crimes - and describes the vast horizon of this science.  It explains what crime is and techniques for measuring the amount and characteristics of crime and criminals.  It also traces the history of criminological thought through the era that witnessed the formation of the major schools of criminology, classicism and positivism (eighteenth and nineteenth centuries).Part II, \u0027Explanations of Crime and Criminal Behaviour\u0027, includes explanations of crime and criminal behaviour on the basis of the various theories developed in the twentieth century.  Among the subjects covered are theories that offer biological, psychological, sociological, socio-political, and integrated explanations.  Coverage of research by radical, socialist, and feminist criminologists has been updated.  Theories that discuss why offenders choose to commit one offence rather than another at a given time and place are also covered in this part.Part III, \u0027Types of Crime\u0027, covers the various types of crimes from a legal and sociological perspective.  The familiar street crimes, such as homicide and robbery, are assessed, as are other criminal activities such as white-collar and corporate crime, which are so much in the spotlight these days, as well as other high-tech crimes that have been highlighted by researchers only in recent years.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4515","eftsl":0.125}