{"preqs":"For students who commenced their LLB (Hons) course in 2015 or later:LAW1111; LAW1114; LAW1112; LAW1113; LAW2101; LAW2102; LAW2112; LAW2111For students who commenced their LLB course prior to 2015: LAW1100 OR LAW1101 and LAW1102 or LAW1104","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW1100, LAW1102, LAW1104, LAW2100, LAW2102} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW5116}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International law of the sea II","description":"This course provides a general introduction to the public international law of the sea with a focus on questions of maritime security, the international movement of shipping and related questions of environmental management. Maritime security, as studied in this course, encompasses such threats as terrorism, high seas piracy and the smuggling of drugs, migrants and weapons of mass destruction. The course will also examine questions of military activities, intelligence gathering at sea and maritime environmental protest. Ninety percent of the world\u0027s goods move by sea and we will cover the law governing the free movement of merchant and government ships. International trade, however, may also pose threats to the environment. This course will examine the legal questions raised both by vessel source pollution and the problems of exotic species being transported in ballast water. As a major coastal State, the law of the sea touches on vital questions of Australia\u0027s national interests many of which we will explore over the semester.This course may be undertaken without previously having studied International Law of the Sea I. It does not cover questions of commercial maritime law such as the carriage of goods by sea and marine insurance","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4307","eftsl":0.125}