{"preqs":"LAW2101 Contract A and LAW2102 Contract B and LAW2201 Torts A and LAW2202 Torts B or an equivalent Introductory course in tort law and contract law at another university.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW2100, LAW2102, LAW2200, LAW2202} OR  Must have passed 4 (I/W) units in {LAW2101, LAW2102, LAW2201, LAW2202})","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW4531E}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Product liability law from a comparative perspective","description":"Product Liability refers to civil liability for injuries caused by defective products. This class will focus mainly on two systems of addressing injuries from defective products the American law system and the European Union system.Product liability occupies a central role in American law, as the number of new products used by consumers has increased exponentially. With this proliferation of new consumer products has come an increase in injuries. Products liability is a major way America attempts to deter firms from manufacturing unsafe products, and to compensate those that suffer injury from those products.The first part of the course will examine the American product liability system, focusing on the key sources of law underlying that system--common law principles of negligence, strict liability and deceit, contract and warranty principles, and statutory principles found in the Uniform Commercial Code. Using these sources of law, the course will explore the main theories of manufacturer liability, the concept of product defect, and defences available to the manufacturer under American law.The second part of the course will explore the same issues from the EU perspective. The European Community adopted its first Product Liability Directive in 1985, and its version of strict products liability has since been adopted in some version in many parts of the world. The EU approach differs in many important ways from the American approach. For example, the EU directive focuses on a test for defect the consumer expectation test that has been abandoned or given less significance in most American jurisdictions. The two systems like wise differ in their respective approaches to proof, remedies, defences, and defining a proper defendant. Moreover, unlike the American system, where product liability dominates the system of accident compensation, in most European countries, product liability plays a more modest role, and acts more as a supplement to the social compensation systems available in those countries.Why have the two systems evolved in such different ways? What are the advantages and disadvantages of the different approaches? Those are the core issues that the course will address.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4531","eftsl":0.125}