{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2011","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Corporate social responsibility","description":"This Unit will introduce students to the idea, and foundation, of corporate social responsibility (CSR) as a component of corporate governance.  Students will then be exposed to various facets of the three distinct but interrelated challenges to CSR.  First, why should corporations have social responsibilities towards their stakeholders?  Second, what is the scope, nature and extent of these responsibilities?  Third, how could corporations be made accountable for violating their social responsibilities in areas such as human rights, labour rights and the environment?Issues such as the following will be explored: meaning and historical evolution of the notion of CSR - comparing CSR with concepts such as corporate accountability, corporate citizenship, triple bottom line, corporate philanthropy,   and sustainable business; CSR and corporate governance - CSR\u0027s intrusion into company law; changing interface of states, corporations, law, and human rights against the backdrop of globalisation - privatisation of states and human rights; drivers of CSR, e.g., a risk management tool, ethical investing and consumerism, business case for CSR; ethical, social, legal and economic justifications for CSR; scope, nature and extent of social responsibilities - complicity of corporations with states in human rights abuses, responsibilities of corporations operating in conflict zones or repressive regimes, handling CSR issues within supply chains and in global operations; review of existing CSR initiatives: private v. public, voluntary v. obligatory, national v. international - the \"protect, respect and remedy\" framework proposed by Professor John Ruggie, UN Secretary General\u0027s Special Representative on Business and Human Rights; and CSR litigation (e.g., under common law and the US Alien Tort Claims Act) and the challenges thereof - the doctrine of forum non conveniens, and the allocation of liability within a corporate group.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4643","eftsl":0.125}