{"preqs":"LAW2102 and LAW2202","creditPoints":6,"rules":[{"startDate":"1/09/2008","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {LAW1104} or  Must have passed 6 (I/W) units in {LAW1112, LAW1113, LAW1114, LAW2102, LAW2111, LAW2112})","endDate":""},{"startDate":"1/09/2008","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"(Any co-req (I/W) unit in {LAW3111, LAW4169} and For COURSE_CODE IN {L3%} Do Any co-req (I/W) unit in {LAW3112} Otherwise true)","endDate":""},{"startDate":"1/09/2008","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course owned by {50000567, 50000568}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Remedies","description":"The unit in Remedies will consider the remedial goals of the common law, equity and some important statutes, as well as examine the legal rules and principles which give effect to these goals.The focus will be on damages and coercive remedies. The course will begin by studying the principles underlying compensation before moving to restitution, punishment and coercion. While it will not be possible to look at every general law remedy, the major topics concerning the assessment of damages in tort and contract, misleading or deceptive conduct and for breach of equitable obligations will be studied.Among the questions to be considered are: With compensatory damages being the primary remedy for many torts and for breach of contract, what role is there for punishment and gain-based damages in our law of civil obligations and what remedies give effect to these goals? Why are the compensation rules for tort different from those for contract? How are they different? How do the doctrine of mitigation and other limiting factors affect compensation in common law? In what ways does the assessment of damages for misleading or deceptive conduct differ from damages in tort and contract? Is compensation assessed differently where there is a breach of an equitable obligation? Should it be? When are injunctions and specific performance available, and what factors affect their availability?","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4522","eftsl":0.125}