{"preqs":"LAW3300 or LAW3301 and LAW3302","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE NOT IN {1074} Do Must be enrolled in course owned by {50000567} Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW5114}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {LAW3301, LAW3302} OR  Must have passed an (I/W) unit in {LAW3300})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Summer semester B (starts January) 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Sentencing and sanctions","description":"This course deals with the legal framework within which offenders are sentenced locally and nationally. It will examine sentencing principles applicable under state and federal law in Victoria. The course will examine the sources of sentencing law; the distribution of sentencing authority between the legislature, judiciary and executive arms of government; the control of sentencing discretion; the role of counsel in the sentencing hearing; plea negotiation, and the opportunity for public and victim input. Main sentencing measures and procedures currently utilised will be explored. The problems of sentencing special offender groups and special sanctions such as confiscation of the proceeds of crime will also be examined if time allows. The unit may cover: Introduction to the legislative, judicial and executive framework of sentencing authority in a federal system of government. Content of the Sentencing Act 1991 (Vic) \u0026 Crimes Act 1914 (Cth), Part 1B Courts exercising sentencing powers. The sentencing hearing - role of the trial judge; roles of prosecution and defence counsel; plea negotiation; victim impact statements; the role of the Sentencing Advisory Council; role of the media and the community. Evidentiary rules and burden of proof at the sentencing hearing. Plea making: mitigation and aggravation. Philosophical underpinnings: retribution deterrence, community protection, denunciation, rehabilitation, mitigation and mercy. Sentencing principles: nature of the crime; nature of the offender; response to the charges Main sanctions: fines; restitution and compensation; confiscation and disqualification; unsupervised release; community correction orders; custodial orders; parole. Special offender groups e.g. juveniles; sex offenders. Controlling sentencing discretion - the various models.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW4306","eftsl":0.125}