{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International information and media law","description":"Information and media content are potentially ubiquitous, whereas regulation, culture and context are generally not. This makes conflicts between different regulatory schemes inevitable. The conventional legal solutions of resolving jurisdictional conflicts, which have been designed for an offline world, are not sufficient to deal with the problems of the information age. The unit will survey the legal and regulatory approaches currently operating to resolve conflicts in the global exchange of information and media content. The different legal domestic approaches, and their interrelationship with emerging regional governance structures, will be critically examined.In the first part, the existing concepts of conflicts of law will be analysed and specific approaches (cyber law, setting of international standards, global media governance etc.) will be discussed, including the international institutions (WRC, ITU, ICANN) and dispute resolution fori (WTO, WIPO).The second part of the unit will explore the human rights context. Freedom of speech, freedom of the press, and of the media generally, can clash with other human rights such as privacy, data protection, and personality rights. Even though human rights are universal, the way conflicting human rights are balanced will reflect the cultural context and diversity of legal systems.The third part will shift the focus to the media and information industry. Media content and information must also be seen from a business perspective and, when disseminated across borders, have regard to international business law. Intellectual property and international trade agreements are important levers for the protection of local culture and other domestic interests.The fourth and final part will deal with information-related crimes, such as copyright violations, propaganda, pornography and child abuse, as well as with information warfare.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5632","eftsl":0.125}