{"preqs":"LAW5007 Principles of constitutional law and LAW5014 Principles of administrative law","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 2 (I/W) units in {LAW5007, LAW5014} Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7486}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Second semester 2017 (On-campus block of classes)","Trimester 3 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Victorian charter of rights and responsibilities","description":"In 2006, Victoria enacted the landmark Charter of Human Rights and Responsibilities Act (2006) (\u0027Charter\u0027), which incorporates civil and political rights into the domestic law of Victoria. The Charter provides a domestic avenue for the resolution of human rights disputes that were previously addressed in a piecemeal fashion under non-human rights specific laws and, on occasion, referred to unenforceable international fora for dispute resolution. This unit focuses on the history, development and operation of the Charter.Students undertaking this unit will study the history, development and theoretical framework of the Charter within the Victorian, Australian and comparative settings. Students will consider the different structures and mechanisms employed by comparative human rights instruments, and the impact these differences have on the relevance of those instruments to the Charter.Students will gain a comprehensive understanding of how the Charter operates in Victoria by thoroughly and critically exploring the scope of the rights, the powers to place restrictions on rights, the impact of the Victorian Charter on the development and interpretation of legislation, the impact of the Victorian Charter on public authorities, and the complex relationships that are established between various entities under the Charter. The analytical approach to the material will enable students to contribute to debate about reform of the Charter.The unit will also develop various skills of students, including statutory interpretation and jurisprudence analysis.This unit will appeal to all students, particularly those with an interest in human rights, constitutional law, administrative law, social justice and law reform.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5422","eftsl":0.125}