{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Australian tax policy","description":"The primary function of taxation - to raise revenue to finance the operation of the state - gives rise to many issues which speak to the nature of our economic, social and political system. Although these issues are common across modern liberal democracies, this subject focuses on the way these issues are treated in contemporary Australia. Key issues include: the role of taxation in the market economy; who should and does bear the burden of taxation in Australia? what bases should be taxed - income, consumption, wealth/resources? what is the role of taxation in achieving outcomes beyond revenue raising including the role of taxation in the redistribution of resources and the use of tax expenditures to achieve various social, economic and political outcomes? what is the link between the Australian tax and transfer system or, more specifically, the link between taxation and spending in the modern Australian welfare state? what is the political influence of individuals and groups in shaping tax policy and legal outcomes in Australia? how does the constitutional and institutional configuration of the Australian state influence tax laws?The subject covers a wide variety of disciplines relevant to the analysis of tax laws including economics, politics and philosophy. It refines skills of policy analysis to critically engage with current trends in Australian tax law and policy.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5441","eftsl":0.125}