{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7472}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["First semester 2017 (Day)","Trimester 3 2017 (On-campus block of classes)"]}],"enjoyScore":4.5,"learnScore":4.25,"learnResponse":3,"proh":"","scaBand":3,"unitName":"Principles of family law","description":"This unit provides students with an understanding of the fundamental principles and concepts in family law and the policies underlying them. It commences with an examination of what is meant by \u0027family\u0027 and the challenges facing family law with the increase in diverse family forms. Included in this discussion are contemporary issues relating the advances in medical technology and the identification of parentage.Once an understanding of what constitutes \u0027family\u0027 is established, the practice and process of family law including the non-adversarial procedures which have been established to encourage parties to resolve their disputes without the necessity of resorting to litigation are considered. The efficacy and relevance of financial agreements, child support agreements and consent orders are also discussed.The unit then examine the basic principles relating to the division of property following the relationship breakdown of married couples and de facto couples including same-sex couples. The discussion of the financial aspects on relationship breakdown includes what constitutes property and financial resources as well the approach to the division of superannuation entitlements. The approach of the court to the division and alteration of property interests between the parties and the factors that are taken into account in reaching an outcome are central to this discussion.The unit also delves into the dynamic and volatile area of disputes surrounding parenting arrangements. Legislation and case law for determining the pathway to suitable parenting arrangements which are in the interests of children are examined.  Non-adversarial procedures and parenting plans also form part of the discussion.  Criticism of the recent reforms relating to parenting arrangements and potential changes to the legislation are discussed. Issues relating to child support are also briefly dealt with.","enjoyResponse":8,"faculty":"Faculty of Law","unitCode":"LAW5409","eftsl":0.125}