{"preqs":"LAW5304Please note that the prerequisite subject can be waived in consultation with the Chief Examiner (please contact sarah.joseph@monash.edu as the CE is an international visitor).For example, the subject may be waived if the candidate has gained sufficient knowledge through prior learning or experience, or a clear willingness to do adequate reading in advance of this subject.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7318}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW5304}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Economic, social and cultural rights and international law","description":"This course provides an overview of economic, social and cultural (ESC) rights, both in international human rights law and in a comparative law. It will examine both the theoretical debates raised by the emergence of ESC rights, and the practical issues confronting monitoring bodies and advocates. The course is divided in three parts. First, it will explore the origins of ESC rights and how they have been approached by competing theories about the relationships between the State and the market. Second, it will discuss the status of ESC rights and corresponding State obligations. The right to adequate food shall serve as the main illustration, but other rights, such as the right to education and the right to housing, shall also be discussed. The existence of obligations across boundaries regarding ESC rights (eg duties owed by rich States to the people of poor States) will also be discussed. Third, it will examine the monitoring of ESC rights, both at national level and through regional or international courts of quasi-judicial bodies. Particular attention will be paid to the question of the justiciability of ESC rights, and to the various theories that have been forward to assess the content of the obligation of \"progressive realization\" of ESC rights, and the role of indicators and benchmarks in such an assessment.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5364","eftsl":0.125}