{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Trimester 1 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Chinese law and innovation policies","description":"This unit aims to equip future cross-cultural lawyers and regional policy-makers with the ability to understand the relationship between business law and issues of civil society. The unit will focus will be on high profile topics, namely China\u0027s internet laws, innovation policies and environmental policy considerations.Students must create a collaborative research project (a mock business venture or social enterprise) that evaluates whether Chinese laws and regulations are effective, responsive and coherent. Contentious and highly topical issues such as China\u0027s complex internet laws and innovation policies will be considered in depth.Classes will focus on preparedness for practice in an international legal environment, including class exercises and interactive seminars.Legal systems reflect the cultures and societies in which they operate. Cross-cultural thinking is therefore crucial for foreign lawyers to advise effectively on transnational deals and for policy-makers to create strategic international and regional policy solutions.Students will gain an overview of the Chinese legal system while focusing on the most important economic issues facing China and the world.This unit provides a targeted look at China\u0027s legal system, its complexity and its dynamic nature, and provides the tools to stay abreast of key changes.This unit complements LAW5437 China\u0027s legal system and they may be taken either as single units or together (in any order).","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5455","eftsl":0.125}