{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7482}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Transitional justice","description":"The term \u0027transitional justice\u0027 refers to the various judicial and non-judicial measures that may be implemented in order to redress a legacy of human rights abuse. Such measures include criminal prosecutions, truth commissions, reparations and different forms of institutional reform.This unit begins by providing an overview of the concept of transitional justice and the different transitional justice mechanisms in order to provide the theoretical framework for the unit. Following an exploration of the theoretical framework we then begin to engage in a detailed analysis of a number of transitional justice programs in order to gain an in-depth understanding of the operation of transitional justice mechanisms in practice. With respect to each case study we consider: the transitional justice mechanisms which were implemented, the success of the different transitional justice mechanisms, hurdles faced in implementing such mechanisms, criticisms of the implementation, and the interaction between the different mechanisms. Examples of case studies which may be considered as part of this unit are: South Africa\u0027s transition from apartheid to democracy, the aftermath of the Rwandan genocide and the relevance of transitional justice in Australia.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5418","eftsl":0.125}