{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7451}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International trade mark law","description":"This unit is designed to provide an overview of the international legal regime relating to the protection of trade marks and the regulation of the processes of their registration and use. In addition, it will provide an insight into selected aspects of trade mark law in the major jurisdictions of the United States of America and the European Union.The overview of the international legal regime will address topics such as the requirements of TRIPS for protection of trade marks.. It may also cover issues generated by regulatory processes for registration that have been widely adopted throughout the world, including those enabling one-stop registrations on an international or regional basis.The part of the unit dealing with the trade mark regimes of the United States of America and the European Union will cover issues such as requirements for registrability of trade marks, restrictions on registrability and the scope of rights of trade mark owners. The examination of rights will consider the various types of potential trade mark infringement, including consideration of dilution of certain trade marks and defences to infringement claims. The comparisons and contrasts between the two trade mark systems will be examined.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5400","eftsl":0.125}