{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7485}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Trimester 3 2017 (Day)"]}],"enjoyScore":4.5,"learnScore":4.785714286,"learnResponse":8,"proh":"","scaBand":3,"unitName":"Managing high conflict personalities in legal disputes","description":"This unit focuses on managing personalities in conflict resolution, particularly resolving disputes involving \"high-conflict\" personalities. The course will help students and practicing professionals recognize personality styles, choose appropriate intervention techniques, and maintain ethical principles while dealing with difficult people professionally and personally. The first part  will focus on developing an understanding the dynamics of personality in conflict, especially the impact of \"high-conflict\" personalities in legal and workplace disputes. The second part addresses how to manage individual clients, two or more parties in disputes, and systems involving many high-conflict parties. Methods will be taught and practiced in role-play exercises, including client counselling, coaching potentially high-conflict employees, coaching potentially high-conflict parties in separation and divorce, mediating high-conflict legal disputes, mediating workplace conflicts (when appropriate), managing high-conflict complainants with government agencies, and system-wide interventions to reduce high-conflict behaviour in organisations.","enjoyResponse":6,"faculty":"Faculty of Law","unitCode":"LAW5421","eftsl":0.125}