{"preqs":"None, however relevant background experience in sports or knowledge of contract law and/or administrative law would be beneficial.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Trimester 2 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Current issues in sports law","description":"This unit will explore various contemporary, evolving legal issues in the field of \"sports law\".  It will provide students with an overview, appreciation and critical evaluation of the ways in which sport and the law interact, and often collide with each other.  It will also provide students with an opportunity to explore the application of several traditional areas of the law in novel circumstances uniquely offered by the sporting context.  Where appropriate, the unit will explore the social, political, commercial and economic objectives and influences on the law and its application to the sporting industry, and (given the increasing globalisation of sports law) will provide various avenues of comparative analysis across different jurisdictions and in the international law sphere.The selected \"sports law\" areas to be taught are numerous and can include (subject to topicality and lecturer/student/faculty interest) any one or more of the following: introduction to \"sports law\" including examining the role and relationship between sport and the law, sport as a business, and the role of sport in society; international Sports Dispute Resolution; anti-doping law; sports competition law; significant issues in sports employment Law; athlete selection and discipline; discrimination and vilification in sport; \"Sports Tort law\"; the \"Field of Play\" doctrine; athlete privacy and publicity rights; and match-fixing.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5438","eftsl":0.125}