{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7438}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Trimester 3 2017 (Day)"]}],"enjoyScore":4.5,"learnScore":2.833333333,"learnResponse":3,"proh":"","scaBand":3,"unitName":"Globalisation and international economic law","description":"This unit is designed to critically examine the phenomenon of globalization, and the related changes currently underway in contemporary international economic law. A particular focus of the unit is on the role of international economic law institutions, such as the WTO, IMF and World Bank, as they grapple with the many new issues which globalization has thrust onto their agendas. How is globalization changing the nature of international law, international society and global governance? In this unit, students will undertake a multidisciplinary examination of the phenomenon of globalization and the associated transformation underway in contemporary international economic law. Students will employ tools and perspectives from a variety of the disciplines which have been used to examine globalization, such as economics, political theory, moral philosophy and sociology.Students will use these tools to consider issues such as the changing nature of international and global society (and what, if any, is the difference between the two); pressure on traditional concepts of boundaries, citizenship and nationality; the problem of inequality in the global distribution of resources; challenges to sovereignty and emerging forms of global governance; and how existing and new international institutions can better manage this emerging global social policy agenda.","enjoyResponse":8,"faculty":"Faculty of Law","unitCode":"LAW5392","eftsl":0.125}