{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7441}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Term 2 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Law of workforce management","description":"This unit will focus on the law of managing workforce behaviour which relates to aspects of the individual employment relationship, under the contract of employment, legislative regimes, negotiated agreements and employment practice and policy. Questions of how far employers can control the behaviour of employees at the workplace and in their private lives and what legal controls, limits and freedoms are available to employers, employees and fellow employees will be addressed. Topics covered will focus on issues such as discipline at work in both private and public sectors (include public sector employment codes and legislation; and demotion etc as part of private sector discipline); workplace bullying and sexual harassment and legal processes and procedures for dealing with same via legislation, policy, contract; individual grievances at work and dispute resolution in the workplace; employee disobedience to employer orders, remedies and dismissal; absenteeism; management of injured workers or those who are long term absentees; performance management; drug and alcohol testing; criminal conviction - recruitment and performance management issues; and recruitment - privacy, discrimination, medial and psychological testing.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5393","eftsl":0.125}