{"preqs":"LAW5304Please note that the prerequisite subject can be waived in consultation with the Chief Examiner. For example, the subject may be waived if the candidate has gained sufficient knowledge through prior learning or experience, or a clear willingness to do adequate reading in advance of this subject.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW5304}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7260}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Indigenous rights and international law","description":"This unit will examine the existing international law that promotes/protects human rights and freedoms of Indigenous peoples and locate this law within their culture and traditions, as well as within the international law context. The major international instruments that protect and promote the rights of Indigenous peoples will be evaluated. The United Nations Declaration on the Rights of Indigenous Peoples and work in other UN fora will be discussed. Australia forms the basis of case study. Includes focus on legal and community definitions of Indigenous peoples, understanding the right of self-determination, collective as opposed to individual rights, anti-discrimination, land and resource rights, civil and political participation, rights of identity, language and education.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5348","eftsl":0.125}