{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7224}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Summer semester A (starts November) 2017 (Day)"]}],"enjoyScore":4,"learnScore":4.30952381,"learnResponse":8,"proh":"","scaBand":3,"unitName":"Trade mark practice","description":"This unit is designed to meet the requirements of the Professional Standards Board for Patent and Trade Marks Attorneys (PSB) in relation to trade mark practice and the professional conduct of trade marks attorneys. The unit content details the process by which trade mark applications are made, opposed and registration maintained. It also deals with exploitation of registered trade mark rights via assignment, licensing and their use as security in financial transactions. It also deals with conflicts of interest and the need to maintain appropriate monitoring systems.Emphasis is placed on the practical aspects of trade mark practice as is relevant to the practice of a registered Trade Marks Attorney. To this end, the unit places particular emphasis on the practices and procedures of the Australian Trade Marks Office. It also seeks to provide students with a practical appreciation of the practice of a Trade Marks Attorney through identification and resolution of practice and procedure issues that frequently arise when dealing with trade marks through the application process and after registration.Professional conduct for Trade Marks and Patent Attorneys, including such issues as registration, professional liability and negligence issues, conflicts of interest, privilege, confidentiality, maintenance of rights and monitoring systems, fiduciary obligations to clients, and the Institute of Patent and Trade Mark Attorneys Code of Conduct.","enjoyResponse":1,"faculty":"Faculty of Law","unitCode":"LAW5341","eftsl":0.125}