{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7320}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Trimester 2 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Terrorism and human rights","description":"There has been an intense preoccupation with the need to combat global terrorism since the attacks on the United States in 2001 and the subsequent \u0027war on terror\u0027. This campaign is multi-faceted and includes police actions, military campaigns and the enactment of harsh anti-terrorism legislation across the world, including Australia, the US and the UK. Global measures have been taken by the United Nation, particularly the UN Security Council. These domestic and international laws, measures and policies have had profound impacts on the enjoyment of human rights, including ramifications for rights such as the right to be free from arbitrary detention, the right to privacy, the right to freedom of expression, the right to freedom from torture, and the right to life. Of course, the relevant laws and policies are often justified on the basis of the protection of human rights, such as one\u0027s right to be protected from terrorists. The appropriate balance between human rights and liberty on the one hand, and national security and protection from terrorism on the other, is therefore a focus of this course. The compatibility of those aspects of the\" war\" on terror involving armed conflict with international humanitarian law (the law of armed conflict) is also analysed.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5365","eftsl":0.125}