{"preqs":"LAW5006","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed an (I/W) unit in {LAW5006} Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Principles of succession law","description":"Around 30-40,000 people die each year in Victoria. The management and distribution of their property is determined by principles of succession law.  Succession law governs how the property of a deceased is distributed, who can manage a deceased estate and how distributions may be challenged distribution. This unit will enable students to understand the key issues affecting succession law, the directions that people can incorporate into a will and the professional obligations lawyers face in succession law.The unit covers four key elements of succession law. The first is intestacy (when a person dies without a valid will) and will making. This part of the course examines the presumptive distribution of assets in intestacy and the novel Victorian approach. It also examines the execution requirements for will making and the process to grant probate to wills and codicils that do not meet those requirements.The second key issue of the course is the doctrines affecting testamentary gifts. What can and cannot be done through the gift clauses? This part of the course examines the nature and  limits of \"testamentary freedom\" (the ability of people to dispose of their estate as they wish).A key such limit is \"family provision\", under which close relative and partners of a deceased person can challenge the distribution of an estate.The third part of the course examines managing and distributing deceased estates.  This includes the standards for those managing an estate, control of funeral and burial arrangements and when and how can beneficiaries challenge or remove a personal representative.The final part of the course examines professional obligations of lawyers.  Succession law generates a high level of professional complaints against lawyers.  The course will examine the special rules governing the conduct of lawyers, particularly when they act the personal representative of an estate.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5450","eftsl":0.125}