{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 60 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7442}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Term 1 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Banking law","description":"This unit provides an overview of the key relevant legal principles and practice of banking. It primarily addresses the regulation of banks and other deposit-taking institutions and their relationship with their customers. It covers law, policy and regulation of banking, lending and payments services. It will be taught on a comparative basis, looking at how these institutions are regulated in Australia and comparing this to the position in key banking centres overseas (in particular US, EU and UK positions). Key topics to be covered will include an overview of banking, the theoretical basis for regulation and supervision of banking, the history of and constitutional basis for Australian regulation, prudential supervision of banks, licensing of banks and other financial services firms, comparative banking regulation (focusing on the position in the US, UK and EU), systemic issues and crisis management, practical and legal risks posed by payment systems, Australian payment system regulation, current policy issues with banking and payment systems, banker/customer relationship (including confidentiality), law and policy issues with lending and security, and regulation of credit and credit providers.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5394","eftsl":0.125}