{"preqs":"For students in JD courseLAW5000, LAW5001, LAW5004, LAW5003, LAW5002, LAW5005, LAW5006, LAW5007","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 8 (I/W) units in {LAW5000, LAW5001, LAW5002, LAW5003, LAW5004, LAW5005, LAW5006, LAW5007} Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Any 2 co-req units in {LAW5008, LAW5011} Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {LAW5054}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"LAW5054 (that is, the equivalent 12 credit point unit)","scaBand":3,"unitName":"Law Review editorship 1","description":"Only students selected by the faculty as Student Editors of the \"Monash University Law Review\" enrol in this unit. The Student Editors are responsible for working closely with the Faculty Advisors and student editorial committee to produce the \"Monash University Law Review\". Student Editors are responsible for managing the student editorial committee; soliciting and reviewing academic articles for the journal; editing and checking the citations on accepted articles; and managing the process of publication and distribution of the journal. Student editors enrol in this unit to obtain credit for the learning achieved in the work of producing one issue of the journal. The set of activities undertaken by the Student Editors will depend on the stage at which the preparation for the next issue of the journal has reached at the time their enrolment commences and finishes, in accordance with a schedule approved by the Faculty Advisors who oversee the production of the journal.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5053","eftsl":0.125}