{"preqs":"","creditPoints":6,"rules":[{"startDate":"15/11/2016","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":"30/11/2016"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":"30/11/2016"},{"startDate":"15/11/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Trimester 1 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Copyright X: Monash","description":"US and International Copyright Law and Theory is based on materials developed by William Fisher for CopyrightX at Harvard Law School. Online lectures are recorded by Professor Fisher, and weekly seminars are conducted at Monash. Students in this course will have an opportunity to participate in online discussions of copyright-related issues.  Students who successfully complete the unit will also be eligible to receive a certificate of completion from Harvard.  The unit explores US copyright law and the ongoing debates about how the law should be reformed. The unit will cover: theory - the arguments, drawn primarily from economics, political theory, and philosophy, concerning why and how the law should regulate uses of expressive materials; doctrine - the rules currently in force concerning uses of expressive materials and the ways in which those rules are typically interpreted and applied; and practice - how those rules affect various fields of art, industry, and culture, including literature, music, film, photography, journalism, software design, architecture, fashion, comedy and games.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5448","eftsl":0.125}