{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7432}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Non-adversarial family and children\u0027s law","description":"This unit will offer experienced family and child protection lawyers, family dispute resolution practitioners, child protection workers, policy makers and those interested in dispute resolution a grasp of the principles of the innovative field of non-adversarial justice and a comprehensive framework for analysing the appropriateness and integrity of existing non-adversarial practices in family and child protection law. It will assist students to position themselves at the forefront of law reform through sharpening their policy analysis skills and providing them with a structure for predicting the future development of practices in the family law and child protection fields.This unit will examine and critically assess the range of non-adversarial practices which are central to Australian and international family law systems. It focuses primarily on the federal Australian family law system and state-based child protection systems. The unit approaches the study of family and child protection law by focusing on forms of conflict management, dispute prevention and dispute resolution employed in those fields. In particular the subject will explore the more recent developments in family dispute resolution processes in Australia and overseas. These practices will be examined from the perspective of \u0027non-adversarial justice\u0027, a cutting edge framework developed to explore the common themes and links between disparate practices developed in reaction to the adversarial system in a variety of settings within the justice system.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5387","eftsl":0.125}