{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG, 50} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7344}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Comparative corporate governance","description":"This unit explores contemporary thinking, regulation, and practice surrounding the connected areas of corporate governance, responsibility, and sustainability in Australia and comparable corporate regulatory systems worldwide, with particular emphasis upon corporate regulatory systems in Anglo-Commonwealth countries, the EU, and North America. Major topics covered include: major theories and issues of corporate responsibility and governance, recent transnational corporate governance reforms across foreign jurisdictions of relevance in Australia, related corporate social responsibility developments (including business and human rights), and corporate governance in the Australian public sector (including state business interactions, government business enterprises, and frameworks for public sector governance). As the unit exposes students to a variety of comparative, international, and cross-disciplinary ideas and material, it is suitable for students interested in comparative corporate governance from a range of national, academic, and work-related backgrounds, including students who are interested in exploring corporate governance law and regulation as it relates to both the public sector and the private sector.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5378","eftsl":0.125}