{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7481}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW5304}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":4.125,"learnScore":4.5,"learnResponse":6,"proh":"","scaBand":3,"unitName":"Children\u0027s rights in international law","description":"Securing the rights of children remains a challenge in the 21st century. Children continue to be exploited and abused on a regular basis and the use of child labour and child soldiers continues. In addition, violence against children and the mistreatment of child refugees is a concern in many countries. This unit provides an in-depth analysis of the UN Convention on the Rights of the Child and its implementation around the world. It includes consideration of the historical development of children\u0027s rights; the various mechanisms in place in different countries for the implementation of the international norms pertaining to children\u0027s rights; the strengths and weaknesses of the UN processes for protecting children\u0027s rights, including the state reporting system; policy arguments for and against reform of the international system surrounding children\u0027s rights; and specific challenges to the full realisation of children\u0027s rights, including economic pressures, political will (or lack thereof) and social and cultural factors.","enjoyResponse":8,"faculty":"Faculty of Law","unitCode":"LAW5417","eftsl":0.125}