{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7495}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":4.166666667,"learnScore":4.805555556,"learnResponse":8,"proh":"","scaBand":3,"unitName":"International entertainment law","description":"The contemporary entertainment lawyer must possess a core competence in intellectual property, contracts and licensing, negotiation strategies, business organization, commercial transactions, and international and comparative law as well as familiarity with a host of other topics. This course is designed to consider the fundamental substantive issues found in international entertainment law, including the impact of myriad domestic and global regimes implicated in the study, and to arm the participant with the knowledge and skills necessary to embark upon a practice in the subject area.The topics considered in the course include but are not limited to: rights of image of celebrities; intellectual property assets and the cross-border acquisition of rights; the effect of established and emerging multi-media platforms on entertainment products and services; the employment of extra-territorial talent; the authority of talent guilds over foreign performers and performances; international financing of motion pictures and sound recordings; barriers created by copyright and international trade law to cross-border distribution of recordings, videos, books and magazines; issues related to exhibition, performance and sale of entertainment, such as domestic content requirements, regulation of offensive content, international piracy, and the cross-border collection of music and movie royalties; and the structure of entertainment contracts of various sorts. Since the topic is global and is significantly affected by diverse cultural and economic influences and experiences, the laws and perspectives of a breadth of countries, including but not limited to Australia, the United States, the United Kingdom, Canada, Japan, Germany, and France will be considered.This course is appropriate for both generalists seeking an introduction to the subject as well as specialists who desire to consider advanced topics.  This course is appropriate for both generalists seeking an introduction to the subject as well as specialists who desire to consider advanced topics.","enjoyResponse":6,"faculty":"Faculty of Law","unitCode":"LAW5431","eftsl":0.125}