{"preqs":"JD students will be expected to have completed or be enrolled in LAW5014 Principles of administrative law. Other students should have knowledge of or experience in government decision making.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"For COURSE_CODE IN {L6005} Do Any co-req (I/W) unit in {LAW5014} Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7498}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Principles of government law and administration","description":"Government is much more than law. This unit examines the legal, policy and ethical issues affecting government at the federal, state and local council levels. This course will enable students and practicing officials to understand how governments and their administrative processes are structured, how the legal operation of government is affected by Westminster principles, oversight bodies and public sector ethics and how government is changing.The first part of the course will focus on understanding the legal framework of government, with particular attention to parliamentary and ministerial oversight of government decision making. This part of the unit will build upon and advance the knowledge of students who have studied administrative law. For those who have not, it will provide a legal and theoretical framework to locate and strengthen their professional knowledge. One theme of this part of the course is the difference between law and politics. How independent can and should government officials be from politicians? How can government officials balance the often competing requirements of legal and political accountability? When and how can politicians properly direct or influence government officials, particularly those appointed to independent positions? Another theme of this part of the course is the requirements of sound decision making.  What makes a sound decision? What are best practice models of decision making? How can reasons for decisions be drafted and defended?The second part of this course will address the avenues of accountability and oversight outside the courts. Attention will be given to modern theories suggesting that there is now a \u0027fourth\u0027 arm of government, which takes in the so-called integrity bodies such as Ombudsmen, Auditors-General and anti-corruption agencies.The third part of this course will examine public sector ethics - the guiding principles to which all public officials are subject. Consideration will be given to the separate and complimentary function of public sector values. What are the special ethical rules and values of the public sector? How much of these values are formal or written? How do we manage conflicts between normal workplace pressures and the unique problems of government such as political pressure? This part of the course will draw heavily on the experience of students and guest speakers for discussion and problem solving.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5434","eftsl":0.125}