{"preqs":"LAW5000 or LAW5080 or LAW5081, LAW5007 and LAW5004 (for students beginning in 2015 or later)","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7274}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3387, L6005}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387} Do Must have passed 2 units in {LAW5000, LAW5007, LAW5080, LAW5081, LAW7212, LAW7470} Otherwise Must have passed 3 units in {LAW5000, LAW5004, LAW5007, LAW5080, LAW5081}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Trimester 1 2017 (Day)","Trimester 2 2017 (Day)","Trimester 3 2017 (Day)"]}],"enjoyScore":4.573863636,"learnScore":4.009920635,"learnResponse":11,"proh":"","scaBand":3,"unitName":"Principles of administrative law","description":"Administrative law is the branch of public law that regulates the exercise of power by the executive arm of government.  This unit introduces students to the structure of government administration, the sources of administrative discretion and the systems that have been developed to permit the review of the exercise of administrative discretion by administrative decision-makers. The unit compares review of the \u0027merits\u0027 of administrative actions, by administrative decision-makers, with review of their \u0027legality\u0027, by courts, pursuant to judicial review. The unit examines the judicial review of administrative action both at common law and under statute and has particular regard to the grounds of review; the courts\u0027 jurisdiction to entertain applications for review; the possession, by potential applicants for review, of standing; and the remedies available pursuant to a successful judicial review application. The unit will develop advanced and integrated skills in statutory interpretation in the context of regulatory legislation.","enjoyResponse":29,"faculty":"Faculty of Law","unitCode":"LAW5014","eftsl":0.125}