{"preqs":"LAW5000","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW5000, LAW5080, LAW7212, LAW7470}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3387, L6005}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {LAW2200}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7266}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Trimester 1 2017 (Day)","Trimester 2 2017 (Day)","Trimester 3 2017 (Day)"]}],"enjoyScore":3.916666667,"learnScore":3.13234127,"learnResponse":25,"proh":"","scaBand":3,"unitName":"Principles of torts","description":"This unit introduces students to the law of civil wrongs (torts), including the role and purposes of tort law, the interests which it protects, and its relationship to statutory schemes which provide compensation for injury or loss. Students begin with selected intentional torts (trespass to the person, assault and battery, false imprisonment, trespass to land) and the strict liability tort of private nuisance, including elements and defences. Students then study the tort of negligence; its development, the elements of the tort and the various contexts in which it arises, the types of harms that are compensable, defences, the assessment of damages; concurrent liability and contribution by multiple wrongdoers, the particular problems raised by negligently caused mental harm and pure economic loss, and the concept of vicarious liability. Students will examine the impact of statutory law reform, in particular the civil liability reforms, on torts law, and broader policy debates about how civil wrongs should be redressed and injuries and losses compensated.","enjoyResponse":32,"faculty":"Faculty of Law","unitCode":"LAW5003","eftsl":0.125}