{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7463}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International covenant on civil and political rights","description":"The International Covenant on Civil and Political Rights is the key global human rights treaty which addresses civil and political rights. It is the key treaty for the purposes of the operation and interpretation of existing human rights legislation in Australia in Victoria (the Charter of Human Rights and Responsibilities), the ACT (The Human Rights Act), and at the federal level (the Human Rights and Equal Opportunity Commission Act). It is also a key treaty for the purposes of the operation of the interpretative principle under which judges should interpret statutes, where possible, in light of Australia\u0027s human rights obligations.The unit will cover all elements of the ICCPR, including general principles (eg. brief history, the role of the UN Human Rights Committee, the impact of cultural relativism, positive and negative obligations, obligations of conduct and obligations of result), and admissibility criteria under the Optional Protocol (eg. requirements regarding subject matter jurisdiction, personal jurisdiction, and territorial jurisdiction; the rule regarding the exhaustion of domestic remedies). The case law and other jurisprudence with regard to key civil and political rights will then be analysed (eg freedom of expression, the right to privacy, the right to life, the right to liberty and security of the person, the right to a fair trial, freedom from discrimination, as well as rights regarding immigration and Indigenous peoples.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5403","eftsl":0.125}