{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Comparative international litigation","description":"This course provides a comparative overview of the Australian and European approach to transnational litigation. Students are made familiar with transnational applications of private law, and discuss the rules regarding jurisdiction, applicable law, and recognition and enforcement. Focus is on commercial law. Family law and personal relations often also trigger transnational disputes. While these may be referred to in passing, they are not part of the core of this course. The course specifically addresses not just the reality of transnational litigation. It also emphasizes the potential for employing conflict of laws in procuring jurisdiction and applicable law in the best interest of the parties.  The general introductory part of the unit will provide student with a \"bird\u0027s eye view\" of transnational litigation, covering issues such as the fundamental concept, nature, development, sources and key processes of private international law, the standard \u0027connecting factors\u0027, characterization, renvoi and the \u0027incidental\u0027 issue.  Forum shopping and forum non conveniens will also be compared across civil and common law jurisdictions.  A more detailed comparative examination of key transnational legal issues will following, including jurisdiction in \u0027civil and commercial\u0027 matters, questions on applicable law (Contract and Torts), international insolvency, international succession (inheritance), and recognition and enforcement of judgements. The final part of the unit will examine current issues, such as corporate social responsibility and conflicts.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5453","eftsl":0.125}