{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7324}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Energy law, regulation and policy","description":"Since the oil shocks of the 1970s, Australian, regional and international energy markets have experienced significant economic and structural transformations. These changes have been accompanied by considerable legal and policy developments, reflecting escalating global energy demand, growing worldwide concerns over diminishing global supplies of traditional fossil fuel resources, cost and price fluctuations, security of energy supply and demand, environmental hazards of fossil fuel production and consumption (e.g., climate change, atmospheric, soil and water pollution and harm) and a variety of human rights matters issues (e.g., corporate responsibility and indigenous peoples\u0027 rights regarding natural resources). By way of background, this unit canvasses a broad range of domestic and international energy markets, the global importance of energy, key multidisciplinary aspects of energy markets such as price, cost, security of supply, environmental damage, and international and internal armed conflict.  At the domestic level, this historical development of the national energy market (electricity and gas) and the policy decision making, governance arrangements and legislative and regulatory framework of the nascent Australian Energy Market.  Various Australian energy sectors - electricity and gas - are examined in terms of relevant sources of energy law, constitutional constraints, governance and regulatory functions of key market institutions, together with legal obligations, responsibilities and/or participatory rights and benefits of key stakeholders in the Australian Energy Market (e.g., pipeline access arrangements, consumer protections).  Against the many benefits of energy, the adverse environmental and social impacts of traditional energy production and consumption on the environment, in particular greenhouse gas emissions, are considered.  Examples of domestic, supranational and international legislative, regulatory and policy responses to dealing with environmental harm - emissions trading, carbon taxes, fuel mix changes towards renewable energies and/or nuclear power are considered to illustrate these contemporary issues.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5367","eftsl":0.125}