{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7536}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International and comparative family law","description":"This course begins with comparative approaches to a range of legal traditions in which family law is idiosyncratically situated. Topical issues touching on how domestic law interacts with legal diversity in family law will be canvassed. Particular emphasis will be placed on the interactions between religiously-governed family law and secular state law.From the comparative law perspective, the course will progress to a consideration of the ways in which Immigration and Refugee Law interacts with domestic family law and family law policy.The seminar will then progress to an examination of the traditional common law conflict of law principles that touch on family law matters, including jurisdiction and recognition and international enforcement of foreign family law orders. Consideration will then be given to the modification of the common law regime by treaty and legislation, including the various Hague Conventions that apply to family law issues. Further attention will be given to the United Nations Convention on the Rights of the Child as well as other human rights treaties. Each regime will be considered in the context of its impact upon domestic legal issues.The six main area of family law will be examined through the lenses of comparative and international law, including marriage, divorce, matrimonial property, adoption, custody, and support.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5436","eftsl":0.125}