{"preqs":"LAW5304Please note that the prerequisite subject can be waived in consultation with the Chief Examiner. For example, the subject may be waived if the candidate has gained sufficient knowledge through prior learning or experience, or a clear willingness to do adequate reading in advance of this subject.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW5304}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7311}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International human rights law and women","description":"Securing the protection and promotion of the human rights of women remains a challenge in the 21st century. Notwithstanding the significant advances in international human rights norms relating to women, systemic discrimination and inequality are part of everyday life for many women in the world.  Many human rights abuses relate solely to, or impact more significantly on, women, such as, violence, human trafficking, and female genital mutilation. This unit examines the international human rights obligations and standards pertaining to women, including relevant international treaties, customary international law and the domestic means of implementing international norms. It covers the theoretical debates about securing the human rights of women, including debates about discrimination, equality and the public-private divide and examines the impact and challenges of cultural practices on the realisation of women\u0027s human rights","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5359","eftsl":0.125}