{"preqs":"LAW5411 Advanced mediation: skills and theory A","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7476}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW5411}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["First semester 2017 (Day)","Summer semester A (starts November) 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Advanced mediation: Skills and theory B","description":"This unit builds on the skills developed in LAW5411 and focuses on refining and assessing those skills. It will also develop and extend research work that is focused in the core competency areas. Students will refine their skills by participating in a range of conflict scenarios and will engage in additional ethical issue work. Students will also investigate further ethical and theoretical issues, relevant empirical studies in mediation ethics, inter-cultural contexts, contingent 3rd party interventions and issue of power and empowerment. Students will be provided with individual feedback on their style and overall performance by highly qualified practitioners.This interactive workshop has been developed to assist students to meet part of the National Mediation Accreditation Standard requirements and provides an opportunity for students to be tested and assessed in accordance with the National Mediation Accreditation Standards.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5412","eftsl":0.125}