{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7491}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Freedom of speech: Law theory and policy","description":"This subject is divided into three main parts. In the first part, an examination will be made of what are said to be the philosophical underpinnings of the notion of freedom of speech. Those underpinnings will be critically assessed, and their limitations, with regard to particular forms of speech, analysed. In this part of the course consideration will also be given to what we should appropriately regard as constituting \"speech\" in the context of freedom of speech - for instance, should the wearing of religious adornments count as \"speech\" for the purposes of freedom of speech? Consideration will be given, too, to what is appropriately understood by \"freedom\" in the context of freedom of speech and what such freedom requires - for example, in order for there to be \"freedom of speech\" in the requisite sense, is it necessary that there be laws positively enabling speech? Or is it sufficient simply that there be no laws prohibiting or limiting speech?In the second part of the course, an examination will first of all be made of Australia\u0027s obligations, pursuant to international law, with regard to the provision of freedom of speech. Then, consideration will be given to the protections actually afforded to freedom of speech both in Australia and overseas. In an Australian context, in-depth consideration will be given to the implied freedom of political communication contained in the Australian Constitution and to the so-called principle of \"legality\", used in statutory interpretation to limit the circumstances in which statutory power can infringe upon fundamental rights (including freedom of speech). Consideration will also be given to the relevant provisions of the Victorian Charter.In an overseas context, students will be provided with an overview of the protection afforded to freedom of speech in the United States, Canada and the European Community. Comparisons will be drawn with the protection afforded in Australia.In the third part of the course - which will occupy about half of the course - in-depth consideration will be given to various Australian legal regimes that prohibit, restrict or otherwise regulate certain kinds of speech (and which, therefore, restrict or regulate freedom of speech). These regimes will be drawn from a pool including (but not necessarily limited to) regimes that prohibit, restrict or regulate racial or religious vilification; obscenity and pornography; incitement to illegal conduct; defamation; campaign finance and commercial speech.In respect of each regime that is considered, critical analysis will be undertaken as to whether the limitations on freedom of speech imposed by the regime are justified, by reference both to the underlying principles in support of freedom of speech generally, and to the specific objectives that are sought to be achieved by the regime in question.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5427","eftsl":0.125}