{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7028}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International trade law","description":"This unit focuses on the laws, regulations and administrative processes that apply to international trade. The applicable Australian domestic laws are examined within the context of Australia\u0027s international obligations under the World Trade Organisation framework and other international regimes and treaty arrangements. After investigating the various structures an exporter can adopt for undertaking international trade (agency, distributorship, licensing and franchising) an examination is made of the legal and other impacts of applying each of these structures. The unit then covers the formation of international sales contracts and the application of the Convention on the International Sale of Goods, along with the incorporation by reference of incoterms into contracts. The resolution of cross-border contract disputes by using mediation, international arbitration and litigation is examined. Other topics covered are payment by means of letter of credit, the legal regime for insuring cargo and the liabilities of carriers. The regulation of imported and imported goods is examined, along with the application and calculation of customs duties. This regime is considered within the context of Australia\u0027s WTO and other international obligations. Australia\u0027s anti-dumping regime is also examined within the context of WTO obligations. Finally, the organisation and structure of the WTO itself is considered.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5305","eftsl":0.125}