{"preqs":"Completion of any of the following units is advantageous:LAW5411, LAW5429, LAW5344 and/or LAW5410","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"International commercial dispute resolution advocacy","description":"The unit is structured around preparing award students to compete in the International Chambers of Commerce (ICC) Mediation Competition (ICC Competition), a prestigious, international competition which attracts teams from renowned law and business schools as well as many of the world\u0027s leading mediators . As such, the unit has a strong focus on mediation advocacy performance, including aspects such as team work, strategy, tactics, agility and flexibility in the unpredictable moment-to-moment reality of commercial negotiation.While the ICC Competition provides a focus, the unit provides a highly relevant and entirely transferable skill set for legal practitioners and for any professional wanting to strengthen their effectiveness in commercial negotiation. The unit is designed to give students practical skills in the area of commercial negotiation advocacy, in the context of the increasing use of alternative dispute resolution in all jurisdictions.The unit will focus on interest-based negotiation and advocacy skills in the context of commercial, including cross-border, disputes. The unit examines the theory and practice of mediation and negotiation as dispute resolution processes, using the Harvard model of principled (interest-based) negotiation. The focus of the unit is effective negotiation advocacy and collaborative problem-solving to progress towards settlement, using theory sessions, role plays and interactive exercises.Please note that not all students enrolled in the unit will compete in the ICC Competition. Following the completion of the unit, a group of up to four competitors will be selected from those students enrolled in this unit as award students, to represent Monash University in the ICC Competition to be held in Paris in February 2016.. For more information about the ICC Competition, please see this link: http://www.iccwbo.org/training-and-events/competitions-and-awards/mediation-competition/information-about-past-competitions/","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5440","eftsl":0.125}