{"preqs":"The achievement of at least twelve units or 72 credit points towards the Master of Laws (Juris Doctor) to include:LAW5000, LAW5001, LAW5002, LAW5003, LAW5004, LAW5005, LAW5006 and LAW5007 or equivalent","creditPoints":12,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3387, L6005}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7423}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Summer semester A (starts November) 2017 (Evening)","Trimester 1 2017 (Day)","Trimester 2 2017 (Day)","Trimester 3 2017 (Day)"]}],"enjoyScore":4.375,"learnScore":4.888888889,"learnResponse":7,"proh":"","scaBand":3,"unitName":"Professional practice (JD)","description":"Students undertake a practical placement at a community legal centre which endeavours to meet the needs of its community. Under supervision by qualified solicitors, students provide legal advice to clients, undertake ongoing casework, brief Counsel, and in appropriate cases, represent clients in Court. Students acquire a diverse range of practical legal skills essential for legal practice including: the capacity to undertake legal research and apply legal research to factual scenarios; the ability to synthesise professional, technical and ethical knowledge acquired in the law degree and apply it in a practical legal context; skills in critical thinking and legal judgment; the capacity to independently devise legal solutions for complex legal problems and to provide non-adversarial options to clients for dispute resolution; and the capacity to identify and respond to ethical, moral and professional dilemmas in legal practice. Students also develop an appreciation of social justice and access to justice issues and have a heightened awareness of the operation of the justice system, law reform and policy issues. The skills learnt in this unit will be useful for students who wish to practice law, along with students interested in policy, government and social justice career pathways. Students will develop the capacity to be flexible, adaptable, independent legal practitioners.","enjoyResponse":4,"faculty":"Faculty of Law","unitCode":"LAW5050","eftsl":0.25}