{"preqs":"LAW5003 Principles of torts (or equivalent)","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {LAW5003, LAW7266}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7467}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["First semester 2017 (Evening)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Current issues in torts","description":"This unit will build upon the study of Torts in the undergraduate and JD programs and explore a range of controversial contemporary issues in relation to tortious liability. It will enhance student\u0027s understanding of the mechanisms through which torts law addresses civil wrongs. It will analyse the social, economical and political constraints in which torts law operates and how they find reflection in liability rules. Where appropriate, the unit will have regard to materials from other jurisdictions and adopt a comparative approach.The issues considered may vary, depending on topicality, and lecturer and student interest in a given year. They are likely to include some or all of the following: The Ipp reforms and the role of statute Developments in liability for psychiatric harm Liability for infliction of mental distress Privacy law reform Changes to the concept of causation in tort Loss of chance Wrongful birth and wrongful life Immunities Torts and human rights.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5407","eftsl":0.125}