{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 06PG, 07G, 07PG, 50PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed 72 credit points Otherwise true","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {LAW7119}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Term 3 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Protecting commercial innovation: Patents and trade secrets","description":"This is an important unit for any student who practises or seeks to practise in the area of intellectual property law or who works in an innovative commercial environment where research results in new products and processes. A patent provides the patentee with a critical and powerful tool for commercial exploitation of new inventions in all fields of technology. Invention is necessarily exciting and dynamic and leads to cutting edge innovation in such areas as biotechnology, nanotechnology, medical and therapeutic devices and treatments, business methods and systems and internet related inventions. The grant of patent monopoly rights provides the owner with a powerful tool that directly impacts on competition. A patent can have significant implications for users and the public in general who seek access to new technology on reasonable terms.An essential feature of the patent system is the public disclosure of the invention in return for the patent monopoly but the use of that information is restrained by the scope of the patentee\u0027s exclusive rights. The equitable doctrine of breach of confidence provides an alternative form of protection for inventions where secrecy is maintained.This unit teaches the fundamental principles of patent law and the laws that protect trade secrets in an interactive manner and with recourse to both legal and practical materials that aid understanding and appreciation of the underlying concepts and policy issues.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5321","eftsl":0.125}