{"preqs":"LAW5014","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {03, 04, 05, 06, 06G, 06PG, 07G, 07PG} owned by {50000567}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE IN {3387, L6005} Do Must have passed an (I/W) unit in {LAW5014} Otherwise true","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Advanced administrative law","description":"Administrative law determines what governments can and cannot do.  It is a dynamic and rapidly changing area of law and practice. This unit will enable students to understand key issues affecting contemporary administrative law, how and why the law is changing, and what those changes might bring.The unit will cover three key contemporary questions in administrative law.  The first is whether and how public law does and should take account of commercial issues.  This part of the course will ask whether administrative law remedies such as judicial review should apply to private sector bodies that perform \"quasi-public\" functions.  It will also consider whether judicial review and other administrative law remedies should apply, or be modified, to government decisions that could be regulated by other commercial law principles. Should judicial review apply to government tendering decisions?  Are notions of \"commercial in confidence\" a sound reason to withhold details about government contracts from the public?  Should companies have standing in administrative law to challenge government decisions which benefit competing companies?The second key issue the course will consider is whether the courts are always the best forum to challenge government decisions.  Public law remedies traditionally involve one party who challenges a single decision, but many decisions are \"polycentric\" because they raise many issues and affect many people.  This part of course will examine those \"polycentric decisions\", such as planning and revenue decisions, and consider why some decisions are less suited for review by courts and tribunals than are other decisions that are not polycentric (or, at least not polycentric to such an extent).  It will also compare the position in Australia with that in England where the courts have developed legal principles to regulate public consultation.The third issue the course will consider concerns national security - how, when and why issues of national security can affect administrative law review?  This problem has emerged as governments in Australia and other common law jurisdictions have sought to limit the rights of people to challenge decisions, or receive information, in cases involving national security.  This part of the course will examine those decisions in Australia where normal rights of review by the courts or tribunals are limited for reasons of national security.  This part of the course will also consider when and how the Australian Constitution might require a minimum level of fairness in such cases.","enjoyResponse":0,"faculty":"Faculty of Law","unitCode":"LAW5449","eftsl":0.125}