{"preqs":"","creditPoints":6,"rules":[{"startDate":"11/11/2013","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"For COURSE_CODE IN {3278, 4642} Do (Any co-req (I/W) unit in {MTH2010, MTH2015} and Any co-req (I/W) unit in {MTH2032}) Otherwise Any co-req (I/W) unit in {ENG2092}","endDate":"31/12/2015"},{"startDate":"11/11/2013","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {MAE1041} and  Must have passed an (I/W) unit in {MAE1042})","endDate":"31/12/2015"},{"startDate":"11/11/2013","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {MEC2404}","endDate":"31/12/2015"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {MEC2404}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.15,"learnScore":3.669980507,"learnResponse":35,"proh":"MEC2404","scaBand":2,"unitName":"Aerodynamics I","description":"This unit develops the student\u0027s physical and analytical understanding of the bases for aerodynamic flows and translates that into the ability to formulate, analyse and solve aerodynamic problems. It covers an introduction to the concept of a fluid and the continuum hypothesis. Definition of aerodynamic variables and coefficients. Introduction and description of fluid flow kinematics, and the application of this knowledge to the design and use of pumps, fans and compressors. Introduction of conservation principles and their application to the development of the governing equations for incompressible inviscid aerodynamic flows based on the ideas of control mass and control volume. Development of Bernoulli\u0027s equation. Solution of the governing Laplace equation for fundamental potential flows and the application of the principle of superposition to derive the solution of complex aerodynamic flows. Development and application of thin airfoil theory for infinite wings, and lifting line theory for finite wings. Introduction to the panel method for the analyses of general three-dimensional incompressible inviscid flow over twisted and delta wings.","enjoyResponse":15,"faculty":"Faculty of Engineering","unitCode":"MAE2404","eftsl":0.125}