{"preqs":"MBA5212","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {B6016}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {MBA5212}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MBA5213}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Technology, innovation and entrepreneurship","description":"The rapid rate of technological change in an increasingly knowledge-based society highlights the need for advanced technological capability, innovative thinking and practice, and entrepreneurial capability. For management students, a sound understanding of the application of science and engineering technologies to social and economic problems is necessary to function in sophisticated, technology-led business environments. The unit will draw on the expertise and experience of colleagues in a range of university faculties and research centres to provide an overview of cutting-edge developments, and related issues such as managing commercialisation and intellectual property, in fields such as life sciences, medical devices, information systems, energy, materials science and nanotechnology.The complex technological business environment requires modern executives to understand innovation processes and to develop both an entrepreneurial mindset and entrepreneurial competencies. Through the application of innovative thinking and techniques, the unit advances the entrepreneurship agenda at individual, organisational and institutional levels.A minor project integrates the streams in the unit in a practical application.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"MBA5213","eftsl":0.125}