{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MBA5112}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {B6016}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"MBA 1","description":"Topic 1 - Business models and strategyBusiness models describe how organisations are configured to create, deliver and appropriate value. In the modern world, technology and globalisation are among the primary forces disrupting existing models in every sector of the economy, and executive leadership requires an understanding of this complexity. New systems that combine hardware, sensors, data storage, microprocessors, software, and connectivity impact industry structure and the nature of competition; businesses are increasingly facing new competitive opportunities and threats. Industry boundaries are being reshaped and entirely new industries are being created. This unit introduces and examines business models, the infrastructure and technologies of business, forces of change in the business and competitive environment, the impact on business models and business strategy initiatives and responses.Topic 2: Markets and customersMarkets and customers focuses on analysing markets, customer behaviour and related business strategy, and on developing and executing marketing strategy. In an interactive digital environment, consumer and organisational buying behaviour is critically altered, and appropriate models of marketing are required. The unit explores market orientation, market research and analysis, marketing planning and marketing implementation in a range of contemporary contexts, including industrial and consumer markets and private and public sectors. It also looks at the contribution of marketing activity and thinking to other business functions and activities, including stakeholder and relationship strategy, and takes a strategic approach to marketing leadership.Topic 3: Financial and managerial accountingProfessional managers in every discipline need to understand the role of the accounting function in organisations. Financial and managerial accounting introduces the processes and techniques that enable managers to plan and control organisational activities and make informed, value-enhancing decisions. From a strategic perspective, the topic explores financial performance by introducing a range of techniques used by internal and external stakeholders to assess firm value. It also explores the role of accounting in planning, decision making and performance evaluation, and introduces a range of tools to understand cost behaviour, product pricing, budgeting and performance measurement.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"MBA5112","eftsl":0.25}