{"preqs":"MBA5112","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MBA5212}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 1 (I/W) units in {MBA5112} with grades other than {STANDARD-DEF, STANDARD-NS}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {B6016}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"MBA 2","description":"Topic 1: Operations and project managementThe success of practising managers in designing and delivering project outcomes in their roles is a critical factor in their career success. In high-technology environments, shorter product and service cycles require a leadership focus on agility, quality and flexibility. This unit provides students with the concepts, techniques and tools to design, analyse and improve their operational and project management capabilities. To manage complex projects effectively, students will study and practice the roles of initiating, scoping, coordinating and implementing complex projects in dynamic situations. The pedagogy will include a range of cases and applications. Design thinking is increasingly influential in the field of innovation and organisational development, and will be an integral part of the unit.Topic 2: Economics and societyThe economic lens for reasoning in business is a critical understanding for practising executives and business leaders. In a turbulent, global economy, tackling macroeconomic challenges such as sustainable models, demographic shifts, climate change and income inequality demands economic literacy. This unit covers the main macroeconomic and microeconomic issues for business organisations, including market structures, supply and demand functions and pricing concepts. The importance of social relationships to economics is addressed, and the relationship between economics and politics is explored in the area of the regulatory environment. To access the most advanced ideas in this broad-based field, the unit will draw on the expertise and experience of university colleagues in relevant faculties and related research centres where required.Topic 3: Business financeBusiness finance introduces the resourcing theories and practices that contribute to the sustainable, strategic management of organisations. The unit takes a value-impacting approach to interrelated issues of investment, financing, budgeting and operations. Drawing on cross-disciplinary perspectives and recent advances in theory and practice, Business finance develops frameworks for analysis and decision-making of relevance to executives and managers in contemporary organisations. The unit examines how financial and economic information is used to gain forward intelligence on the ability of the organisation to create sustainable value. An experiential, case-based pedagogy is adopted.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"MBA5212","eftsl":0.25}