{"preqs":"MBA5212","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 1 (I/W) units in {MBA5212} with grades other than {STANDARD-DEF, STANDARD-NS}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {B6016}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"MBA 3","description":"Topic 1: Organisational transformationExternal and internal environmental change can require organisations to respond with major adjustments to their structure, processes and identity. Organisational change management programs can be complex and difficult; when the situation calls for fundamental and rapid adaptation, the transformation agenda becomes high-level, strategic and immediate.Understanding the systemic relationships between mission, values, strategy, technology, systems and culture requires a deep understanding of organisational behaviour and design. To lead a review and reinvention of an organisation facing critical challenges demands a thorough knowledge of transformation processes. This unit explores and integrates the political, leadership, strategy and integration processes and capabilities required for successful transformation.Topic 2: Business analyticsUnderstanding the sources, uses and value of the flow of information through an organisation can give executives a competitive advantage and drive their innovation. Firms can leverage deep insights into business performance to enhance their value proposition and competitiveness. Business analytics focuses on providing students with a managerial knowledge of the tools, methods and practices used to understand the vast amounts of data available to businesses, and its use in forecasting and in making strategic and operational business decisions. Descriptive and predictive analytics are explored, data mining and data visualisation techniques are addressed, and a wide range of cases are used to demonstrate the application of models and techniques.Topic 3: Global business strategyIn a globalising world, conducting business is increasingly complex. Organisation leaders require robust models to understand globalisation and the implications for 21st century firms. Companies must understand the political, economic and social environments in which they operate. To engage globally, executives need to address a range of critical issues relating to the internationalisation of their business. These include marketing internationally, choosing locations for key activities, new ways of organising international business, and processes for managing across borders.The aim of the unit is to prepare students to manage effectively in a global, interconnected world. it examines the changing international environment for business, the dynamics of international competition, international relations and government-business interactions and the principles and practices of global business strategy. Further, the unit helps the student to develop the ethical and cross-cultural mindset and competence to succeed in global business. Cases and applications address models of global business and the management of innovation in multinational companies and settings; expert policy-makers and practitioners in the field will contribute to the unit.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"MBA5312","eftsl":0.25}