{"preqs":"MBA5213","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MBA5313}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {B6016}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 1 (I/W) units in {MBA5213} with grades other than {STANDARD-DEF, STANDARD-NS}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"MBA Labs: Technology and entrepreneurship project","description":"The MBA Labs: Technology and entrepreneurship project reflects the innovative, applied and research-oriented ethos of Monash University. The MBA Labs will function as a business laboratory, in which ideas are tried and tested, critiqued and improved. The spirit of discovery, enterprise and progress will be evident in the process and the outcomes; the cycle of practice and reflection will exemplify the experience.In the second MBA applied consulting project, students integrate their knowledge of Modules 1 and 2 to address the opportunities and/or challenges of host business organisations. Under the supervision of their professors, and with the support of a nominated project sponsor, student teams identify a significant innovation/entrepreneurship issue for their host organisation in a high-technology sector, and combine their accumulated knowledge of management theory and consulting practice to tackle the issue. The project may have a commercial or community purpose. As an alternative to working with a host, student teams may regard MBA Labs: Technology and entrepreneurship project as an incubator and propose their own venture. The output is a presentation and report for the sponsor.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"MBA5313","eftsl":0.125}