{"preqs":"MBA5312","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MBA5413}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 1 (I/W) units in {MBA5312} with grades other than {STANDARD-DEF, STANDARD-NS}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {B6016}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"MBA Labs: International business project","description":"The MBA Labs: International business project reflects the innovative, applied and research-oriented ethos of Monash University. The MBA Labs will function as a business laboratory, in which ideas are tried and tested, critiqued and improved. The spirit of discovery, enterprise and progress will be evident in the process and the outcomes; the cycle of practice and reflection will exemplify the experience.In the third MBA applied consulting project, students integrate their knowledge of earlier modules to address the opportunities and/or challenges of host business organisations in an international marketplace. Under the supervision of their professors, and with the support of a nominated project sponsor, student teams identify a significant strategic issue for their host organisation in an international market. Desk and field research is undertaken in the domestic market before further work is conducted in the international market; students combine their accumulated knowledge of management theory and consulting practice to tackle the issues. As an alternative to working with a host organisation, student teams may regard MBA Labs: International business project as an incubator and propose an international project for their own venture. The output is a presentation and report for the sponsor.","enjoyResponse":0,"faculty":"Faculty of Business and Economics","unitCode":"MBA5413","eftsl":0.25}