{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {0099, 1759, 2677, 3900, M6006}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {MFM1007}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MCM9207}","endDate":""}],"locationAndTime":[{"location":"Not Offered in 2017","time":[]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"MFM1007.","scaBand":3,"unitName":"Child health","description":"Primary care involves providing health care to patients across a variety of age groups. It is important to understand, however, that child health issues differ from the health issues of adults. The child health unit will focus on children aged 0-14 years. Health professionals working with children in this age group require knowledge and skills which are different to those skills utilised when managing adults. The child health unit recognises this need and aims to build on the existing knowledge of health professionals who work with children in the primary health care setting. It addresses aspects of child health commonly encountered in primary care and includes the initial management of common paediatric emergencies and developmental assessments. The child health unit focuses on a systematic and evidence-based approach to child health issues, comprehensive management plans that include carers of children and various health professionals, and the assessment and management of children in the context of their psychosocial and physical environment.The child health unit has been designed for general practitioners, family medicine specialists, nurses and allied health professionals who work with children in the primary health care setting. The child health unit runs over 12 sessions. It is run as an interactive case-based and clinically-focussed unit to ensure relevance to all students of varying health professional backgrounds and geographical location. By the completion of the child health unit, students should be well equipped with the knowledge and skills for the systematic assessment and initial management of common presentations within the student\u0027s own primary health care setting.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"MCM5507","eftsl":0.125}