{"preqs":"Successful completion of Design Fundamentals Studio (MDC4500); recognition of advanced standing or by permission","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {MDC4001, MDC4002}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {F6002}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {MDC4500}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"MDC4001, MDC4002","scaBand":1,"unitName":"Collaborative design studio 1","description":"This unit engages the student in sophisticated concepts around understanding a collaborative and interdisciplinary approach to design problem solving. Students engage set topics that are multi-faceted and human-centred. The student is guided through a process of evaluating and determining appropriate design research methodologies. This includes an appreciation of the core principles of the physical, semantic and cultural implications of design outcomes. Students will collaborate on projects and bring their personal skill sets together towards a unified and comprehensive solution to their set problem. As such student learning will be enhanced by peer-to-peer engagement as well as professional feedback in the evolution of their collaborative approach. Students learn to define design goals and objectives and apply a variety of media in order to realise them. Students are encouraged to apply theoretical learning with an experimental approach to problem solving. Project work is presented in detailed print, model, digitally mediated or prototypical form where appropriate.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"MDC4130","eftsl":0.25}