{"preqs":"Admission to the double award Master of Industrial Design with South East University, China.","creditPoints":12,"rules":[{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""},{"startDate":"1/09/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3122}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (On-campus block of classes)"]},{"location":"City (Melbourne)","time":["First semester (extended) 2017 (On-campus block of classes)","Second semester 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Design project (part 1)","description":"This unit represents the first of a multi-part design project. In most instances the project is to be determined by the students at the beginning of the semester in consultation with their lecturer. The outcomes of the project undertaken will vary depending upon the individual objectives established by the students and teaching staff. The unit provides an opportunity to undertake conceptual designs which will lead to the development of these ideas in the subsequent Design Projects.  Students should be particularly concerned with the development of their personal design philosophy, the way in which it responds to social needs and its visual and social expression as a preliminary to its virtuoso development in the major project. The contemporary discourse in design and related theory is actively discussed and debated, with students encouraged to develop a personal position relative to it. Both the intentions of students and the results of their work are debated in group discussions and critical sessions. This unit is only available to students enrolled in the double award Master of Industrial Design with Southeast University, China.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"MDC4100","eftsl":0.25}