{"preqs":"MDC4120, or by permission","creditPoints":18,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {MDC5210}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {F6002}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {MDC4201, MDC4202, MDC4215, MDC4216, MDC5201, MDC5215}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Day)","Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"MDC4201, MDC4202, MDC4215, MDC4216, MDC5201, MDC5215","scaBand":1,"unitName":"Interaction design studio 3","description":"This unit aims to consolidate learning from previous studio units in the Interaction Design specialisation sequence and completes the technical, cognitive and creative skills required to design for industry. Students will be designing interactive artefacts, systems or services based on equivalent industry projects; or working on actual industry problems. They will be exposed to specific and relevant industry and/or social issues; and required to produce innovative solutions that weave together technology, place and product and user.The unit encourages experimentation and skill development with tangible materials and interactive technology via data gathering, analysis, evaluation and design. Students will produce high quality designs that examine the extension of physical artefacts and tangible interfaces as elements of connectivity that help users to mediate between the real and digital worlds.The project supports students in a broad range of interests, including the application of advanced technologies, electronics and programming, physical or virtual interface manipulation, and material and engineering fabrication.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"MDC5310","eftsl":0.375}