{"preqs":"(MEC2404 or MAE2404) and 120 credit point","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE IN {4688, E6001} Do Any co-req unit set {MAE-MECH, MAEMECH01} Otherwise true","endDate":""},{"startDate":"7/08/2013","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE IN {4688, E6001} Do true Otherwise Must have passed an (I/W) unit in {MAE3401, MEC3451}","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"For COURSE_CODE IN {4688, E6001} Do true Otherwise (Must have passed a unit in {MAE2404, MEC2404} and  Must have passed 120 credit points)","endDate":""},{"startDate":"7/08/2013","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"For COURSE_CODE IN {4688, E6001} Do Any co-req unit set {MAE-MECH, MAEMECH01} Otherwise true","endDate":"31/12/2016"}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.590909091,"learnScore":4.504761905,"learnResponse":12,"proh":"","scaBand":2,"unitName":"Wind engineering","description":"This unit introduces aerodynamic concepts applicable to both wind energy and wind engineering. It conveys the fundamentals of the wind environment, and how the wind interacts with both turbines to generate power, and structures to cause loads.The unit will be conveyed in three sections: the wind environment, wind energy and wind engineering.Wind engineering is a broad field that concerns the manner that the wind resource can be understood and harnessed for the benefit of society, and the need to understand the potential damaging effects for design purposes, such as wind effects on structures. Examples of wind engineering areas include the effect of wind on structures and their surrounding environment, building ventilation, pollution dispersion, and energy production from wind.Students will first develop an understanding of the natural wind environment, which is essential to both the assessment of the performance of wind turbines and the estimation of structural wind loads. The significance of the wind environment to engineering problems, both structural and mechanical, is explored. The section on wind energy aerodynamic considers the science associated with the production of power from the wind. An understanding of the wind resource and the aerodynamics of wind turbines, including turbine performance, analysis methods, wind turbine siting, and blade / component loading will be developed.  The wind engineering section is primarily concerned with understanding wind effects on structures, although other wind engineering problems such as pedestrian level winds, pollutions dispersion and wind-generated noise are discussed. The techniques (including wind tunnel and code based) available to the engineer when estimating wind loads are introduced and applied providing experience in solving practical engineering problems.","enjoyResponse":24,"faculty":"Faculty of Engineering","unitCode":"MEC4459","eftsl":0.125}