{"preqs":"","creditPoints":24,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {4531, 4533, M6011, M6019}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {MED1011%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"Malaysia","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Medicine 1","description":"MED1011 will introduce students to the four themes (sub-units) upon which the five-year curriculum is based:THEME I: Personal and Professional Development: students will participate in a transition program, focusing on transition to university life, personal ethics, healthy lifestyle, group support and communication skills. This will be followed by a Health Enhancement program concentrating on self care (stress management, relaxation training, coping skills), other aspects of healthy lifestyle and group support, and introduction to the science of Mind-Body Medicine. Also included: an introduction to Ethics and Medical Law.THEME II: Population, Society, Health and Illness: Health, Knowledge and Society Teaching will provide a framework of inquiry allowing analysis of the social aspects of medicine.THEME III: Foundations of Medicine: The Fabric of Life provides students with foundation knowledge in genomics and cell biology in health and disease. An integral part of this theme will be the weekly problem based  learning activity(PBL). Each PBL integrates material presented to students in this and other themes throughout the week.THEME IV: Clinical Skills: introduces students to practical clinical skills including: handwashing, sharps disposal; subcutaneous and intramuscular injecting. Students will interact with health care professionals during medical contact visits, and will be introduced to the medical interview, taking a family history, ethical aspects of medical contact visits.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"MED1011","eftsl":0.5}