{"preqs":"MED1011, MED1022.","creditPoints":24,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {MED1011, MED1022}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {4531, 4533, M6011, M6019}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {MED2031%}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"Malaysia","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Medicine 3","description":"Through the theme based curriculum, this unit continues to provide integrated studies that build the foundations for commencing studies in clinical settings.  A deeper understanding of the socio-economic context of health and illness, awareness of the non-medical services which support the practice of medicine, and improved health outcomes is developed.  Ethical/legal issues relevant to professional responsibility, the doctor-patient relationship and public accountability link directly to future clinical practice. Students acquire skills in basic research, including data management and critical appraisal of evidence and knowledge which provide the basis for evidence based clinical decision-making.  Scientific basis of clinical practice aims to provide students with detailed knowledge of selected body systems in health and disease.  In the clinical skills component of the curriculum, students are expected to draw upon theoretic knowledge, and apply this during the development clinical reasoning, and the performance of key clinical skills tasks. An integral component of this unit is the weekly problem based learning activity (PBL). Each PBL integrates content presented to students across the four themes throughout the week.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"MED2031","eftsl":0.5}