{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3565, M60018}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MID9005}","endDate":""}],"locationAndTime":[{"location":"Peninsula","time":["First semester 2017 (Flexible)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Advancing midwifery practice","description":"Advancing Midwifery Practice is a 12 Credit Point theory and practice unit designed to meet the needs of students wishing to develop advanced midwifery skills and knowledge within particular contexts. Midwifery practice in Australia and overseas is increasingly faced with women requiring technological solutions to complex clinical situations. Obstetrics as a profession is shrinking in numbers, and the impact of a lack of professional indemnity insurance has forced the reordering of maternity services. Government policies and reports advocate for an increased role for midwifery in the provision of maternity services at all levels of risk. In many countries around the world midwifery is at the forefront of a range of complexity of maternity care, but the preparation of midwives for complex practice is ad hoc and poorly realised.This Unit aims to prepare midwives with the knowledge for skills development in complex clinical situations. The unit is structured to allow flexibility and individualisation of the content to better meet the needs of individual practitioners and their practice settings. Theoretical knowledge will include pathophysiology, technology, evidence and practice issues related to skills clusters. These clusters include: Prenatal, Perinatal, Postnatal and High Risk.Opportunities will be given for students to participate in an inter-professional workshop with medical students to acquire some complex clinical skills. Students will understand the requirement and processes necessary for evidence based practice and will gain skills for its implementation in an environment that might be resistant. Students will have the opportunity to critique self and context in relation to evidence in practice. Students will also identify potential for developing collegial and collaborative relationships to other maternity service providers within a practice setting (eg medical practitioners, allied health professionals, nurses and community groups). Portfolio of work, tutorial presentations and participation.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"MID5005","eftsl":0.25}