{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"For COURSE_CODE NOT IN {2312, 3896, M4002, M6026, M6027} Do Any co-req (I/W) unit in {MPH5040} Otherwise true","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {MPH6041}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {0046, 0160, 0702, 1884, 2311, 2312, 2314, 2868, 2870, 2872, 3198, 3403, 3416, 3420, 3421, 3422, 3440, 3807, 3862, 3873, 3874, 3896, 3900, M4002, M4006, M5007, M6008, M6023, M6024, M6026, M6027, M6028}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MPH1031%, MPH1041%}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["First semester 2017 (Day)","First semester 2017 (Off-campus)","Second semester 2017 (Off-campus)"]}],"enjoyScore":4.666666667,"learnScore":4.155555556,"learnResponse":8,"proh":"MPH6041.","scaBand":2,"unitName":"Introductory biostatistics","description":"This unit  introduces students to biostatistics as applied to public health and  management studies. Biostatistics is the science of describing, summarising, and analysing health-related data. It is essential to understand biostatistics in order to  design, conduct, and interpret health-related research. The basic principles and methods used in biostatistics are covered in this unit. This includes the technical qualifications necessary for analysing and interpreting data on a descriptive and bivariate level.Topics include classifying health data; summarising data using simple statistical  methods and  graphical  presentation; sampling distributions; quantifying uncertainty in results from a sample; working with statistical distributions; comparing two or more groups/methods using confidence intervals and hypothesis tests (p - values); assessing the association between an outcome and an exposure using the chi-squared test; using risk comparisons (RR and OR); predicting an event or identifying risk factors for an event of interest where the event is measured on a continuous scale or a binary scale (yes/no).","enjoyResponse":15,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"MPH5041","eftsl":0.125}