{"preqs":"Students will be required to have basic computer literacy skills using Microsoft Windows, Word, Excel, and have access to a calculator equipped with elementary scientific functions (such as the Casio FX-100 calculator) and a statistical package for data analysis (support will be available for software package IBM SPSS).","creditPoints":0,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {02, 03}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {MPH5041}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["First semester 2017 (Day)","First semester 2017 (Off-campus)","Second semester 2017 (Off-campus)"]}],"enjoyScore":4.142857143,"learnScore":3.333333333,"learnResponse":1,"proh":"MPH5041.","scaBand":2,"unitName":"Introductory biostatistics","description":"This unit introduces students to biostatistics as applied to public health and  management studies. Biostatistics is the science of describing, summarising, and analysing health-related data. It is essential to understand  biostatistics in order to  design, conduct, and interpret health-related research. The basic principles and methods used in biostatistics are covered in this unit, including the technical qualifications necessary for analysing and interpreting data on a descriptive  and  bivariate level.Topics  include classifying health  data; summarising data using simple statistical methods and graphical presentation; sampling  distributions; quantifying uncertainty in results from a sample; working with statistical distributions; comparing two or more groups/methods using confidence intervals and hypothesis tests (p - values); assessing the association between an outcome and an exposure using the chi-squared test; using risk comparisons (RR and OR); predicting an event or identifying risk factors for an event of interest where the event is measured on a continuous scale or a binary scale (yes/no).","enjoyResponse":18,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"MPH6041","eftsl":0}