{"preqs":"","creditPoints":0,"rules":[{"startDate":"20/06/2014","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {MTE5881}","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {02, 03}","endDate":""},{"startDate":"20/06/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {02, 03}","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {MTE5881}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.3,"learnScore":4.085111748,"learnResponse":80,"proh":"","scaBand":2,"unitName":"Advanced materials characterisation and applied crystallography","description":"The scattering of different types of radiation from crystalline materials gives fundamental insight into materials properties at various length scales, beginning with atomic structure and culminating in interatomic bonding. The unit will be taught as a series of modules covering essential knowledge in each area of diffraction (X-ray diffraction, electron diffraction, and neutron diffraction), including a solid coverage of crystallography and how it is applied in all of the characterisation techniques that reside within each of these areas of diffraction.The unit explores the complementarity of the different techniques and radiations through strategically aligned laboratory classes. The data collected in each lab session, from different experiments and instruments, will be combined throughout the course of the unit with the aim of solving a real materials science problem that is of current interest or a hot topic.Approximately 50% of this unit is based on the flipped classroom, and data analysis from laboratory sessions will be carried out in workshop-style tutorial sessions using the knowledge and instruction gained from the online modules.","enjoyResponse":10,"faculty":"Faculty of Engineering","unitCode":"MTE6881","eftsl":0}