{"preqs":"Students must be enrolled in the Master of Financial Mathematics or have passed one of the following units: MTH2222, MTH2232 or ETC2520","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE NOT IN {S6001} Do Must have passed an (I/W) unit in {ETC2520, MTH2222, MTH2232} Otherwise true","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MTH3260}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Statistics of stochastic processes","description":"Many practical experiments involve repeated measurements made over a period of time, where the individuals or systems being observed are evolving during the study period.  Examples of this kind of data arise in signal processing, financial modelling and mathematical biology. For experiments of this kind, standard statistical methods that assume data points are independent and identically distributed (iid) are of limited value, due to dependencies among measurements. This unit will introduce statistical methods for such processes.Topics: Review of fundamental statistics: their distributions, properties and limitations; Stochastic Processes: Markov, ARMA, Stationary and Diffusion Processes; Likelihood models, Graphical models, Bayesian models; Decision theory, Likelihood ratio tests, Bayesian model comparison; Sufficient statistics, Maximum Likelihood Estimation, Bayesian Estimation; Exponential families; Convergence of random variables and measures; Properties of estimators: bias, consistency, efficiency; Laws of Large Numbers and Ergodic Theorems, Central Limit Theorems; Statistics for Stationary Processes; Statistics for ARMA Processes; Statistics for Diffusion Processes","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"MTH3260","eftsl":0.125}