{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {NUR9204%}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {0099, 1250, 1251, 2677, 3565, 4534, M60018, M6006}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {MFM5007}","endDate":""}],"locationAndTime":[{"location":"Peninsula","time":["First semester 2017 (Flexible)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Education in health care practice","description":"This unit examines contemporary issues impacting on education for health care practitioners, within a context of continuous change. Students explore a range of theoretical underpinnings that impact upon the educational process in health care practice with emphasis placed on educational theorists. Students will apply theoretical learning to teaching practice through participation in practicum; or through their role as a teacher within their own clinical practices. This will include both classroom (small and large group) and clinical teaching experiences in a variety of settings. It will equip students with the knowledge and mastery of skills necessary to critique, understand and respond to the learning preferences and needs of those whose education they have responsibility for. It will prepare students with the skills and knowledge to critically evaluate and assess the outcomes of an educational intervention. It will offer students a theoretical underpinning for current modelling of professionalism, clinical competence and lifelong learning.This unit is a compulsory core unit for the Master of Family Medicine (MFM) a core unit in the Education Stream for the Master of Nursing (MN) and an elective unit in the Master of Clinical Midwifery (MCM).","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"NUR5204","eftsl":0.25}