{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {0136, 1250, 2985, 3557, 3565, 3900, 4513, M6006, P6003}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {0136, 1250, 2985, 3557, 3565, 3900, 4513, M6006}","endDate":"31/12/2016"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {NUR9208%}","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {NUR9208%}","endDate":""}],"locationAndTime":[{"location":"Peninsula","time":["First semester 2017 (Flexible)","Second semester 2017 (Flexible)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Therapeutic medication management","description":"This unit is directed at extending student\u0027s knowledge of pharmacology and explores principles covering medication management within advanced nursing practice. The first module seeks to extend students knowledge of fundamental pharmacological principles of medication management which can be adopted and utilized in the advanced practice setting. Students will use the foundational knowledge of pharmokinetics, pharmacodynamics, and therapeutics, in order to critically analyse how medications affect physiological, biochemical and pathophysiological processes. With a greater appreciation of the action of drugs on body processes, students will be able to determine which medications should be administered to particular patients in order to ensure therapeutic effects are optimized and adverse effects are minimized. Students will articulate the key pharmacological characteristics of drug classes, as well as derive an understanding of specific features of individual drugs.The second module extends students\u0027 knowledge of social, political and ethical principles of medication management, and allows the student to explore how these principles are applied in the advanced practice setting. The concepts of pain management, adverse drug reactions and medication use across the lifespan will be considered. Students will individualise the use of the clinical decision making process as the framework for gathering and organizing medication information, planning, prescribing, administering, documenting and evaluation to suit their own practice needs. Students will extend their knowledge of the learning and teaching strategies for patient education and the government policies that are relevant to nurse prescribing. Commonwealth and State laws affecting the control of medication will also be applied to the advanced practice setting. Students will address the socio-cultural and ethical issues that affect the relationship between the nurse practitioner and patient, and will examine the style and required particulars for written prescriptions. Equipped with this knowledge, students will be expected to critically review the application of clinical pharmacology to their specific area of advanced practice.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"NUR5208","eftsl":0.25}