{"preqs":"NUT1001, NUT1010, NUT1101 and NUT1102.","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3956, 4530, M2001}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 4 (I/W) units in {NUT1001, NUT1010, NUT1101, NUT1102} or  Must have passed 4 (I/W) units in {BND1001, BND1002, BND1101, BND1102})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {BND2001}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Health across the lifespan","description":"This unit focuses on health behaviours, growth and development, physical activity and nutritional requirements for groups across the lifespan from infancy to old age. It will focus on normal nutrition, physiology, physical activity and growth and development for lifespan groups  and vulnerable groups. The unit will draw on principles from psychology that will allow students to understand how health beliefs, illness and other factors impact on actions. Concepts of health education and promotion will enhance students\u0027 knowledge and ability to communicate nutrition messages effectively to groups. The unit will incorporate elements of personal and professional development such as cultural competency, social justice, translation of technical information into practical advice about food and eating, communication skills, reflection and teamwork.This unit will focus on Theme 3 (Nutrition fundamentals in Health and Disease) and Theme 2 (Determinants and Influences on Population Health and Nutrition) and Theme 2 objectives but will also include aspects of Theme 1 (Personal development and professional practice) and Theme 4 (Food: from Science to Systems) with an integrated assessment task and Theme 4 (From Science to System).Site visits to care settings such as child care and/or aged care will enhance the learning experience and provide an applied real life context to theory.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"NUT2001","eftsl":0.25}