{"preqs":"NUT2001 and NUT2002; OR HSC1101, HSC1102 and NUT1011; OR Must have passed NUT1011 and two units BCH2022, BMS2021, BMS2031, HSC1101, HSC1102, PHY2032 or PHY2042.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {NUT2001, NUT2002} or  Must have passed 3 (I/W) units in {HSC1101, HSC1102, NUT1011} or  (Must have passed an (I/W) unit in {NUT1011} and  Must have passed 2 (I/W) units in {BCH2022, BMS2021, BMS2031, HSC1101, HSC1102, PHY2032, PHY2042}))","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Nutrition controversies","description":"Nutrition controversies will focus on developing student\u0027s fundamental scientific knowledge and critical reasoning skills in the area of nutritional science. Building from earlier units that taught principles relating to evaluation of evidence and advanced research methodologies combined with a solid background in physiology, immunology and biochemistry this unit will link diet and disease outcomes using available evidence.This unit will enable nutritionists to develop an appreciation for the controversial and unresolved nature of the reported associations between dietary factors and disease processes by providing the opportunity for in-depth, critical evaluation of the underpinning evidence and identification of unresolved questions and/or alternative opinions. Examples of current nutritional controversies will be drawn from topics studied across the range of other units on the course and students allocated to two topics.Teaching activities in this unit will have an emphasis on student centered enquiry supported by a series of student-led seminars and discussions and a written synthesis of assigned topics.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"NUT3004","eftsl":0.125}