{"preqs":"Must have passed all units in NUT2001, NUT2002, NUT2102 and NUT2103;OR must have passed NUT1011 and two from BCH2022, BMS2021, BMS2031, HSC1101, HSC1102, PHY2032 or PHY2042.Master of Dietetics students are exempt from pre-requisites.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"For COURSE_CODE NOT IN {M6002} Do (Must have passed 4 (I/W) units in {NUT2001, NUT2002, NUT2102, NUT2103} or  (Must have passed 1 (I/W) units in {NUT1011} and  Must have passed 2 (I/W) units in {BCH2022, BMS2021, BMS2031, HSC1101, HSC1102, PHY2032, PHY2042})) Otherwise true","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.272727273,"learnScore":4.166666667,"learnResponse":11,"proh":"","scaBand":2,"unitName":"Nutrition, activity and health in chronic diseases","description":"Diet and disease is an integrated study of the role of diet in the causation and treatment of chronic diseases that are endemic in westernised societies. This unit builds upon the scientific concept of disease aetiology explored in Integrated Science Systems (BND2103) and the critical interpretation of scientific literature and research skills developed in years 1 and 2. Learners will explore the epidemiology of the major nutrition related diseases, their causal pathways and population based recommendation for prevention. The rationale for the application of dietary modifications for patients with specific disease states and the means of evaluating dietary treatment is explored. Nutrition related emerging issues in disease aetiology and management are also explored and the emphasis on the important role of genetic susceptibility in nutrition science is continued.Student centered teaching and learning methods will be used to support the delivery of the unit content. Students\u0027 participation as adult learners will be encouraged through the curricula with emphasis on extending their scientific communication skills.","enjoyResponse":27,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"NUT3002","eftsl":0.125}