{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {M6002}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {BND1001, NUT1001, NUT3005}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any 2 (I/W) co-req units in {NUT3002, NUT3082}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4,"learnScore":4.166666667,"learnResponse":3,"proh":"NUT1001, NUT3005.","scaBand":2,"unitName":"Foundations of dietetic practice","description":"This unit introduces students to the profession of dietetics, commencing their pathway to becoming experts in food (knowledge and application) and culturally competent, self-aware healthcare professionals. This unit is tailored for the non cognate path for Masters of Dietetics (96CP) under  the course architecture project. Students coming through the cognate path will receive credit for this subject and be eligible to proceed into the 72 CP Masters program.The unit initially focuses on health behaviours, assessment of nutritional status, growth and development, physical activity and nutritional requirements for groups across the lifespan from infancy to old age. The unit will incorporate elements of professional development, cultural competency about food and eating patterns, and content around the Australian food supply system including food regulation and law.Concepts of health education and promotion will enhance students\u0027 knowledge and ability to communicate nutrition messages effectively to groups and individuals as well as teamwork and reflection. Students will be introduced to reflective practice, commencing a professional portfolio and will be engaged via adult learning teaching and learning principles as  they begin to develop their professional identity.","enjoyResponse":16,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"NUT4001","eftsl":0.25}