{"preqs":"NUT5001.","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {NUT5001}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {NUT5003}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {M6002}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":2.857142857,"learnScore":3.636342593,"learnResponse":47,"proh":"","scaBand":2,"unitName":"Food for dietetic practice","description":"This unit is focussed on extending students\u0027 food composition, food therapeutic and food systems knowledge to support dietetic practice with integration and application in the practical and placement setting. There is extension of students\u0027 research and problem solving skills in managing placement based food service challenges. Students\u0027 personal and professional competencies are further developed. This unit supports fulfilment of prescribed competencies as outlined by the Dietitians Association of Australia. The teaching and learning strategies will encompass lectures, group teaching, tutorials, practical sessions, self-directed learning and a placement based project. Placement may take place outside of regular semester times. Students must have valid police check, WWC check and immunisation certificates in order to participate in clinical placementsThe key themes explored in this unit are Theme 4: Food from Science to Systems and Theme 3: Fundamentals of Health and Disease, coupled with partial integration of content and application from Theme 1: Personal Development and Professional Practice and Theme 2: Determinants and Influences on Population Health and Nutrition.","enjoyResponse":23,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"NUT5004","eftsl":0.25}