{"preqs":"BMA1901, BMA1902, IPE1011, OCC1011, OCC1012, OCC1022, OCC1021, OCC1032, OCC2011, OCC2020, OCC2022.","creditPoints":12,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3869, M3001}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 11 (I/W) units in {BMA1901, BMA1902, IPE1011, OCC1011, OCC1012, OCC1021, OCC1022, OCC1032, OCC2011, OCC2020, OCC2022}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OCC3052}","endDate":""}],"locationAndTime":[{"location":"Peninsula","time":["Second semester 2017 (Day)"]}],"enjoyScore":4,"learnScore":3.845651081,"learnResponse":24,"proh":"","scaBand":2,"unitName":"Occupational therapy honours research project 1","description":"The Bachelor of Occupational Therapy (Honours) research project program has been designed to enable students to effectively integrate research knowledge and skill with occupational therapy practice knowledge and skill. The program incorporates advanced education in qualitative and quantitative research methodologies through the development and completion of a research project. The research project undertaken will require students to formulate a research aim and/or question/s, complete a literature review, design an appropriate methodology to answer the research question/s, complete an ethics application, and gather and analyse the required data, discuss the results in relation to pertinent literature and professional practice, and develop conclusions and recommendations. The Honours program has been structured to enable students to understand research in the context of the issues of interest of concern in a specific organisation or service area. They will also develop an understanding of how the research project applies to the wider community. Hence each occupational therapy Honours project has a \u0027host\u0027 organisation which has a fieldwork responsibility. The student works in collaboration with the host organisation, the Monash university academic supervisor/s and other stakeholders.In OCC3072 students will spend up to two days per week in the organisation to develop the research proposal as well as engage in fieldwork activities. In OCC4091, students will spend a further up to two days per week in the organisation where the research proposal developed in OCC3072 will be implemented.","enjoyResponse":6,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"OCC3072","eftsl":0.25}