{"preqs":"OCC5050.","creditPoints":12,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {OCC5050}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {4515, M6017}","endDate":""}],"locationAndTime":[{"location":"Peninsula","time":["Term 4 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":2,"unitName":"Enabling occupation 3","description":"In this unit, students begin to shift their view beyond the occupational challenges facing individuals, to consider the ways in which the occupations, health and well-being of groups, communities, and populations\u0027 may be impacted on by social, political and organisational factors. Students apply advanced clinical reasoning and intervention skills in case based scenarios applied to groups of people and communities who are experiencing complex health and social problems rather than individuals. The cases chosen highlight the multiple approaches to occupational intervention, both individual/clinical and community/prevention.Additionally, students, individually or in pairs, will work in collaboration with a sponsoring agency to address a specific need while completing their participatory practice fieldwork placement for 2 days per week (135 hours). Students will be allocated a project identified by the agency. Students will then be guided by academic staff through the process of making initial contact with their agency and the first phase of project management, which involves collaborating with agency members to \"scope\" an organisationally useful, and occupationally relevant project or program. Students will be required to liaise with a variety of stakeholders and to develop a project proposal that meets the needs and aims of the agency. Students will develop skills in project design and management and work within a community partnership model to address a community/population health based occupational issue for the collaborating agency.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"OCC5060","eftsl":0.25}