{"preqs":"OCC4040.","creditPoints":12,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {OCC4040}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {4515, M6017}","endDate":""}],"locationAndTime":[{"location":"Peninsula","time":["Term 3 2017 (Day)"]}],"enjoyScore":3.5625,"learnScore":4.085087719,"learnResponse":48,"proh":"","scaBand":2,"unitName":"Enabling occupation 2","description":"In this second intervention unit, student will further describe, apply and critique the principles of assessment and intervention for individual and groups of clients who are restricted in their ability to engage in activities, occupations, and participate in community life. Intervention principles will also incorporate environmental supports and barriers (advocacy, organisational change, environmental adaptation) and evidence-based practice. The common characteristics of primary care will form the framework including issues of expanded access, multi-professional service teams, optimal service coordination, and a focus on patient empowerment and the application of technology to health promotion. Prevention and health promotion systems relevant to primary care will be examined, and the evidence and theoretical base for preventive (behavioural) counselling, brief interventions, health education practice, methods of tailoring strategies to client needs, motivational interviewing techniques, motivating change and preventing relapse will be explored. Approaches to adopting health promotion strategies and building capacity for health promotion in others will be explored.This unit also gives students an advanced overview of the skills necessary to critique and evaluate research evidence. Students will be introduced to methodologies related to evaluating and conducting mixed-method survey-based research using questionnaires. This will provide the foundation to integrate clinically relevant evidence into daily professional practice as well as skills to be able assist with quality assurance activities using survey methodology. A fieldwork block of 3 weeks full time will conclude the term (112 hours).","enjoyResponse":15,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"OCC5050","eftsl":0.25}