{"preqs":"PAC2331PAC2342","creditPoints":6,"rules":[{"startDate":"11/10/2010","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 2 (I/W) units in {PAC2331, PAC2342}","endDate":""},{"startDate":"11/10/2010","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {2628}","endDate":""}],"locationAndTime":[{"location":"Malaysia","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.2,"learnScore":3.836309524,"learnResponse":22,"proh":"","scaBand":2,"unitName":"Community engagement","description":"The Community Engagement (CE) is a community-based project that offers our students an unrivalled opportunity to understand issues of social justice and equity and relate these to the practice of pharmacy. Empathy in this area is an essential part of good pharmacy practice. Through the completion of a community placement, our students have the opportunity to observe the outstanding human skills of multi-disciplinary teams in a community setting and be actively involved in the work of the host agency. Through the project, students have a specific opportunity to explore community responses to social justice issues; reflect upon their own attitudes and behaviours; and relate these to an evolving understanding of the relationship between medicine, pharmacy, healthcare professionalism and social justice. The project requires students to consider their own knowledge, values and skills in relation to the impact of political, social, and economic determinants on people\u0027s lives. It will allow students to better understand the use of contemporary approaches in service delivery, and it will also serve as an opportunity to explore alternative strategies to health and well-being of their patients in their future practice.The project provides students with an opportunity to gain a unique learning experience off-campus, based within a community organisation involved in the provision of clinical, health and social care to needy individuals (see Appendix A for list of organisations). Practical involvement with their community-based placements provide an opportunity for students to understand what these organisations do, why they need to do so and how they serve individuals, families and communities. This community-centred approach will allow pharmacy students to experience health and social care issues at a grassroots level.Students will undertake a group project in their community placement under guidance of academic convenors (AA) from Monash University and field educator (FE) from the organisations involved. Both AA and FE will provide support, guidance and manage academic progress of the students\u0027 projects They will also assist students during the planning and implementation of the projects. The students will also develop skills in communicating their project work orally, visually, and in written form to fellow students, faculty, and community groups or organisations with whom they will be working. The knowledge and skills gained through the lectures and workshops, as well as through readings will be applied in the real world during the conduct of these projects.","enjoyResponse":16,"faculty":"Faculty of Pharmacy and Pharmaceutical Sciences","unitCode":"PAC3552","eftsl":0.125}