{"preqs":"Year 12 Physics and calculus (VCE Mathematical Methods or equivalent).Note: If you have not taken Year 12 Physics you should consider PHS1080 or PHS1031. If you have not taken VCE Mathematical Methods or equivalent with permission from the School of Physics and Astronomy you may be able to take MTH1010, as a co-requisite, to fulfill the calculus requirements.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {BMS1031, ENG1081, PHS1031, PHS1080}","endDate":"31/12/2015"},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {BMS1031, ENG1081, PHS1031, PHS1080}","endDate":""},{"startDate":"1/01/2006","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {ENG1081}","endDate":"31/12/2014"}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"PHS1080, PHS1031, BMS1031, ENG1081","scaBand":2,"unitName":"Classical physics and relativity","description":"In this unit you will build on your knowledge of classical (non-quantum) physics related to concepts of motion, forces, momentum and energy; including their application to oscillations, waves and thermal physics. You will also investigate the limits of applicability of classical (non-relativistic) concepts of motion where the ideas of special relativity must be applied.You will explore these concepts in the context of current technology in areas such as transportation and communication and you will also discover how these ideas link to current research in Physics.This unit will also introduce you to concepts of experimental design, measurement and analysis that form the basis of the evidence-based approach that is the foundation of scientific discoveries and theories.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"PHS1011","eftsl":0.125}