{"preqs":"PHS1011 or PHS1080 or PHS1031, and PHS1022, and MTH1030 or MTH1035 or ENG1005","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {ENG2005, MTH2010, MTH2015}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {PHS2011%}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {PHS1011, PHS1031, PHS1080} and  Must have passed an (I/W) unit in {ENG1005, MTH1030, MTH1035} and  Must have passed an (I/W) unit in {PHS1022})","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {PHS2011}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"PHS2011","scaBand":2,"unitName":"Quantum and thermal physics","description":"Quantum physics is at the core of physics and this unit provides a basis for understanding key quantum concepts, applications and associated phenomena. Thermal physics aims to understand how energy resides in matter as thermal energy, how energy moves irreversibly as heat between bodies at different temperatures, and how heat flow arises from entropy and the second law of thermodynamics; entropy is defined carefully in terms of the multiplicity of microstates of a system. Thermal physics explores how work can be interconverted with thermal energy and how entropy limits the efficiency of engines, heat pumps and refrigerators. Quantum Mechanics: the domain of quantum mechanics; particle and wave description; the Schrodinger equation, energy, momentum and angular momentum as operators, expectation values and stationary states; one-dimensional scattering and potentials, including the quantum oscillator, quantum mechanical tunnelling and quantum technologies; Heisenberg\u0027s uncertainty principle, the hydrogen atom; the Pauli exclusion principle and the periodic table; entanglement and Bell\u0027s theorem; introduction to quantum information. Thermal Physics: review of heat, work and internal (thermal) energy, phase transitions, latent heats and heat capacities; the inadequacy of heat capacities as a basis for thermometry; statisticial descriptions of a mascroscopic physical system: microstates, macrostates, multiplicity and entropy; the second law of thermodynamics; absolute temperature related to entropy; pressure related to entropy; review of PV diagrams and work in thermodynamics, especially as applied to ideal gases; adiabatic and isothermal processes; introduction to engines and the Carnot cycle; examples of thermodynamic cycles in applications; heat pumps and refrigerators; the Helmholtz free energy and an introduction to the Maxwell-Boltzmann distribution, the exponential atmosphere and Boltzmann factors; inter alia Maxwell\u0027s daemon, the thermodynamics of computation and the heat death of the Universe.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"PHS2061","eftsl":0.125}