{"preqs":"PHS1011 or PHS1080 or PHS1031, and PHS1022, and MTH1030 or MTH1035 or ENG1005","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {PHS2011}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed an (I/W) unit in {PHS1011, PHS1031, PHS1080} and  Must have passed an (I/W) unit in {PHS1022} and  Must have passed an (I/W) unit in {ENG1005, MTH1030, MTH1035})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"PHS2011","scaBand":2,"unitName":"Atomic, nuclear and condensed matter physics","description":"The atomic physics sub-unit explores the development of our current understanding of the electronic properties of atoms. Much of the fundamentals of quantum mechanics were developed in response to the difficulties of reconciling observed physical phenomena with classical physics. This sub-unit introduces the wavefunction description for electronic orbitals as applied to hydrogenic atoms, and explains the concept of atomic magnetism, including magnetic coupling, which leads to an explanation for fine and hyperfine spectroscopic structure. The origin and nature of selection rules in various atomic systems is examined.The nuclear physics sub-unit introduces a range of observable phenomena that result due to the structure of atomic nuclei, describes our current understanding of the constituents and structure of nuclei, and considers nuclear processes such as the various forms of radioactive decay, fission and fusion, and neutron-induced reactions. The concept of a reaction cross section is developed. The ubiquity and utility of conservation laws are emphasized, leading to an appreciation of the power of these tools for understanding nuclear phenomena.The condensed matter physics sub-unit examines how fundamental properties of solid matter - such as electrical, mechanical and optical properties - arise from the atomistic and electronic structure of materials. The arrangement of atoms in solids is explored via diffraction and imaging. Correlations between properties such as hardness and melting point are understood through bonding and the cohesive energy. Electrical conduction is explored in detail through a series of increasingly complex models: classical free electron theory, quantum free electron theory and band theory. Concepts such as mobility, the Fermi level and the Fermi-Dirac distribution are thereby introduced in the context of simple systems like metals before being applied to more complex systems like semiconductors. Semiconductor physics is introduced, with a focus on the quantum technologies which it underpins, including solar cells, light emitting diodes and transistors.","enjoyResponse":0,"faculty":"Faculty of Science","unitCode":"PHS2081","eftsl":0.125}