{"preqs":"PHY2011 plus one of PHY2042 or PHY2032; or BMS1052 plus one of BMS2031, BND2011 or BNS1072; or permission from the unit co-ordinator.","creditPoints":6,"rules":[{"startDate":"1/01/2007","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Must have passed 2 units in {BMS1052, BMS2031, PHY2011, PHY2021, PHY2022, PHY2032, PHY2051, PHY2062}","endDate":"31/12/2014"},{"startDate":"1/01/2007","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"((Must have passed an (I/W) unit in {PHY2011} AND Must have passed an (I/W) unit in {PHY2021, PHY2032}) OR (Must have passed an (I/W) unit in {BMS1052} AND Must have passed an (I/W) unit in {BMS2031, BND2011, BNS2022, PHY2032}))","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {PHY3012%}","endDate":""},{"startDate":"1/01/2007","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {PHY3012%}","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"((Must have passed an (I/W) unit in {PHY2011} and  Must have passed an (I/W) unit in {PHY2032, PHY2042}) or  (Must have passed an (I/W) unit in {BMS1052} and  Must have passed an (I/W) unit in {BMS2031, BND2011, BNS1072}))","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.25,"learnScore":4.112257496,"learnResponse":74,"proh":"","scaBand":2,"unitName":"Integrative neuroscience","description":"The major focus of this course relates to \"neuronal plasticity\" associated with nervous system function in health and disease. Structural and functional changes in nervous system function occur throughout development, adulthood and in disease states associated with neural dysfunction. This course seeks to: focus on specific examples of plastic changes in nervous system function; identify and describe mechanisms contributing to neuronal plasticity; develop an understanding of functional physiological and pathophysiological consequences of neuronal plasticity. We will explore neuronal plasticity at the cellular and neural circuit level associated with higher brain function, such as learning and memory, motor control, cognition and consciousness, and how disruption and dysfunction of neural circuit function contributes to disease states including Alzheimer\u0027s, Parkinson\u0027s, and Huntington\u0027s disease and traumatic brain injury-induced epilepsy. At the level of the peripheral nervous system and spinal cord, functional plasticity underlying the development of chronic pain states will be described. Throughout the course, an emphasis is placed on the use of state-of-the-art research and diagnostic technologies to investigate neural function, including imaging techniques. Emphasis is on assisted self-directed and project based learning.","enjoyResponse":25,"faculty":"Faculty of Science","unitCode":"PHY3012","eftsl":0.125}