{"preqs":"PHY2011 and PHY2032; or both BMS1052 and BMS2031; or at the discretion of the unit coordinator.","creditPoints":6,"rules":[{"startDate":"1/01/2013","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {PHY2011, PHY2021, PHY2032} or  Must have passed 2 (I/W) units in {BMS1052, BMS2031} or  Must have passed 2 (I/W) units in {BND1101, BND2103})","endDate":"31/12/2014"},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"(Must have passed 2 (I/W) units in {PHY2011, PHY2032} or  Must have passed 2 (I/W) units in {BMS1052, BMS2031})","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":4.402777778,"learnScore":2.861111111,"learnResponse":8,"proh":"","scaBand":2,"unitName":"Nutrition, metabolism and body weight","description":"The unit will build on knowledge of body systems acquired in year 2 and will commence with an exposition of the major nutrient groups, their digestion, absorption, intracellular processing, metabolism and storage.  This will lead on to a consideration of the ways in which stored nutrients are retrieved and of nutrient and energy fluxes within the body.  The sensing of food intake and nutrient stores will be described for each class of nutrients at the peripheral and central levels and the physiological regulation of appetite will be addressed.  Common and important disorders including obesity, metabolic diseases and diabetes will be studied. Aspects which include measurement of body mass and body composition, determination of food preferences, mechanisms of dysregulation of body mass, and interactions of disordered metabolism with the endocrine, cardiovascular and reproductive systems will be studied.  The role of public information and therapeutic interventions including a consideration of alternative therapies from the perspective of evidence-based practice will also be covered.","enjoyResponse":83,"faculty":"Faculty of Science","unitCode":"PHY3102","eftsl":0.125}