{"preqs":"","creditPoints":6,"rules":[],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)"]},{"location":"Malaysia","time":["First semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Mental health in the community","description":"Each day individuals encounter challenges that impact on their own and others\u0027 mental health and wellbeing. These include biological, psychological, and social factors, as well as behaviours such as binge drinking and inappropriate drug use, which can affect both individual health and have wider impact on the community. This unit will employ diverse teaching and learning methods to examine the history of asylums, the move towards deinstitutionalisation, and other advancements in psychological theory and practice that have promoted a push towards community-based mental health care delivery. Students will gain an understanding of the most prevalent mental health issues within the community, including depression, anxiety, drug and alcohol misuse, eating disorders, personality disorders, and psychosis. Common lifespan and developmental challenges for children, adolescents, young adults, and older adults will be discussed.Students will gain an appreciation of how the mental health system works within Australia, the types of community-based organisations, services, and resources available to individuals experiencing a mental health issue, and the barriers that interfere with mental health promotion and recovery from an episode of illness. In undertaking the unit, students will gain familiarity with real life problems faced by people who struggle with mental health difficulties, skills in critical thinking relevant to mental health and wellbeing, and the capacity to analyse responses to particular social and mental health problems.The unit will provide students with knowledge to enable them to participate in the multidisciplinary workforce that address these issues in local, state, and federal government departments, as well as in NGOs, small community-based organisations, and other setting where psychologists work.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"PMH1011","eftsl":0.125}