{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {3900, M5003}","endDate":""},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {PSY4408}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Teaching Period 2 2017 (Online)","Teaching Period 6 2017 (Online)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"PSY4408","scaBand":1,"unitName":"Perspectives in clinical and developmental neuroscience","description":"This elective is interdisciplinary, taking a lifespan approach to examine elements of neuroscience, developmental psychology, and mental health and illness, while also focusing on examines selected topical issues in psychology with a focus on mental health and illness.The unit focuses on aspects of mental health and illness that integrate traditional clinical information (e.g. symptoms, prevalence, aetiology), neuroscience (both neurodevelopmental and neurodegenerative disorders), and evidence-based treatments. The broad scope of mental health and illness is reflected in the choice of topics, and these topics may change to reflect current issues and debate within the field.The included topics reflect specific psychopathologies (e.g. posttraumatic stress disorder), specific life stages (e.g. childhood and adolescence), broad issues in mental health that transcend specific disorders (e.g. sleep, social support), and examine mental health in numerous settings (e.g. clinical, medical, and occupational).The overall goal of the unit is for students to develop an interest in current issues in the field, while recognising that psychologists need to be informed by research in several areas (e.g. neuroscience, developmental psychology,  clinical trials) while recognising the potential translational nature of their work","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"PSY4408","eftsl":0.125}