{"preqs":"Completed Bachelor\u0027s Degree and a major sequence in psychology approved by the Australian Psychological Society or qualification assessed as equivalent by the Australian Psychological Society, with a distinction average (70%) for third year psychology units.","creditPoints":6,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {M5003}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {PSY4100}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {PSY4001, PSY4002, PSY4011, PSY4012, PSY4021, PSY4022, PSY4100, PSY4210}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["Teaching Period 1 2017 (Online)","Teaching Period 3 2017 (Online)","Teaching Period 5 2017 (Online)"]}],"enjoyScore":4.071428571,"learnScore":3.862007168,"learnResponse":56,"proh":"PSY4001, PSY4002, PSY4011, PSY4012, PSY4021, PSY4022, PSY4100 and PSY4210","scaBand":1,"unitName":"Psychology research project: Literature review","description":"The overall GDPA research project is divided into three units, PSY4402, PSY4403 AND PSY4404, beginning with this unit, PSY4402. The collective aim of these units is to increase students\u0027 understanding of theoretical and methodological aspects of research, develop analytic, research and communication skills, as well as provide students with advanced knowledge in the science and practice of psychology. The research project meets the requirements of the Australian Psychological Society for Associate Membership.The aim of PSY4402 is to enable students to produce a high quality research project component, consisting of the production of a research report introduction/ literature review.Students will undertake a supervised research project that aims to provide training in both discipline specific and generic research skills, and form the basis of a literature review and research report presented at the end of the course. The thesis introduction/ literature review component of the research report will consist of a description of the students\u0027 project, a detailed review of the relevant literature, and a statement of the research hypotheses to be tested. Students will be provided with course materials and guidance to help them produce a high quality research proposal, source and synthesise appropriate research findings, and coherently synthesise this into a research project. The development of these skills and their application to the production of the introduction/ literature review component of the students\u0027 research project will build on their research and writing skills developed in previous courses.","enjoyResponse":30,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"PSY4402","eftsl":0.125}