{"preqs":"Levels 1 and 2 of BRadMedImag course, RAD3051 and RAD3061.","creditPoints":18,"rules":[{"startDate":"1/01/2013","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"(Must have passed 96 credit points at levels {1, 2} from units owned by {50001008} and  Must have passed 2 units in {RAD3051, RAD3061})","endDate":""},{"startDate":"1/01/2013","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {1963, 4526, M3006}","endDate":""},{"startDate":"1/01/2013","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {RAD3092}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.2,"learnScore":4.4,"learnResponse":23,"proh":"","scaBand":2,"unitName":"Medical imaging science and practice 2","description":"This 3rd year Unit expands upon the knowledge, skills and judgment acquired in year\u0027s one and two of the Course through more in-depth study of five themes that are relevant to radiographic practice.Theme 1: Sonographic Practice and ScienceSonographic anatomy and pathology of abdominal organs and related structures. Scanning techniques including Doppler ultrasound for the sonographic visualisation of abdominal organs and related structures. Ultrasound artefacts and the bio-effects and bio-hazards of diagnostic ultrasound.Theme 2: Radiographic PracticeOngoing development in general radiography examinations and professional communication to the level of competent practice.  The application and impact of ethics, registration and legal principles to radiographic practice.Theme 3: Breast ImagingThe scientific principles of breast imaging, instrumentation, positioning methods and radiation protection. Principles of breast ultrasound and localisation techniques.Theme 4: Research and Dosimetric TechniquesScientific principles of radiation dosimetry. Calculating the biological effects of ionising radiation. Applications of dosimetry in radiographic practice. Handling quantitative and qualitative data. Using statistical analyses to understand the relevance of data handling and research to radiographic practice.Theme 5: MRI PracticeContraindications for MRI, emergency situations and screening methods. MRI imaging sequences and methods for MRI examinations of the upper abdomen, pelvis and breast.","enjoyResponse":23,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"RAD3042","eftsl":0.375}