{"preqs":"Levels 1, 2 and 3 of the BRadMedImag.","creditPoints":24,"rules":[{"startDate":"1/01/2012","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Must have passed 144 credit points at levels {1, 2, 3} from units owned by {50001008}","endDate":""},{"startDate":"1/01/2012","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {RAD4070}","endDate":""},{"startDate":"1/01/2012","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {1963, 4526, M3006}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["First semester 2017 (Day)","Second semester 2017 (Day)","Full year 2017 (Day)"]}],"enjoyScore":3.916666667,"learnScore":4.071759259,"learnResponse":9,"proh":"RAD4070.","scaBand":2,"unitName":"Selected topics in medical imaging","description":"Element one provides students with the opportunity to undertake directed in depth study in one of the following specialities: medical ultrasound, advanced multislice CT, advanced paediatric imaging or MR imaging of the heart.Element two builds upon the foundation established in earlier years of the course and examines in greater depth the scientific method and the various research designs available to clinicians seeking answers to health related questions. This element will equip students with the capacity to differentiate between quantitative and qualitative research methods, evaluate the veracity of research claims, understand current trends in research in medical imaging and their implications for evidence based health care.Element three provides students with the opportunity to apply the knowledge developed in element two and complete a critical analysis of a specified topic either directly related to the speciality addressed in element one or to another broader aspect of modern medical imaging. Students will learn how to communicate effectively using written and oral communication through the creation of a written report and a formal oral presentation.","enjoyResponse":13,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"RAD4080","eftsl":0.5}