{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any 2 (I/W) co-req units in {RTS4101, RTS4103}","endDate":""},{"startDate":"1/01/2016","status":"ACTIVE","ruleSummary":"TRANS","ruleString":"Unit was previously coded {MMR4002}","endDate":""}],"locationAndTime":[{"location":"Clayton","time":["Second semester 2017 (Online)"]}],"enjoyScore":3.5,"learnScore":4.07037037,"learnResponse":14,"proh":"","scaBand":2,"unitName":"Radiation therapy science 2","description":"This unit is the first of three units dealing specifically with the principles and applications of radiation therapy planning and treatment. This unit will cover anatomy, physiology, pathology and oncology of the: integumentary, female reproductive, male reproductive, lower respiratory, lower digestive, urinary and renal systems. In addition students will also analyse and evaluate the principles of radiation therapy planning for metastatic disease and palliative care. Students will appraise and identify cross sectional and 3D anatomy from a range of imaging modalities including CT, MRI and PET. Students will gain in-depth knowledge on the molecular basis of cancer. Students will be able to analyse and describe cancer management strategies, including chemotherapy, surgery and radiation therapy, and synthesis these with individual patient diagnosis and staging. This unit will introduce a series of professional issues; communication, ethics, patient care, cultural awareness and occupational health and safety as they relate to radiation therapy. Students will undertake a 1 week clinical orientation to allow for the development of beginner level professional and technical skills. Whilst studying these topics, students will be encouraged to critically reflect, analyse and synthesis relevant information from the literature and reflect on their clinical experiences to further develop and build their critical analysis skills.","enjoyResponse":12,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"RTS4102","eftsl":0.25}