{"preqs":"","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 07, 07G, 07PG, 11, 42, 50PG, 76, 78}","endDate":""},{"startDate":"1/01/2011","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 07, 07G, 07PG, 11, 42, 50PG, 76, 78}","endDate":"31/12/2016"},{"startDate":"1/01/2011","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Permission required","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Permission required","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["First semester 2017 (Off-campus)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":1,"unitName":"Gender, climate change and social sustainability","description":"In recent decades significant climate and environmental disasters and threats have impacted on the way people and communities live.As a consequence our ability to live sustainably will be one of the challenges of the twenty-first century. These changes have significant social impacts and this unit provides a social work perspective to this new field of practice - social work in post-disaster sites.SWM5260 provides an international and national focus on emerging threats such as climate change, water and food insecurity, environmental disasters, terrorist actions, migration and social movements.It also examines their gendered impacts and how these affect people and communities.Research from across the world reveals that impacts vary significantly between women and men and across the lifespan and that these factors will affect the abilities of individuals, families and communities to adapt.Social workers will be critical workers providing the link between people, communities and the policy environment in uncertain times.This unit will prepare social workers to be critical change agents working in post-disaster sites.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"SWM5260","eftsl":0.25}