{"preqs":"SWM5008, SWM5102, SWM5103","creditPoints":12,"rules":[{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any 4 (I/W) co-req units in {SWM5105, SWM5106, SWM5109, SWM5111}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any 4 (I/W) co-req units in {SWM5105, SWM5106, SWM5109, SWM5111}","endDate":"31/12/2016"},{"startDate":"1/01/2017","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 07, 07G, 07PG, 11, 42, 50PG, 76, 78}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 5 (I/W) units in {SWM5100, SWM5101, SWM5102, SWM5103, SWM5104}","endDate":"31/12/2016"},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 07, 07G, 07PG, 11, 42, 50PG, 76, 78}","endDate":"31/12/2016"}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)","Second semester 2017 (Off-campus)"]}],"enjoyScore":3.869047619,"learnScore":3.961679293,"learnResponse":16,"proh":"","scaBand":1,"unitName":"Supervised professional practice 2","description":"Supervised Professional Practice 2 enables students to operationalise the professional social work role. In doing so, students are expected to be able to conceptualise, articulate and explain the progress they are making in relation to their development of a professional social work identity. Students will learn to assess and analyse social work situations and plan appropriate intervention strategies across a diverse range of social work methods and settings, from direct practice with individuals and groups, community development, program development, agency administration, policy or research.Theorising about social problems, critically analysing interventions and reflecting on how one\u0027s \u0027use of self\u0027 impacts on social work relationships are essential components of learning in clinical practice placements. In addition, students are expected to complete a piece of practice research and to develop competencies in line with the AASW\u0027s practice standards, while adhering to the AASW Code of Ethics.The unit comprises 480 hours of supervised professional practice in the field and 20 hours of skills development in the classroom and in the field. The successful completion of a total of 1,000 hours (clinical placements and skills) in the MSW (Qualifying) will enable graduates to seek social work positions overseas where the completion of 1,000 hours of clinical practice placement is often an eligibility requirement.","enjoyResponse":34,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"SWM5108","eftsl":0.25}