{"preqs":"SWM5100, SWM5101, SWM5102, SWM5104.","creditPoints":6,"rules":[{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed 4 (I/W) units in {SWM5100, SWM5101, SWM5102, SWM5104}","endDate":""},{"startDate":"1/01/2014","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course type {04, 05, 06, 06G, 07, 07G, 07PG, 11, 42, 50PG, 76, 78}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)","Second semester 2017 (Off-campus)"]}],"enjoyScore":4.095238095,"learnScore":3.333333333,"learnResponse":2,"proh":"","scaBand":1,"unitName":"Leadership in social work and human services","description":"This unit will introduce students to an understanding of leadership in the human  services in Australia as a requirement for social work practice, one that is not always understood or accepted professionally. The human services sector is expanding in the numbers of its component organisations, both governmental and non-governmental, and in the size and complexity of the component parts. Leadership of social change and social justice in the human services is now at a premium, having been given little attention in the past or currently. Little is known of leadership requirements in this sector particularly as contrasted with other service sectors. Students undertaking this unit will be introduced to theories of leadership of humanservice organisations, their programs and policies, and leadership of the new organisational phenomena in this sector, large community service departments, non-governmental consortia, and advocacy organisations. They will also be introduced to other notions of leadership in social work - leadership through research, advocacy and community action.Subsequently, theories of leadership will be placed against the experiences and views of current social work leaders in this sector, who will be active participants in this unit, so that students gain some understanding of what leadership comprises, what priority actual leaders place on the various aspects of leadership, and what research and theory underpins actual leadership in the policy development, planning and delivery of social services today.","enjoyResponse":24,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"SWM5111","eftsl":0.125}