{"preqs":"","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {TRM4002}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {TRM6001}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {M4002}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["First semester 2017 (On-campus block of classes)"]},{"location":"City (Melbourne)","time":["Second semester 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Introduction to clinical trials","description":"Successful clinical research is conducted under the guise of a well-constructed study question that is feasible, interesting, novel, ethical and relevant. A study design must be conceived with appropriate measures of clinical observation and intervention. This unit will establish a fundamental knowledge in drug development, conducting Clinical Trial studies, designing a good protocol, international conference on harmonisation good clinical practice (ICH-GCP) and delegation of responsibility and co-ordination. The unit provides instruction in the development of a clinical research question and creating a concise protocol that includes literature review, study design, subject sampling and recruitment, instruments and other measurement approaches, sample size, consent form, budget and timetable. The aim of the unit is to introduce students to the processes and regulations involved in developing a therapeutic through to clinical trials. Students completing this unit should be able to construct a testable clinical research question and design a protocol that is ethical, well controlled and statistically powerful. Students should also be able to identify the roles of the sponsor, the investigator, the institutional review board/ independent ethics committee and the local regulators.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"TRM4001","eftsl":0.125}