{"preqs":"Students need to have completed and passed a minimum of 96 credit points in an undergraduate Science Discipline programme prior to enrolling in this unit.","creditPoints":6,"rules":[{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {M4002}","endDate":""},{"startDate":"1/01/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with (I/W) {TRM6002}","endDate":""}],"locationAndTime":[{"location":"City (Melbourne)","time":["First semester 2017 (On-campus block of classes)"]},{"location":"City (Melbourne)","time":["Second semester 2017 (On-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"","scaBand":3,"unitName":"Translational research","description":"Translational research is a growing and exciting new discipline in medicine that deals with the development of fundamental scientific findings into tangible clinical outcomes. Translational researchers are involved in identifying a worthwhile scientific finding that can be applied to a clinical setting. Along this research and development pipeline are a series of critical check-points that provide the investigator vital tools to generate a valuable result that has merit for translation. This unit will establish a fundamental knowledge in the processes involved in developing a basic science finding through to clinical studies. The unit provides workshop-based learning in the development of discipline-specific laboratory research questions and how they are applied to broader clinical applications. The main focus of this unit is to identify how fundamental scientific questions may have multidisciplinary clinical answers. Other core learning outcomes are through understanding how scientific concepts can be marketed and communicated effectively through research pipeline procedures and the responsibilities of the researcher that may be derived from this.","enjoyResponse":0,"faculty":"Faculty of Medicine, Nursing and Health Sciences","unitCode":"TRM4002","eftsl":0.125}