{"preqs":"Entry into Bachelor of Visual Arts course","creditPoints":6,"rules":[{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {VIS1102, VIS1112, VPR1001, VPR1002}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {A2005%, D30014, D30061, D30062, F2006%, F2007%}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":3.833333333,"learnScore":3.409722222,"learnResponse":7,"proh":"VPR1001, VPR1002","scaBand":1,"unitName":"Research practices","description":"Research Practices is a core unit in the Visual Arts sequence and is one of four 1st year units. This unit is a practice driven, workshop based unit which explores varied drawing methodologies and ways they can contribute to a research practice in visual culture. It is designed to develop, challenge and expand how students think about making artwork and to develop research skills. A series of individual and collaborative exercises and projects are presented as starting points that, when navigated, foster creative research skills and develop students\u0027 material skills. The main emphasis of this class is to demonstrate how thinking operates through making. Fabrication processes in the workshop can be in any medium from across two- and/or three-dimensional works, to sound and performance. The aim of these exercises is to have a generative influence on production, creating a pool of ideas, strategies, forms and processes for students to draw on and develop as they progress through the course. Teaching methodology involves critical dialogue, classroom discussion and peer review. This unit presents a broad range of approaches to contemporary art and its institutions for those wishing to work in the arts industry as artists, curators, arts writers, educators or practitioners. Research Practices encourages an experimental approach to conceptual and material outcomes. Safe and sustainable approaches to fabrication and materials are core values in the unit.","enjoyResponse":6,"faculty":"Faculty of Art, Design and Architecture","unitCode":"VPR1113","eftsl":0.125}