{"preqs":"VPR2011","creditPoints":6,"rules":[{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {A2005%, D30014, D30061, D30062, F2006%, F2007%}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {VPR2002}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {VPR2011}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]},{"location":"Prato","time":["Second semester 2017 (Off-campus block of classes)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"VPR2002","scaBand":1,"unitName":"Professional practice","description":"This is a core unit in the Visual Arts and is second of the two 2nd year units. The unit provides students with a broad range of approaches to cultural production for those wishing to work in the visual arts industry across a diverse range of professional platforms. This unit introduces students to various professional processes and outcomes that contemporary visual artists engage and exhibit in. The workshop-driven classes incorporate theoretical and historical perspectives on these gallery-based modes. This unit introduces various steps required to make art public from: studio-based processes; the engagement of critical feedback; administrative processes associated with gallery-based exhibition; installing an artwork; and contextualising the artwork in a considered theoretical and curatorial framework. The workshop program facilitates a support structure for the development and consolidation of experimental approaches to conceptual and material outcomes of burgeoning research interests. Students are required to investigate and develop individual and collaborative solutions to a series of creative public outcomes. Teaching methodology involves lectures, fieldtrips, critical dialogue, class discussion and peer review. Safe and sustainable approaches to fabrication techniques and materials are promoted as core values in the unit.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"VPR2012","eftsl":0.125}