{"preqs":"VPR3011 and 2 department approved electives","creditPoints":12,"rules":[{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"PREREQ-IW","ruleString":"Must have passed an (I/W) unit in {VPR3011}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"INCOMP-IW","ruleString":"Incompatible with achievement in (I/W) {VPR3002}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"COREQ-IW","ruleString":"Any co-req (I/W) unit in {OHS1000}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"COREQ","ruleString":"Must be enrolled in course version {A2005%, D30014, D30061, D30062, F2006%, F2007%}","endDate":""},{"startDate":"1/06/2015","status":"ACTIVE","ruleSummary":"PREREQ","ruleString":"Must have passed 12 credit points from units owned by {50000767}","endDate":""}],"locationAndTime":[{"location":"Caulfield","time":["Second semester 2017 (Day)"]}],"enjoyScore":3,"learnScore":3,"learnResponse":0,"proh":"VPR3002","scaBand":1,"unitName":"Visual practices 3","description":"This unit is the last and culminating unit in the Visual Practices sequence and is second of the two 3rd year units. In this unit emphasis is placed on independent cultural research and its relation to a broader collaborative or group context in the public realm. Students develop a creative, expressive and critical project that utilises advanced conceptualisation and material manipulation, engaging with the artwork as part of a chain of production, reception, distribution and publics. Students develop individual programs in conjunction with the lecturers that reflect their evolving cultural practice and professional direction. The program focuses on clear articulation of concepts and their publication in the written form as a supplement to the student\u0027s Visual Practice. Detailed analysis and discussion of students\u0027 work takes place primarily through personal tuition with lecturers, peer-based critique and experimenting with various modes of public presentation. This unit provides a stimulating and supportive environment through the introduction of a supervised studio and bridges this to independent professional practice in the broader arts arena. This unit contextualises individual practice within various public platforms that require different modes of group and/or collaborative modes of engagement. The work produced culminates in an end of year exhibition of a professional standard, preparing students for entry into the professional world as cultural producer in broad array of Visual Arts disciplines, or the pursuit of further studies at a higher level.","enjoyResponse":0,"faculty":"Faculty of Art, Design and Architecture","unitCode":"VPR3012","eftsl":0.25}